{"ENHANCED_ATTACKS":{"id":"ENHANCED_ATTACKS","name":"enhanced attacks","text":"Natural attacks granted by your shapeshifts count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage."},"FREEFORM_TRAITS":{"id":"FREEFORM_TRAITS","name":"freeform traits","text":"Choose two (genotype) talents you don’t already possess. You add the traits made available by those talents to the traits available when using shapeshift, but you don’t gain the ability to use the chosen forms. If you ever gain one of the chosen (genotype) talents, you can replace the talent, choosing another (genotype) talent to add traits from. You can gain this talent multiple times; each time choosing two different (genotype) talents to draw traits from."},"GREATER_TRANSFORMATION":{"id":"GREATER_TRANSFORMATION","name":"greater transformation","text":"**Augment 0 sp:** Increase the number of traits you can apply with your shapeshift by 1."},"MIMICRY":{"id":"MIMICRY","name":"mimicry","text":"**Casting Time:** 1 action  \n**Range:** 30 ft.  \n**Duration:** 1 hour or until used again  \n**Target:** One creature  \n**Saving Throw:** None  \n**Cost:** 0 sp\n\nYou can study a creature you can see within range. For the duration of the effect, you gain a single Alteration talent corresponding to the creature or one of the creature’s apparent features.\n\n**Augment 1 sp:** This ability may be used with no action required during your turn.\n\nIn addition, you gain the following traits you can add to your shapeshifts:\n\n* **Vocal Mimicry:** The target may perfectly imitate voices and sounds with which it is familiar. The target gains advantage on Charisma (Deception) checks to imitate a creature type, individual, or object that they have listened to for at least 10 minutes. These 10 minutes do not have to have been during the duration of the shapeshift. (Must be able to speak)"},"ENERGY_MANIPULATION":{"id":"ENERGY_MANIPULATION","name":"energy manipulation","text":"**Prerequisites:** Alteration sphere (any talent granting resistance to either acid, cold, fire, lightning, necrotic, radiant, or thunder as a trait option), 11th level or higher.\n\nYou can add the following trait to your forms:\n\n* **Energy Immunity: (Augment 1 Sp)** You can grant the target immunity to one energy type (acid, cold, fire, lightning, necrotic, radiant, or thunder) to which it has resistance.\n* **Vulnerability:** You can grant the target vulnerability to one of the following damage types: acid, cold, fire, lightning, necrotic, radiant, or thunder. If the target has resistance to the chosen damage type, it instead loses that resistance. If the target is immune to the damage type, this trait reduces that immunity to resistance."},"EXTREME_TRANSFORMATION":{"id":"EXTREME_TRANSFORMATION","name":"extreme transformation","text":"**Prerequisites:** Alteration sphere (Greater Transformation), 5th level or higher.\n\nIncrease the number of traits you can apply with your shapeshift by 1\\. This stacks with the increase from Greater Transformation. This talent may be taken once, then one additional time at 11th level and 17th level. Its effects stack."},"FUSION":{"id":"FUSION","name":"fusion","text":"**Prerequisites:** Alteration sphere, Universal sphere (Mass (metasphere), 5th level or higher.\n\n**Augment 2 sp:** You can target two creatures adjacent to each other with your shapeshift and merge them together into one amalgamated body in lieu of applying a (genotype) talent. Traits may be granted to the merged creature as normal for shapeshift. Should this ability fail to affect either target (whether by successful save or another cause), the effect fails.\n\n* The amalgamated body has current and maximum hit points equal to those of the two creatures added together.\n* You must choose one body to be the dominant body.\n* The amalgamated creature possesses the physical saving throw proficiencies and proficiency bonus of the dominant body, but gains whatever the highest Strength, Dexterity, and Constitution score is between the two combined creatures.\n* At the caster’s discretion, the dominant body may also gain the natural weapons and special abilities of the merged body by forgoing gaining any additional traits.\n* The equipment of the dominant body is retained, and the other creature’s equipment is merged.\n* Both of the base creatures’ minds remain independent, retaining mental ability scores, and saving throw proficiencies, and are capable of taking purely mental actions, but they act on the same initiative.\n\nOnly one mind can control the amalgamated body at a time. At the start of their turn, if the minds do not agree which is to be in control, they may make contested Charisma checks to take control of the body that round, but the body has all its speeds halved, takes a disadvantage on Dexterity saving throws, and grants advantage on any attacks targeting the amalgamated body due to the confusion. Effects that allow a mental ability saving throw target the mind currently controlling the body.\n\nOngoing effects on the base creatures overlap. If either target creature is suffering the effects of a disease, poison, or ongoing spell effect, the amalgamated body immediately receives a new saving throw with advantage unless both creatures are under the same effect. If the dominant body possesses immunity to such an effect, the effect is suspended until the fusion ends, though its duration is expended as normal. Any penalty or reduction to the physical statistics of the dominant body are retained, but those to mental ability scores continue to affect each creature individually. If the amalgamated creature is killed, the effect ends and both creatures die.\n\nWhen this effect ends for any other reason, any hit point damage, ability reductions, or other such penalty incurred is split evenly between the two creatures (rounded up). If this damage exceeds the maximum hit points of either creature, that creature is reduced to 0 hit points and is stable, with the excess damage transferred to the other creature. If the transferred damage exceeds the remaining hit points of that creature, then both creatures are reduced to 0 hit points and are stable. Any spell effects, poisons, diseases, or other effects that affected the amalgamated creature continue to affect both creatures, but durations are halved and any subsequent saves are made with advantage. If the space available at the end of this effect cannot accommodate both creatures, they may make contested Charisma checks. The loser is shunted to the nearest empty space, taking 1d6 damage per 10 feet of solid material it passes through.\n\nYou cannot fuse with creatures like swarms or troops which are generally described as being composed of multiple creatures."},"HOMOGENIZE":{"id":"HOMOGENIZE","name":"homogenize","text":"**Prerequisites:** Alteration sphere (Twisted Body (trait)), 15th level or higher.\n\n**Augment 5 sp:** Creatures you damage with Twisted Body (trait) that have less than 100 hit points must succeed on a Constitution saving throw or be slain, reducing them to a homogenous pool of organic material."},"PERMANENT_TRANSFORMATION_CURSE":{"id":"PERMANENT_TRANSFORMATION_CURSE","name":"permanent transformation [curse]","text":"**Prerequisites:** Alteration sphere, Universal sphere (Extended (metasphere)), 17th level or higher.\n\n**Augment 4 sp:** When applying a shapeshift, you can change your shapeshift into an instantaneous effect, permanently changing the creature into the new form. Because this is an instantaneous effect, it cannot be dispelled once placed, however spells or sphere talents or abilities that explicitly remove curses can end the shapeshift with a successful spellcasting ability check. The target is still under the effect of a shapeshift, however, and any caster attempting to apply a new shapeshift to the target (except the original caster himself) must pass a spellcasting ability check as usual; the second shapeshift replaces the first instead of adding to it. When the second shapeshift’s duration expires, the first shapeshift returns. A second application of a Permanent (genotype) can be used to counter the first Permanent Transformation, returning the target to its original form or granting it a new one."}}