{"AMORPHOUS_CREATURES":{"id":"AMORPHOUS_CREATURES","name":"amorphous creatures","text":"**Augment 0 sp:** When summoning a companion whose (base) involves a choice (such as Dragon or Elemental), each time you summon your companion you may change this choice. For example, if your companion is an elemental, you may change it to a water, air, earth, or fire-based companion each time you summon it."},"CALL_THE_DEPARTED":{"id":"CALL_THE_DEPARTED","name":"call the departed","text":"**Augment 1 sp:** When summoning a companion, you may summon a companion that has already been reduced to 0 hit points. The companion reappears at one quarter of its maximum hit points and takes a -1 penalty to all d20 rolls it makes. Any other conditions or ongoing effects on the companion are removed. This penalty lasts until you complete a long rest but otherwise may not be removed.\n\nOnce you have summoned an ally through this augment, you don’t need to use this augment again unless it is once again reduced to 0 hit points. Penalties from multiple uses of this ability stack. If the companion would have a penalty greater than your proficiency bonus, you cannot summon it again until the penalty is removed."},"EXTRA_COMPANION":{"id":"EXTRA_COMPANION","name":"extra companion","text":"You gain an additional companion. Whenever you summon a companion, you must select only one of your companions, and you cannot have multiple companions summoned at once. You can select this talent multiple times. Each time it is selected, you gain another companion.\n\nThis talent cannot be gained through any ability that grants talents temporarily."},"LINK":{"id":"LINK","name":"link","text":"You gain a telepathic link to each of your companions. So long as you are on the same plane as one of your companions, you can communicate with that creature over any distance."},"SPELL_CONDUIT":{"id":"SPELL_CONDUIT","name":"spell conduit","text":"Your companions can deliver touch spells and sphere abilities for you. If you and one of your companions are in contact at the time you cast a touch spell or sphere ability requiring a melee spell attack, you can designate your companion as the attacker. You can touch a companion within your natural reach (no action required) during your turn to initiate this contact; your companion may do the same during its turn. The companion can then deliver the spell or ability just as you would with the same action cost. If you cast another spell or sphere effect before the effect is delivered, the spell or effect dissipates.\n\nYou can take this talent multiple times. If taken twice, the companion may be anywhere within 30 feet of you when you cast the spell or ability and may also deliver ranged spell attacks, using its attack modifiers and serving as the effect’s point of origin. Each additional time this talent is taken, increases the range at which this ability functions; increasing to 120 feet, then to 300 feet."},"SPELL_LINKED_COMPANIONS":{"id":"SPELL_LINKED_COMPANIONS","name":"spell-linked companions","text":"You can apply the following augment to any sphere effect you cast that targets you:\n\n**Augment 0 Sp:** You can apply the effect to one Conjuration sphere companion. The affected companion must be within 30 feet. This augment may be used even on effects that normally can only target the caster."},"CALLING":{"id":"CALLING","name":"calling","text":"**Prerequisites:** Conjuration sphere.  \n**Casting Time:** 10 minutes  \n**Cost:** 2 sp  \n**Range:** 30 feet  \n**Duration:** special\n\nYou can call beings from other planes and bring them into your own. Calling takes one of two forms: allies and hostiles. If you call a servant of an extraplanar being with which you have a strong connection (i.e., a cleric calling a servant of its god) they are considered an ally. All other creatures are considered hostiles, regardless of their disposition towards the caster. GMs have the final say in whether or not a character is capable of calling allies.\n\nTo call a target, you must choose a location within 30 feet for them to appear, and the kind of creature to be called must be known and stated. If you wish to call a specific individual, you must use that individual’s proper name. You can call multiple creatures with one use of this ability (up to 3 at once) but the combined CR of all called creatures cannot exceed half your level.\n\n**Hostiles:** If a hostile creature is unwilling to be called, it is allowed a Wisdom saving throw to resist. If the saving throw succeeds, the creature is not called. If the saving throw fails, the creature is immediately called.\n\nWhen a hostile creature is called, it is rooted to a specific location within range (you can decide how much space to give it, up to a 30-foot radius). It cannot leave this area until an agreement with you has been reached. It can escape this location by teleportation or dimensional travel, or with a successful Charisma saving throw. It can try each method once per day. If it breaks loose, it can do as it pleases including fleeing, returning to its home plane, or attacking you.\n\nIf the creature does not break free of its prison, you can keep it bound for as long as you dare. You can attempt to compel the creature to perform a service by describing the service and perhaps offering some sort of reward. You make a Charisma check contested by the creature’s Charisma check. The check may have advantage based on the nature of the service and the reward. If the creature wins the opposed check, it refuses service. New offers, bribes, and the like can be made or the old ones re-offered every 24 hours. This process can be repeated until the creature promises to serve, until it breaks free, or until you decide to dismiss it (a free action so long as it remains trapped). Impossible demands or unreasonable commands are never agreed to. If you ever roll a natural 1 on the Charisma check, the creature breaks free of the effect and can escape or attack you.\n\nOnce the requested service is completed, the creature need only to inform you to be instantly sent back whence it came. The creature might later seek revenge. If you assign some open-ended task that the creature cannot complete through its own actions, the effect remains for a maximum of 1 day per level, and the creature gains an immediate chance to break free (with the same chance to resist as when it was trapped). Note that a clever recipient can subvert some instructions.\n\n**Allies:** Allies are never hostile and do not resist, although additional payment is always expected for their services. Payment can take a variety of forms, from donating gold or magic items to an allied temple, to a gift given directly to the creature, to a quest on your part that matches the creature’s alignment and goals. Regardless, this payment must be made before the creature agrees to perform any services. The bargaining takes at least 1 round, so any actions by the creature begin in the round after it arrives.\n\nAs a rule of thumb, a task that can be measured in minutes requires a payment worth 100 gp per minute. A task measured in hours requires 1,000 gp per hour. And a task measured in days (up to 10 days) requires 10,000 gp per day. The GM can adjust these payments based on the circumstances under which you cast the spell. If the task is aligned with the creature’s ethos, the payment might be halved or even waived. Non-hazardous tasks typically require only half the suggested payment, while especially dangerous tasks might require a greater gift. Creatures rarely accept tasks that seem suicidal. Unlike a companion from the Conjuration sphere that simply returns to its home plane when reduced to 0 hit points, a called creature actually dies when it is killed.\n\nIf an agreement cannot be reached, the ally returns to their home plane immediately. If you are not willing to give the requested payment, but attempt to press the target into service anyway, treat the creature as hostile. Pressing a creature in this way may have a detrimental effect on any future attempts to call an allied outsider.\n\nAt the end of its task, or when the bargained duration expires, a called ally returns to its home plane (after reporting back to you, if appropriate and possible)."},"DIAGRAM":{"id":"DIAGRAM","name":"diagram","text":"**Prerequisites:** Conjuration sphere (Calling).\n\n**Augment 0 sp:** When using the Calling advanced talent to call hostile creatures, your traps are even harder to break than usual. If you spend 10 minutes and pass a DC 15 Intelligence (Arcana) check to prepare a calling circle before you call a creature, that creature finds it very difficult to escape. You cannot know the result of your check until after the calling is performed, but you can treat the result of the die roll as a 20 by dedicating 4 hours to creating the circle.\n\nIf your check is successful, the called creature cannot use any dimensional or teleportation effects, nor can any of its abilities or attacks cross the prison’s border. When pitting its Charisma against your trap, the DC increases by 5\\. While a creature cannot disturb the calling circle, if any outside force disturbs the circle (even a hair falling across it), the called creature is immediately freed."},"DIVIDED_COMPANION_FORM":{"id":"DIVIDED_COMPANION_FORM","name":"divided companion (form)","text":"**Prerequisites:** Conjuration sphere.\n\nYour companion is not a single creature, but is rather a group of creatures that all behave together in combat. The companion takes the form of a troop of creatures of its kind. The troop is composed only of Small or Medium creatures; this cannot be used on a swarm companion and this companion’s size cannot be altered by Altered Size, enlarge person, or other effects. The troop fills a 20-foot square (or cube if flying) and has its normal reach and can occupy another creature’s space and vice versa. The companion can move through openings that are large enough for the individual creatures.\n\nAdditionally, the troop has advantage on Strength checks, Strength saving throws, and any saving throw made against effects that target a single creature, but disadvantage on any saving throw made against effects that target an area.\n\n##### Divided Companion Troop Damage\n\nTo determine the damage a troop deals with a natural weapon, unarmed strike, or weapon, increase the attack's damage die by two sizes and multiply the number of rolled dice by x2, or x1 if the troop has half its hit points or fewer. For example, if a companion's attack would normally deal 1d6 damage, it would deal 2d10 damage, or 1d10 if at half hit points or fewer. See **Table: Damage Dice Progression** on the [Using Spheres of Power](/using-spheres-of-power) page if you are unsure how to progress a damage die.\n\nSpell attacks, melee or ranged, do not have their damage increased in a troop, nor do they have their damage reduced in a troop if they are at half hit points or fewer.\n\n**Note:** Additional damage that is applied to your companion's attacks, such as from Elemental Creature (form), do not have their damage increased in a troop, nor do they have their damage reduced in a troop if they are at half hit points or fewer."},"GHOSTLY_CREATURE_FORM":{"id":"GHOSTLY_CREATURE_FORM","name":"ghostly creature (form)","text":"**Prerequisites:** Conjuration sphere.\n\nYour companion can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."},"GROUP_SUMMON":{"id":"GROUP_SUMMON","name":"group summon","text":"**Prerequisites:** Conjuration sphere (Extra Companion).\n\n**Augment 1 sp:** You can summon an additional companion that you possess. This augment may be applied multiple times to summon additional companions. Losing concentration on the summon causes all the companions to disappear."},"INDEPENDENT_COMPANION":{"id":"INDEPENDENT_COMPANION","name":"independent companion","text":"**Prerequisites:** Conjuration sphere.\n\nAllied creatures can spend their bonus action in your place to allow a companion to take actions other than the Dodge action. If you have multiple companions summoned, you or an ally can spend a single bonus action to allow all companions to take actions other than the Dodge action.\n\n**Augment 1 sp:** Your summoned companions obey any verbal commands that you or an ally issue to them (no action required by you or the ally). If you don’t issue any commands to them, they defend themselves from hostile creatures, but otherwise take no actions.\n\n**Augment 2 sp:** Your summoned companions will obey, but don’t require any verbal commands to take any action other than the Dodge action. Your companion will take actions on their own that they believe are in the best interest of you and themselves according to the circumstances of the situation.\n\nFor example, if you command a summoned companion to scout ahead for enemies, and along the way they find a trap, they will also include the trap’s location as part of their report; or for example, if during combat you fall unconscious, your companion will take actions to either remove you from harm’s way, wake you up, or treat your injuries."},"VANISHING_COMPANION_FORM":{"id":"VANISHING_COMPANION_FORM","name":"vanishing companion (form)","text":"**Prerequisites:** Conjuration sphere (Shadow Creature), 11th level or higher.\n\nYour companion may use Dexterity (Stealth) to hide even while observed and lacking in concealment."}}