{"ALCHEMICAL_CREATION":{"id":"ALCHEMICAL_CREATION","name":"alchemical creation","text":"**Augment 1 sp:** You can create items that require mixing, such as acid flasks, alchemist’s fire, antitoxin, basic poison, and other, similar items at the GM’s discretion. You create only a single item appropriate for your size."},"ALTERING_BURST":{"id":"ALTERING_BURST","name":"altering burst","text":"**Augment 1 sp:** You can alter all unattended non-magical objects in a 10-foot radius around yourself. You can choose any number of materials that you can create within this area to be affected. (For example, you can choose to destroy a stone wall while leaving the wooden dresser resting against it unharmed.)\n\nIf you possess the Reaching (metasphere) Universal talent, you can center this effect anywhere within range. When augmenting the effect with Potent Alteration, you can alter one worn or held or magical object, increasing by up to one at 5th level (2 objects), 11th level (3 objects, and 17th level (4 objects). These altered worn or held or magical objects are in addition to other objects in the area.\n\n**Augment 1 sp:** Increase the radius to 20 feet."},"CATAPULT":{"id":"CATAPULT","name":"catapult","text":"Your create gains the following augments:\n\n**Augment 0 sp:** When you create an item, you may create it with momentum. The object flies from the point of creation in a straight line as wide as the object up to 60 feet in a direction you choose before falling to the ground, stopping early if it impacts against a solid surface. If the object would strike a creature, that creature must make a Dexterity saving throw. On a failed save, the object strikes the target and stops moving. When the object strikes something, the object and what it strikes suffer the object’s falling damage from a normal height.\n\nIn addition, when augmenting create with the Catapult talent, you can apply one of the following augments:\n\n**Augment 1 sp:** When determining the damage that a struck target takes, roll the falling damage twice and add them together.\n\n**Augment 2 sp:** When determining the damage that a struck target takes, roll the falling damage thrice and add them together."},"COMPLEX_CREATION":{"id":"COMPLEX_CREATION","name":"complex creation","text":"**Augment 0 sp:** When you create an object, you can create a themed ‘creation’ that is made up of multiple different objects. For example, you could create a quiver full of arrows, or if creating a building you could include chairs, beds, barrels, etc.). You must be able to create all materials required for the complex creation.\n\n**Augment 1 sp:** When you create an object two or more sizes smaller than your maximum, you can delay your creation so that rather than creating a single object once, it creates multiple identical objects over time. The total size of all created objects cannot exceed one size above your maximum create size. As a general rule, two objects of a similar size count as one size larger (2 Small objects equals a Medium object, 2 Medium objects equals a Large, etc.). You must set a parameter when this effect is created for when and where within range the items are created (for example, creating a new arrow in a quiver whenever the previous arrow is removed, or dropping a new anvil each round onto a target location, determined at the time of casting). This continues for the duration of the create effect or until the maximum size (or another limit, subject to GM approval) has been reached, whichever comes first."},"EXPANDED_MATERIALS":{"id":"EXPANDED_MATERIALS","name":"expanded materials","text":"**Augment 1 sp:** When you create an object, you can work with any solid fragile material that is non-harmful and does not possess any unusual properties, such as glass, ice, or leather. You can also create harmless liquids like water (3 cubic feet equals a Small creature), but not gases or flesh. You can also make objects with multiple materials, provided you can create all the materials required.\n\nAs you gain levels, you also gain the ability to make steadily more materials, as detailed in the table below. Adamantine cannot be created or altered, except for the repair and destroy abilities, and created gems cannot be used as material components.\n\n##### Table: Classic Substances\n\n| Level | Materials                          |\n| ----- | ---------------------------------- |\n| 1st   | Stone                              |\n| 5th   | Basic metals (copper, iron, steel) |\n| 11th  | Precious metals (gold, silver)     |\n| 17th  | Specialty metals (mithril), gems   |"},"EXQUISITE_DETAIL":{"id":"EXQUISITE_DETAIL","name":"exquisite detail","text":"**Augment 0 sp:** Items you create are more intricate, and much harder to identify as fakes. You are proficient in ability checks made to create detailed or complicated objects and to any DC required to detect objects you create as magical fakes.\n\nIf you are already proficient, you instead add twice your proficiency bonus. This does not stack with similar effects. Those attempting to detect magic on your created objects must pass a spellcasting ability check against your sphere DC to detect any lingering creation auras."},"GREATER_ALTER":{"id":"GREATER_ALTER","name":"greater alter","text":"**Augment 0 sp:** The damage dealt with your destroy alter ability now uses d8’s instead of d4’s.\n\n**Augment 0 sp:** The amount healed with your repair alter ability now uses d8’s instead of d4’s."},"MAGICAL_CREATIONS":{"id":"MAGICAL_CREATIONS","name":"magical creations","text":"Objects you create are considered magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage."},"MAGNIFY_MINIMIZE":{"id":"MAGNIFY_MINIMIZE","name":"magnify/minimize","text":"You can alter an object’s size for 1 minute per level. When using alter you can cause any object you can affect to increase or decrease by 1 size category. This doubles or halves the object’s height and width and multiplies or divides its weight by 8\\. Effects which depend upon a target object’s size which would not function due to size alterations are automatically suppressed, continuing to count down their duration as normal, when the object no longer meets the size requirements.\n\nWorn items that are enlarged hinder their wearer’s movements, reducing their movement speeds by 10 feet, to a minimum of 5 feet. This effect fails if used to shrink worn items below a size that their wearer can wear.\n\nIf this effect is augmented by Potent Alteration to target a creature per that talent, the target creature gains the same adjustments as if the Size Change Alteration talent had been used on them to adjust them to their size.\n\n**Augment 1 sp:** You can increase the number of steps you can enlarge or shrink an object by one size category, increasing by one at 5th level (2 steps), 11th level (3 steps), and 17th level (4 steps) (to a maximum of Gargantuan and a minimum of Tiny)."},"OBJECT_OF_FORCE":{"id":"OBJECT_OF_FORCE","name":"object of force","text":"**Augment 1 sp:** You can create objects made of solid force. Force objects have no weight and remain rigid and unmoving in the location they are created, though a creature two sizes larger than the object can move it. Force objects are resilient and have resistance to all non-magical damage, and prevent incorporeal creatures from passing through them. Objects of force are translucent but easily noticeable and require no Perception check to see while imparting disadvantage to Wisdom (Perception) checks to see through them. If you possess Transparency you can make the object invisible (as Illusion sphere’s Invisibility) or entirely opaque without spending an additional spell point, chosen at the time of its creation."},"POTENT_ALTERATION":{"id":"POTENT_ALTERATION","name":"potent alteration","text":"**Augment 1 sp:** When altering an object, you can affect magical objects, worn or held objects, or creatures of the construct type. While this means you can repair broken magical items with your repair ability, you cannot restore the magic to such an object. If used against a creature or an attended object, the target creature or the creature wearing or holding the object is allowed a Constitution saving throw to negate the effect."},"PRECISE_DESTRUCTION":{"id":"PRECISE_DESTRUCTION","name":"precise destruction","text":"You can destroy moving components and locks in lieu of disabling them more conventionally. When attempting to disable a complex device (such as a trap or lock) you can instead simply target the offending part of the object with destroy. You are treated as possessing thieves tools at all times and being proficient with those thieves tools and may make ability checks to open locks or disable complex devices using your casting ability modifier in place of the usual attribute modifier, but only when the desired action can be achieved by carefully destroying components (thus a door unlocked with this ability would be impossible to lock again without first repairing the lock)."},"RESTRICTIVE_CREATION":{"id":"RESTRICTIVE_CREATION","name":"restrictive creation","text":"**Augment 1 sp:** You can create non-harmful objects directly on a creature. An unwilling target is entitled a Dexterity saving throw to avoid having an object created directly on it, causing the object to fall harmlessly to the ground. This means you can create bindings, manacles, or some other close-fitting prison directly onto the target, making them Restrained on a failed saving throw. Targets can still attack their own bindings (as outlined under Notes on Casings listed above).\n\nIf you cover the target completely with a close-fitting prison they can only deal half damage to their bindings, but also have complete cover while inside their casing."}}