{"CLINGING_DARKNESS":{"id":"CLINGING_DARKNESS","name":"clinging darkness","text":"**Augment 0 sp:** You can center an area of darkness on a creature or object rather than an area. If targeting a creature or its worn or held object, that creature may attempt a Wisdom saving throw to negate the effect. Augmented darkness effects are anchored to, and move with the target. Affected creatures receive a new saving throw to end the effect each round at the end of their turn."},"DIRECTIONAL_DARKNESS":{"id":"DIRECTIONAL_DARKNESS","name":"directional darkness","text":"**Augment 1 sp:** Your area of darkness only blocks the light from one vantage point. If your darkness is in the form of a wall, it hampers vision from one side and appears clear from the other. If it is spherical, the caster may choose either for those within the area of darkness to see outside of it clearly or for those outside to see within clearly. The boundaries of the area of darkness remain obvious to those who can see through it unhindered."},"EXTINGUISH":{"id":"EXTINGUISH","name":"extinguish","text":"**Augment 0 sp:** You can opt to instantly extinguish all non-magical light sources within your areas of darkness, not merely suppress them. This includes fire, incandescence, and alchemical sources. Coals turn cold, glowing-hot metal is made cool, and luminous chemicals are rendered inert. Additionally, your darkness can be used to counter or dispel sources of magical flame (such as an conjured wall consisting of fire) with a spellcasting ability check against the spell or sphere DC of the magical flame. This is an instantaneous counter effect that occurs when the area of darkness is created. Creatures made of flame or other luminous materials or energies are not harmed by this talent."},"GREATER_DARKNESS":{"id":"GREATER_DARKNESS","name":"greater darkness","text":"**Augment 1 sp:** When creating an area of darkness, its radius increases to 30 feet. If combined with the Wall of Darkness talent, this allows you to double the number of 10-foot cubes created."},"OBFUSCATION":{"id":"OBFUSCATION","name":"obfuscation","text":"**Augment 1 sp:** Creatures and items within your area of darkness or subject to one of your (meld) talents are treated as if shielded by a veneer of lead, and any attempt to locate them via scrying fails. Divination talents benefiting from a single instance of Penetrating Divination may bypass obfuscation with a successful spellcasting ability check against your sphere DC. Those benefiting from a second instance of Penetrating Divination bypass Obfuscation automatically. Obfuscation does not affect the caster’s own divinations."},"OBSCURE_PASSAGE":{"id":"OBSCURE_PASSAGE","name":"obscure passage","text":"**Casting Time:** 1 action  \n**Target:** see text  \n**Range:** 30 feet  \n**Cost:** 1 sp  \n**Duration:** Concentration, up to 1 minute\n\nYou place a black circle on a surface, creating a temporary hole with a diameter in feet equal to your proficiency bonus and a depth of 5 feet, increasing by 5 feet at 5th (10 feet), 11th (15 feet), and 17th level (20 feet). Obscure Passage can not penetrate a surface with exceptional hardness, such as adamantine.\n\nAttempting to create an obscure passage through a target that is too thick or too hard causes the effect to fail and all spell points spent to be lost. An Obscure Passage leaves the surface whole and unmarred when it expires. Light does not pass through an obscure passage, nor does low-light vision or darkvision allow a creature to peer through it, though Clearsight and any effect that allows a creature to see in magical darkness do. A creature standing above an obscure passage as it opens may attempt a Dexterity saving throw to avoid falling in, moving to the nearest safe space if successful."},"ROLLING_BLACKOUT":{"id":"ROLLING_BLACKOUT","name":"rolling blackout","text":"**Augment 0 sp:** You gain the ability to move your areas of darkness. You can move one instance of darkness up to 30 feet as an action or bonus action, within the maximum range of the effect. If moving an area of darkness causes a creature to leave its area of effect, any ongoing effects the creature is under due to being inside that area of darkness end immediately."},"SHADOW_STASH":{"id":"SHADOW_STASH","name":"shadow stash","text":"**Casting Time:** 1 bonus action  \n**Target:** 1 object  \n**Range:** self  \n**Cost:** 0 sp  \n**Duration:** instantaneous\n\nYou can stash items in your shadow, storing each as a bonus action. The items appear on your shadow as if you were wearing or using them. A small item (a ring or a key) might be unnoticeable, while a larger item (a greatsword, a shield) would be quite obvious. You can store up to 5 pounds of non-living material per level. Items have no weight while stashed and can not be used, activated, or provide passive bonuses.\n\nYou can retrieve an item as a bonus action. Items stored in your shadow stash cannot be stolen or otherwise targeted unless the creature attempting to do so also has the Shadow Stash talent. If your shadow is removed or animated, you cannot access your shadow stash until your shadow returns. If you die, the contents of your shadow stash immediately appear in the nearest unoccupied space.\n\n**Augment 1 sp:** You can retrieve items from your shadow stash with no action, if done during your turn, or as a reaction."},"WALL_OF_DARKNESS":{"id":"WALL_OF_DARKNESS","name":"wall of darkness","text":"**Augment 0 sp:** Rather than create a sphere of darkness, you can arrange your darkness as a number of 10-foot Cubes equal to twice your proficiency bonus. These cubes must be arranged contiguously, but otherwise may assume any shape. You must be able to perceive all areas your darkness will inhabit."}}