{"BLASTER_ADEPT":{"id":"BLASTER_ADEPT","name":"blaster adept","text":"Choose one damage type. When you roll damage for a destructive blast dealing the chosen damage type, you can add your key ability modifier to the damage dealt.\n\n**Augment 1 sp:** As a reaction, when you roll damage for a destructive blast that deals damage of the chosen type, you can treat any 1 or 2 on a damage die as a 3 for that round.\n\nYou may take this talent multiple times, each time choosing a different damage type."},"ENERGY_WEAPON":{"id":"ENERGY_WEAPON","name":"energy weapon","text":"**Casting Time:** 1 bonus action  \n**Range:** Self  \n**Duration:** Concentration, up to 1 minute  \n**Cost:** 0 sp\n\nYou conjure a weapon that you are proficient with, which appears to be made out of solidified energy. If you conjure a ranged weapon, it also produces an amount of ammunition each round equal to your proficiency bonus. Instead of dealing bludgeoning, piercing, or slashing damage, the weapon deals a type of damage that matches a (blast type) talent you possess. Regardless of what type of damage the weapon deals, it counts as magical for the purpose of damage immunity or resistance.\n\nIf you drop the weapon or throw it, it dissipates at the end of the turn. Any ammunition conjured by this effect also dissipates at the end of the turn. Thereafter, while the effect persists, you can use a bonus action to cause the weapon to reappear in your hand.\n\n**Augment 1 sp:** For the duration, when making attacks with the weapon, you can choose to make a spell attack roll instead of a weapon attack roll.\n\n**Augment 2 sp:** The effect persists for the remaining duration without concentration. This augment can be applied after the effect is cast on your turn without an action."},"EPICENTER":{"id":"EPICENTER","name":"epicenter","text":"You are immune to any damage and other effects of your own destructive blasts. This includes ignoring difficult terrain created by a blast type and immunity to your own (blast shape) talents with a non-instantaneous duration."},"EXTRA_BLAST_TYPE":{"id":"EXTRA_BLAST_TYPE","name":"extra blast type","text":"Choose three (blast type) talents that you don’t possess; you gain those blast types. You do not need to possess the base sphere (or sphere packages) associated with those blast types. This talent may not be used to select advanced talents. You can select this talent more than once; each time you gain three additional (blast type) talents."},"GUIDED_STRIKE":{"id":"GUIDED_STRIKE","name":"guided strike","text":"**Augment 1 sp:** You have advantage on spell attack rolls made as part of your destructive blast. Augments that grant additional attack rolls as part of the destructive blast (such as with the Ray (blast shape) talent), grant advantage to all spell attack rolls made for the casting. If you would already have advantage on your spell attack roll, you can reroll one of the dice once."},"SELECTIVE_BLAST":{"id":"SELECTIVE_BLAST","name":"selective blast","text":"**Augment 0 sp:** When using a destructive blast with an instantaneous duration, you can exclude one creature; it suffers no damage or effects.\n\n**Augment 1 sp:** You can exclude a number of creatures equal to your proficiency bonus."},"CALAMITY_BLAST_SHAPE":{"id":"CALAMITY_BLAST_SHAPE","name":"calamity (blast shape)","text":"**Prerequisites:** Destruction sphere (Sculpt (blast shape)), 11th level or higher.\n\n**Augment 1 sp:** When using the Sculpt blast shape, the line becomes 500 feet long, the cone becomes 90 feet long, or you affect everything within 30 feet of you."},"CLOUD_BLAST_SHAPE":{"id":"CLOUD_BLAST_SHAPE","name":"cloud (blast shape)","text":"**Prerequisites:** Destruction sphere (Sphere (blast shape)), 5th level or higher.  \n**Duration:** Concentration, up to 10 minutes\n\n**Augment 3 sp:** You can make your destructive blast into a roiling cloud of destruction. The cloud covers a 15-foot radius, 15-foot tall cylinder and is stationary unless you direct it to move as a bonus action, which it does at a rate of 40 feet. The area within the cloud is heavily obscured. Any creatures who enter or begin their turn inside the cloud suffer the effects of your destructive blast. Affected targets must make a Dexterity saving throw. On a successful save, they take half damage and negate any rider effects the (blast type) would otherwise inflict upon its target.The radius and height of the cylinder increases by 5 feet at 11th level (20-foot radius, 20-foot tall), and 17th level (25-foot radius, 25-foot tall).\n\n**Augment 2 sp:** The effect persists for the remaining duration without concentration. This augment may be applied after the effect is cast on your turn without an action."},"DISINTEGRATE_BLAST_TYPE":{"id":"DISINTEGRATE_BLAST_TYPE","name":"disintegrate (blast type)","text":"**Prerequisites:** Destruction sphere, 5th level or higher.  \n**Augment 1 sp:** Your destructive blast deals force damage and deals additional damage equal to your level. Any creature reduced to 0 hit points by your destructive blast is entirely disintegrated, leaving behind only a trace of fine dust, although their magic items are unaffected. The creature can be restored to life only by means of the Greater Resurrection talent, or the true resurrection or wish spells. This blast type does double damage to objects.\n\nWhen targeting a non-magical object that is not worn or held, the destructive blast simply disintegrates as much as a 10-foot cube of matter. Thus, it disintegrates only part of any very large object or structure targeted. The blast affects even objects constructed entirely of force, but not magical effects such as a globe of invulnerability, an antimagic field, or the Barrier ward of the Protection sphere."},"PENETRATING_BLAST":{"id":"PENETRATING_BLAST","name":"penetrating blast","text":"**Prerequisites:** Destruction sphere, 5th level or higher.\n\n**Augment 1 sp:** Your destructive blast ignores any resistance to its damage type that affected creatures and objects possess. Creatures and objects with immunity to the damage type are instead treated as having resistance."}}