{"ADDICTIVE_CASTING":{"id":"ADDICTIVE_CASTING","name":"addictive casting","text":"Your magic is addictive. Whenever you spend one or more spell points, you must pass a Constitution saving throw against your addiction DC (Your addiction DC is 8, + 1 for each roll you have previously made. Thus, your first roll would be a DC 8, the second a DC 9, the third a DC 10, etc.).\n\nIf you fail this save, you become Mana Addicted. While Mana Addicted, any time you have not spent a spell point within the last minute, you suffer a -1 penalty to your proficiency bonus until you spend a spell point. If you are already Mana Addicted and fail your saving throw from using spell points, the Mana Addicted penalty to proficiency increases by 1 (minimum proficiency bonus 0).\n\nIf you complete a long rest after having gone a full day without spending any spell points, you can make a Constitution saving throw against your addiction DC. If successful, your addiction DC is reduced by 2\\. If you succeed on 2 consecutive saves in this way, you are also no longer Mana Addicted. Addiction to magic cannot be cured through magic, but a DC 15 Wisdom (Medicine) can be used to give you advantage on these saving throws.\n\nThis counts as 2 drawbacks when determining the number of spell points or boons gained."},"CENTER_OF_POWER":{"id":"CENTER_OF_POWER","name":"center of power","text":"You have an obvious physical feature which is the source of your magical power.\n\nWhenever you cast, any creature that is observing you can clearly tell that your magic originates from your center of power. If a critical hit is made on you, your center is disrupted, and you lose 1d4 spell points (if you have them), are unable to cast spells or use any magical sphere effects for 1 round, and automatically lose concentration. A creature can target the center of power by choosing to take disadvantage on their attack roll; if successful, you are affected as if they had made a critical hit (though no additional damage is dealt).\n\nYou cannot have both this and the Focus Casting drawback."},"CHARGE_MAGIC":{"id":"CHARGE_MAGIC","name":"charge magic","text":"Your magic often requires time to recharge between castings (Recharge 6). When you spend 1 or more spell points on an ability, you cannot spend any additional spell points until your magic recharges. At the start of each of your turns, roll a d6\\. If the roll is one of the numbers in the recharge notation, you regain the use of spell points. You also recharge when you finish a short or long rest. Your recharge value improves at 5th level (Recharge 5-6), 11th level (Recharge 4-6), and 17th level (Recharge 3-6). This counts as 2 drawbacks when determining the number of spell points gained."},"COY_CASTER":{"id":"COY_CASTER","name":"coy caster","text":"Your magic is a fickle thing, or perhaps you’re simply possessed of performance anxiety. Whenever you attempt to use magic while you know you’re being observed, you must make a key ability check (DC 10 + twice the number of spell points used) to produce the desired effect. Failure means time (and any spell points) are spent, but no effect happens."},"DIAGRAM_MAGIC":{"id":"DIAGRAM_MAGIC","name":"diagram magic","text":"In order to perform any magical effect, either you or your target must be entirely contained within the boundaries of a special diagram. Creating this diagram requires an action for every 5-foot square contained within the diagram. If either you or your target are within a functional circle, you can cast normally.\n\nEffects that target an area may be centered within a circle even if the spherecaster is not within the circle. Otherwise, using magic without a diagram requires you to make a key ability check with a DC of 10 + twice the number of spell points used or lose the action and any spell points spent. If you are not in a functional circle and casting an effect that targets an area or multiple creatures, you must still make the casting ability check; if you fail, any spaces or creatures outside the circle are unaffected. If maintaining an effect through concentration and you begin your turn with neither you nor your target within the diagram, you must pass the key ability check or your concentration breaks.\n\nThe diagram need not be drawn with any special materials, and can be done with sprinkled salt, paint, blood, or anything else that may be on hand so long as it is clearly visible. If the diagram is disrupted (such as someone spending an action to disrupt the diagram, or through sufficient force from water, wind, etc.) then the diagram is destroyed.\n\nThis counts as 2 drawbacks when determining the number of spell points gained."},"DRAINING_CASTING":{"id":"DRAINING_CASTING","name":"draining casting","text":"Using magic saps your lifeforce. You suffer one damage and your maximum hit points are reduced by 1 for every spell point you spend in any fashion. This reduction lasts until you complete a long rest. At 11th level, the damage and hp reduction increases to 2.\n\n_Author's Note:_ Damage from the Draining Casting drawback does not trigger concentration checks."},"EMOTIONAL_CASTING":{"id":"EMOTIONAL_CASTING","name":"emotional casting","text":"Your magic requires heightened emotional states of mind to use. When subject to the charmed or frightened conditions, or other effects that result in a heightened emotional state (such as the hostility (charm) of the Mind sphere or the rage spell), you are unable to cast or concentrate on any magic sphere effect."},"EXTENDED_CASTING":{"id":"EXTENDED_CASTING","name":"extended casting","text":"Your magic takes longer to use than normal. When using a magic sphere ability that takes an action to use, you cannot move before or after casting it and cannot use a bonus action that round. Sphere effects that require a bonus action instead cost an action, and effects that require a reaction consume your bonus action for next turn. Effects with longer casting times are increased by one step (1 minute becomes 10 minutes, 10 minutes becomes 1 hour, 1 hour becomes 1 day, and times greater than 1 day are doubled). This counts as two drawbacks when determining the number of spell points gained.\n\nYou cannot have both this and the Terrain Casting drawback."},"FOCUS_CASTING":{"id":"FOCUS_CASTING","name":"focus casting","text":"Your magic requires you to use an item such as a wand, holy symbol, ring, or staff to create magic. Using sphere talents or abilities without your focus requires you to make a key ability check with a DC of 10 + twice the number of spell points used to produce the desired effect. Failure means time (and any spell points) are spent, but no effect happens. If a focus is lost, stolen, or broken, you must create a new focus by securing the necessary item. If you are polymorphed and your focus is absorbed into your body, you instead function as having the Center of Power drawback.\n\nYou cannot have both this and the Center of Power drawback."},"MAGICAL_SIGNS":{"id":"MAGICAL_SIGNS","name":"magical signs","text":"Your magic is accompanied by a tell-tale sign; for example, your body glows brightly, the sound of tortured souls shriek as you cast, or some other manifestation affects all creatures within 30 feet. Nearby creatures know when you are using magic, as well as the nature of the magic used (the sphere and any talents applied).\n\nYou cannot have both this and the Witch-Marked drawback."},"MATERIAL_CASTING":{"id":"MATERIAL_CASTING","name":"material casting","text":"Your magic requires the expenditure of specific materials: precious metals, rare components, etc. The exact nature of this material should be worked out with the GM. Using a sphere ability that costs 0 spell points requires having a component pouch readily available. Sphere abilities costing 1 or more spell points require expending materials worth 1 gold piece per spell point."},"MARKING_MAGIC":{"id":"MARKING_MAGIC","name":"marking magic","text":"A mark appears on any creature or object that you target with a sphere effect. This mark may appear as a painted glyph, a strip of rune-inscribed paper, or almost any similar manifestation, and always appears on a body part or portion of the object where it is easily visible. The mark can be easily removed; it can be rubbed away as an action (which requires an attack roll made with advantage if the creature is not willing), or fades away after being exposed to water or another solvent for one minute. Once the mark has been removed, the effect ends immediately."},"MENTAL_FOCUS":{"id":"MENTAL_FOCUS","name":"mental focus","text":"Your magic requires you to have a focus that is not always possible to achieve. You normally have focus, but lose it whenever you gain the charmed, frightened, incapacitated, or stunned conditions, have a critical hit made against you, or you fail a saving throw to maintain concentration. Using magic without your mental focus requires you to make a key ability saving throw with a DC of 10 + twice the number of spell points used to produce the desired effect. Failure means time (and any spell points) are spent, but no effect happens. If focus is lost, the spherecaster can refocus by meditating as an action. Doing so provokes opportunity attacks from hostile creatures.\n\nYou cannot have both this and the Emotional Casting drawback."},"NATURE_WARDEN":{"id":"NATURE_WARDEN","name":"nature warden","text":"You are mystically bonded to a single notable location such as a cave, large tree, spring, or prominent stone and draw your magic from it. You must remain within a number of miles equal to your level to use your magic normally. Using magic outside this area requires you to make a saving throw with your key ability with a DC of 10 + twice the number of spell points used to produce the desired effect. Failure means time (and any spell points) are spent, but no effect happens. You can bond to a new site of the same general type with an 8 hour ritual."},"PAINFUL_MAGIC":{"id":"PAINFUL_MAGIC","name":"painful magic","text":"Your magic consumes you the more you rely on it. You must pass a Constitution saving throw with a DC of 10 + twice the number of spell points used whenever you use magic, or be poisoned for 1 round. If you use magic while poisoned, you must pass the saving throw or be incapacitated for 1 round. The poisoned condition imposed by this drawback bypasses any immunity to the poisoned condition you possess."},"POINT_BLANK_EFFECTS":{"id":"POINT_BLANK_EFFECTS","name":"point-blank effects","text":"Magic sphere effects you cast cannot be cast at a range greater than touch, even if you possess the Reaching (metasphere) talent. If the magic sphere effect would have you make a ranged spell attack roll, you can make a melee spell attack roll instead."},"PREPARED_CASTER":{"id":"PREPARED_CASTER","name":"prepared caster","text":"You must prepare your magic beforehand in order to use it. After completing a long rest and regaining spell points, you must assign each of your spell points to a sphere you possess.\n\nYou cannot spend more spell points in a given sphere in a day than you have assigned to that sphere. You can assign spell points to the Universal sphere even if you do not possess this sphere, and draw from that sphere to power class features and feats that require spell points. If your spell points are drained or otherwise lost other than by casting, you can choose which sphere to draw the spell points from."},"RIGOROUS_CONCENTRATION":{"id":"RIGOROUS_CONCENTRATION","name":"rigorous concentration","text":"Your magic requires intense amounts of concentration to use. Concentrating on a sphere effect requires you to spend a bonus action each round. This drawback may be applied a second time; doing so requires you to spend an action each round to concentrate."},"SKILLED_CASTING":{"id":"SKILLED_CASTING","name":"skilled casting","text":"You must create your magic through singing, drawing, or some other activity. Choose a skill or tool proficiency. You must succeed at a check using that skill or tool to use any sphere ability. The DC of this check is 10 + twice the number of spell points used. If you fail this check, the casting is treated as if your proficiency bonus was 1 lower, or 2 lower if you fail your check by 4 or more. If this would drop your effective proficiency bonus below the number of spell points spent on the sphere ability, the casting fails completely, wasting any actions and spell points used.\n\nA spherecaster with Skilled Casting needn’t ‘perform’ their skill in order to use magic, unless they possess other drawbacks that would mimic it. For example, a spherecaster with Skilled Casting (medicine), Somatic Casting, and Focus Casting might need to be holding a healer’s kit and have their hands free to actually practice medicine to enact their magic. A caster with just Skilled Casting (medicine), however, wouldn’t require a healer’s kit or their hands free, but their magic would still require an expert knowledge of medicine to use and apply."},"SOMATIC_CASTING":{"id":"SOMATIC_CASTING","name":"somatic casting","text":"You must gesture to cast spells—a process that requires you to have at least 1 hand unoccupied. If you possess Focus Casting, holding a focus in your hand does not count as that hand being ‘unoccupied’.\n\nYou may select this drawback twice. If taken a second time, you use your entire body to cast your magic. You cannot cast while wearing any armor, using any shield, or while grappled or restrained."},"TERRAIN_CASTING":{"id":"TERRAIN_CASTING","name":"terrain casting","text":"Your magic draws upon the primal energy and nutrients of the terrain. Whenever you use a sphere ability, you must either spend an additional spell point or increase your casting time by one step (see the Extended Casting drawback), else your magic drains and corrupts the terrain around you, creating blighted terrain; additional castings increase the severity of already existing blighted terrain by 1\\. Casters inside blighted terrain who possess the Terrain Casting drawback are treated as having a penalty to their proficiency bonus equal to twice the blighted terrain severity; If the penalty would reduce their effective proficiency bonus below 0, they cannot use any magical sphere talents or abilities (regardless of spell point cost).\n\nBlighted terrain is affected in different ways depending upon location (water may turn brackish or stagnant, while soil may become barren or salted, air may become putrid); regardless of location, blighted areas will generally heal naturally over time, based upon the severity of the blight.\n\n| Blighted Terrain Severity | Blighted Terrain Area | Blighted Terrain Duration |\n| ------------------------- | --------------------- | ------------------------- |\n| 1                         | 30 ft. radius         | 1 year                    |\n| 2                         | 120 ft. radius        | 10 years                  |\n| 3                         | 500 ft. radius        | 100 years                 |\n| 4                         | 1 mile radius         | 1000 years                |\n\nYou cannot have both this and the Extended Casting drawback.\n\n_Author's Note:_ Blighted zones that overlap, but are not created while inside another zone do not increase the size of the zone; However, the blight zone severity increases where the zones overlap."},"VERBAL_CASTING":{"id":"VERBAL_CASTING","name":"verbal casting","text":"You must speak in a loud, clear voice to cast spells. Using magic alerts all hearing creatures within 60 feet to your presence and location, effectively breaking stealth. You cannot cast in an area of magical silence, or in any other situation where you are unable to speak clearly, and if you are deafened you have disadvantage on spell attack rolls and other targets have advantage on saving throws against your magic."},"WILD_MAGIC":{"id":"WILD_MAGIC","name":"wild magic","text":"You have a base wild magic chance of 10%. This wild magic chance does not stack with wild magic chance from other sources. See the [Wild Magic](/wild-magic) section for the use of wild magic chance."},"WITCH_MARKED":{"id":"WITCH_MARKED","name":"witch-marked","text":"Some aspect of your characteristics is a dead giveaway about your magical nature. This could be any purely cosmetic feature that is hard to hide such as a vestigial tail (or tails), glowing eyes, an aura visible to the naked eye, or the stench of death always clinging to you. The intensity of this trait grows proportional to your power. Anyone who sees you can make an Intelligence (Arcana) check against a DC of 20 - 2x your proficiency bonus to learn your casting tradition and what spheres you possess. You also take your proficiency bonus as a penalty to any checks made to disguise your witch-mark, and using magic clearly reveals your witch-mark, breaking the disguise.\n\nYou cannot have both this and the Magical Signs drawback."},"APTITUDE":{"id":"APTITUDE","name":"aptitude","text":"You have a virtuosity in the trade associated with your magic.\n\nYou gain proficiency in the skill or tool tied to your Skilled Casting drawback. If you already are proficient with the skill, your proficiency bonus is doubled for any check you make that uses the chosen proficiency. This does not stack with expertise (or other similar features).\n\nA spherecaster must possess the skilled casting drawback to gain this boon."},"BOUND_CREATURE":{"id":"BOUND_CREATURE","name":"bound creature","text":"Your magic is tied to a magical creature, who shares essence and power with you.\n\nYou gain the ability to cast find familiar as a ritual, if you aren’t able to do so already. You do not require a ritual book to cast this spell as a ritual. When you cast find familiar as a ritual, you can choose one of the normal forms for your familiar or one of the following special forms: crawling claw, imp, pseudodragon, quasit, or sprite (additional special forms may be chosen with express GM permission). You do not suffer a chance of failure from the Focus Casting drawback so long as you are on the same plane and within 300 feet of your familiar, and your familiar is conscious.\n\nA spherecaster must possess the focus casting drawback to gain this boon."},"DEATHFUL_MAGIC":{"id":"DEATHFUL_MAGIC","name":"deathful magic","text":"The closer you are to death, the more powerful your magic. When you are at half hit points or less, you treat your proficiency bonus as 1 higher for the purpose of casting your sphere effects."},"EASY_FOCUS":{"id":"EASY_FOCUS","name":"easy focus","text":"You have advantage on saving throws made to maintain concentration."},"EMPOWERED_ABILITIES":{"id":"EMPOWERED_ABILITIES","name":"empowered abilities","text":"Your magic grows in strength the more you use it. If your current number of spell points is 0, you treat your proficiency bonus as 1 higher for the purpose of casting your sphere effects."},"FORTIFIED_CASTING":{"id":"FORTIFIED_CASTING","name":"fortified casting","text":"You can use your Constitution as your key ability if it is higher than your usual key ability.\n\nA spherecaster must possess the Draining Casting drawback to gain this boon."},"METASPHERE_SPECIALIST":{"id":"METASPHERE_SPECIALIST","name":"metasphere specialist","text":"In addition to the bonus talents granted by your casting tradition, you also gain the Metasphere package from the Universal sphere, and one additional (metasphere) talent of your choice."},"OVERCHARGE":{"id":"OVERCHARGE","name":"overcharge","text":"You can overcharge your magic, giving yourself great power at the cost of your own strength. As part of casting, you treat your proficiency bonus as 1 higher for the next sphere effect you cast before the start of your next turn. Doing so increases your exhaustion level by 1\\. Creatures immune to exhaustion cannot benefit from this boon."},"OVERWHELMING_POWER":{"id":"OVERWHELMING_POWER","name":"overwhelming power","text":"Creatures under the effects of at least 1 of your magical sphere abilities suffer a -1 penalty to their saves against your other magical sphere abilities. This penalty increases to -2 if they are under the effects of at least 3 of your magical sphere abilities."},"PHYSICAL_MAGIC":{"id":"PHYSICAL_MAGIC","name":"physical magic","text":"Once your magical materials are prepared, you can give them out to others.\n\nWhen you create a sphere effect that costs at least 1 spell point (but not more spell points than 1/2 your proficiency bonus) and a duration other than concentration, you can delay its effects. The sphere effect is placed into an object of your creation (a vial of liquid, a crystal, a dust, etc.), referred to hereafter as an ‘instilled object’. Creating an instilled object takes the same amount of time as it would to cast the sphere effect. The cost of the object this is instilled is considered negligible, being paid for through your Material Casting drawback.\n\nYou can target food but not an already-magical item, such as a potion.\n\nA creature can activate the instilled object as an action, activating its power and choosing its targets if it is a ranged effect. If unused, instilled objects lose their magic and become inert after you take a long rest. You cannot place multiple effects in a single object, nor create multiple instilled objects with a single casting, even if augmented with the Mass (metasphere) talent from the Universal sphere.\n\nA spherecaster must possess the Material Casting drawback to gain this boon."},"RITUALIST":{"id":"RITUALIST","name":"ritualist","text":"You have learned a number of spells that you can cast as rituals. These spells are written in a ritual book, which you must have in hand while casting one of them. You acquire a ritual book holding two 1st-level spells of your choice. Choose a spellcasting class that has access to 9th level spells. You must choose your spells from that class’s spell list, and the spells you choose must have the ritual tag. You use your key ability modifier as your spellcasting ability for these spells. If you come across a spell in written form, such as a magical spell scroll or a wizard’s spellbook, you might be able to add it to your ritual book. The spell must be on the chosen class’s spell list, the spell’s level can be no higher than half your level (rounded up), and it must have the ritual tag. The process of copying the spell into your ritual book takes 2 hours per level of the spell, and costs 50 gp per level. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it.\n\nA spherecaster must possess the Prepared Caster drawback to gain this boon."},"SPELLBOOK":{"id":"SPELLBOOK","name":"spellbook","text":"You can attune to a ritual book or spellbook as if it were a magic item. Once per long rest you can cast a spell or ritual from the attuned item by expending a number of spell points equal to half the spell’s level, rounded up. You cannot cast a spell or a ritual in this fashion with a spell level greater than your proficiency bonus. Rituals that you cast using this boon are done so as spells, and do not take 10 minutes longer to cast than normal. You can cast from an attuned ritual book or spellbook an additional time per long rest at 5th level (twice), 11th level (thrice), and 17th level (four times).\n\nA spherecaster must possess the Prepared Caster drawback to gain this boon."},"TERRAIN_DEFILER":{"id":"TERRAIN_DEFILER","name":"terrain defiler","text":"Whenever you increase the terrain blighted severity, you treat your proficiency bonus as 1 higher for that sphere effect. A spherecaster must possess the Terrain Casting drawback to gain this boon."},"WILD_SURGE":{"id":"WILD_SURGE","name":"wild surge","text":"As part of casting, you treat your proficiency bonus as 1 higher for the next sphere effect you cast before the start of your next turn by increasing your wild magic chance by 100% for the same period.\n\nA spherecaster must possess the Wild Magic drawback to gain this boon."}}