{"DUAL_ENHANCEMENT":{"id":"DUAL_ENHANCEMENT","name":"dual enhancement","text":"**Augment 1 sp:** Whenever you degrade or enhance with a (degrade) or (enhance) talent that gives you multiple options, you can select two options from that individual talent. For example, you could use Enhance Equipment to have a shield give a bonus to attack and damage (if used to make attacks) as well as AC.\n\n**Augment 2 sp:** Whenever you use a degrade or enhance ability, you can choose to bestow two different options that you possess with a single casting. For example if you have the Energy Weapon (enhance) talent and the Enhance Equipment (enhance) talent, you can choose to bestow both enhance options when using the enhance ability. The spell point costs of each of the two (enhance) talents are combined, and it is treated as a single sphere effect for the purpose of countering and dispelling."},"BESTOW_SENTIENCE":{"id":"BESTOW_SENTIENCE","name":"bestow sentience","text":"**Prerequisites:** Enhancement sphere (Animate Object, Bestow Intelligence), 11th level or higher.  \n**Augment 3 sp:** You can increase the casting time of your Bestow Intelligence enhance to 24 hours to bring a beast, body, tree, or magic object to full sentience. This is an instantaneous effect, and as such is a permanent change and cannot be dispelled. This has no effect on a creature with an Intelligence of 3 or higher.\n\nThis ability may manifest in one of the following ways:\n\n* You transform a tree into an intelligent animated object, granting it the benefits of your Animate Object and Bestow Intelligence enhancements.\n* You transform a beast into an awakened beast, giving it the benefits of Bestow Intelligence permanently.\n* You grant life to an empty body. This could be a body created through the Fleshcraft and Create Raw Materials Creation advanced talents, or a body crafted from parts of other recently slain bodies sewed together. The created creature is a simple being (no background, no class, 10 in all ability scores and 4 hp, race determined by the body’s composition), but with GM permission may roll ability scores normally and be trained to gain its own class and background.\n* You transform a magical object into an intelligent item with a 10 Intelligence, Wisdom, and Charisma. The item must be a permanent magical item (thus scrolls, wands, potions, etc. cannot be enhanced in this way), and the item does not gain any powers.\n\nThe target creature usually shares your alignment and is charmed by you for 30 days or until you or your companions do anything harmful to it. When the charmed condition ends, the creature chooses whether to remain friendly to you, based on how you treated it while it was charmed."},"REFERENTIAL_ENHANCEMENTS":{"id":"REFERENTIAL_ENHANCEMENTS","name":"referential enhancements","text":"**Prerequisites:** Enhancement sphere, Universal sphere (Extended (metasphere), Mass (metasphere)), 15th level or higher.\n\n**Augment 2 sp:** Whenever you augment a degrade or enhance ability with the Mass (metasphere) talent, you can have the degrade or enhance ability affect a 30 foot sphere instead. If you do so, the effect’s duration changes to 1 week, no concentration is required, and it affects all valid targets that are within the area; the benefits and penalties fade immediately if the target leaves the area.\n\nUpon using this talent, you can exclude targets from the effect based on some visible or audible criterion. This would allow you to, say, have Enhance Equipment affect any swords within the area, or have Steal Ability apply only to creatures who are not prominently showing a particular badge."},"REVERSE_GRAVITY_ENHANCE":{"id":"REVERSE_GRAVITY_ENHANCE","name":"reverse gravity (enhance)","text":"**Prerequisites:** Enhancement sphere (Weight Control), 15th level or higher.\n\n**Augment 2 sp:** You can enhance an area of up to 10 10-foot cubes, arranged contiguously. Within this area, gravity reverses. Unattached objects and creatures in the area fall upward and reach the top of the area in 1 round. If a solid object (such as a ceiling) is encountered in this fall, falling objects and creatures strike it in the same manner as they would during a normal downward fall. If an object or creature reaches the top of the area without striking anything, it remains there, oscillating slightly, until the effect ends. At the end of the duration, affected objects and creatures fall downward.\n\nProvided it has something to hold onto, a creature caught in the area can attempt a Dexterity saving throw to secure itself and not fall upward. Creatures who can fly or levitate can keep themselves from falling."}}