{"BASIC_TRAINING_DISCIPLINE":{"id":"BASIC_TRAINING_DISCIPLINE","name":"basic training (discipline)","text":"You become proficient with all simple weapons."},"BOMBARDIER_TRAINING_DISCIPLINE":{"id":"BOMBARDIER_TRAINING_DISCIPLINE","name":"bombardier training (discipline)","text":"You may treat alchemical items or similar items (such as an acid flask, alchemist fire, holy water, bombs, etc.) as a simple weapon with the light and thrown property (20/60), although they are still destroyed after use. If you throw such an object and you miss, you may redirect the attack against an adjacent creature, making a new attack against that creature instead. You may only do this once per throw."},"BOUNTY_HUNTERS_TOOLS_DISCIPLINE":{"id":"BOUNTY_HUNTERS_TOOLS_DISCIPLINE","name":"bounty hunters tools (discipline)","text":"You gain proficiency with the bola, garrote, lasso, net, net crossbow, and whip."},"BRUISER_TRAINING_DISCIPLINE":{"id":"BRUISER_TRAINING_DISCIPLINE","name":"bruiser training (discipline)","text":"You gain proficiency with the battle axe, flail, greataxe, maul, morningstar, war pick, and warhammer."},"BUSHIDO_TRAINING_DISCIPLINE":{"id":"BUSHIDO_TRAINING_DISCIPLINE","name":"bushido training (discipline)","text":"You gain proficiency with the katana (longsword), longbow, naginata (glaive), nodachi (greatsword), tetsubo (maul), and wakizashi (shortsword)."},"CROSSBOW_EXPERT_DISCIPLINE":{"id":"CROSSBOW_EXPERT_DISCIPLINE","name":"crossbow expert (discipline)","text":"You are proficient with all light crossbows, hand crossbows, heavy crossbows, and net crossbows. Ranged weapons you are proficient with ignore half cover and three-quarters cover."},"CUSTOM_TRAINING_DISCIPLINE":{"id":"CUSTOM_TRAINING_DISCIPLINE","name":"custom training (discipline)","text":"Select 3 weapons; you gain proficiency with the selected weapons. You may take this talent multiple times, selecting new weapons each time."},"DUELIST_TRAINING_DISCIPLINE":{"id":"DUELIST_TRAINING_DISCIPLINE","name":"duelist training (discipline)","text":"You gain proficiency with the greatsword, hand crossbow, longsword, rapier, and shortsword."},"GALLOWGLASS_TRAINING_DISCIPLINE":{"id":"GALLOWGLASS_TRAINING_DISCIPLINE","name":"gallowglass training (discipline)","text":"You gain proficiency with the broadsword (shortsword), claymore (greatsword), dirk (dagger), longbow, and longsword."},"GLADIATOR_TRAINING_DISCIPLINE":{"id":"GLADIATOR_TRAINING_DISCIPLINE","name":"gladiator training (discipline)","text":"You gain proficiency with the battle axe, gladius (shortsword), net, trident, and whip."},"HUNTSMAN_TRAINING_DISCIPLINE":{"id":"HUNTSMAN_TRAINING_DISCIPLINE","name":"huntsman training (discipline)","text":"You gain proficiency with the blowgun, bola, lasso, longbow, net, and pike."},"KNIGHTLY_TRAINING_DISCIPLINE":{"id":"KNIGHTLY_TRAINING_DISCIPLINE","name":"knightly training (discipline)","text":"You gain proficiency with the flail, greatsword, lance, longsword, rapier, morningstar, shortsword."},"OUTRIDER_TRAINING_DISCIPLINE":{"id":"OUTRIDER_TRAINING_DISCIPLINE","name":"outrider training (discipline)","text":"You gain proficiency with the bola, lance, lasso, longbow, scimitar, and whip."},"PIKEMAN_TRAINING_DISCIPLINE":{"id":"PIKEMAN_TRAINING_DISCIPLINE","name":"pikeman training (discipline)","text":"You gain proficiency with the heavy crossbow, trident, lance, glaive, halberd, and pike."},"PIRATE_TRAINING_DISCIPLINE":{"id":"PIRATE_TRAINING_DISCIPLINE","name":"pirate training (discipline)","text":"You gain proficiency with the rapier, shortsword, scimitar, trident, net, hand crossbow, and war pick."},"ROCK_TOSS_DISCIPLINE":{"id":"ROCK_TOSS_DISCIPLINE","name":"rock toss (discipline)","text":"You are proficient with throwing rocks, boulders, people, and other enormous objects that other beings might find difficult. When throwing a creature or object, you treat it as a weapon you are proficient in that deals bludgeoning damage and have the thrown (20/60) weapon property. Anything that increases your effective size for grappling or shoving (such as the Muscular Surge talent from the Brute sphere) increases your size for Rock Toss.\n\nCreatures and objects at least two sizes smaller than you are considered one-handed light weapons, while creatures and objects one size smaller than you are considered one-handed weapons. Creatures and objects your same size are two-handed weapons.\n\n##### Table: Rock Toss\n\n| Object Size | Damage Die |\n| ----------- | ---------- |\n| Tiny        | 1d4        |\n| Small       | 1d6        |\n| Medium      | 1d8        |\n| Large       | 1d10       |\n| Huge        | 2d6        |\n| Gargantuan  | 3d6        |\n\nIf you throw a creature at a wall or another creature, both the creature and the target suffer damage. You cannot throw an unwilling creature unless you have grappled that creature first."},"ROGUE_WEAPON_TRAINING_DISCIPLINE":{"id":"ROGUE_WEAPON_TRAINING_DISCIPLINE","name":"rogue weapon training (discipline)","text":"You gain proficiency with the blowguns, garrote, hand crossbow, rapier, scimitar, short sword, and whip."},"STAFF_MASTERY_DISCIPLINE":{"id":"STAFF_MASTERY_DISCIPLINE","name":"staff mastery (discipline)","text":"You may treat the quarterstaff as if it had the reach weapon quality. When you take the Attack action and attack with only a glaive, halberd, quarterstaff, or spear, you can use a bonus action to make a melee attack with the opposite end of the weapon; this is considered two-weapon fighting. The opposite end of the weapon uses a d4 for its damage die and deals bludgeoning damage."},"TOOLKIT_TRAINING_DISCIPLINE":{"id":"TOOLKIT_TRAINING_DISCIPLINE","name":"toolkit training (discipline)","text":"You are so experienced with tools that a frying pan, a wrench, or a blacksmith’s hammer might be as deadly in your hands as a blade. When wielding a tool you are proficient with as an improvised weapon, you are considered proficient with that weapon. The tool’s damage dice is 1d4, but you may choose each round if you wish to deal bludgeoning, piercing, or slashing damage, and you may use your key ability score, Dexterity, or Strength for attack rolls and damage rolls with these tools."},"UNARMED_TRAINING_DISCIPLINE":{"id":"UNARMED_TRAINING_DISCIPLINE","name":"unarmed training (discipline)","text":"You can treat your unarmed strikes as if they were finesse weapons, and they deal 1d4 bludgeoning damage. You may choose to treat your unarmed strike as having the light or versatile (1d6) properties, but not both simultaneously. Making a kick counts as using an unarmed strike with two hands with the versatile property.\n\nYou may take this talent twice. If taken twice, you may treat your kick as a light weapon as outlined above, meaning you may make a kick to use two-weapon fighting even if your hands are full."},"ARMOR_EXPERT":{"id":"ARMOR_EXPERT","name":"armor expert","text":"You ignore disadvantage on Dexterity (Stealth) imposed by medium armors and may treat medium armor as light armor for the purpose of the time it takes to don or doff armor. If you take this talent a second time, you may apply these benefits to heavy armor."},"ARMOR_TRAINING":{"id":"ARMOR_TRAINING","name":"armor training","text":"You gain proficiency with light armor. If you are already proficient with light armor, you become proficient with medium armor and shields. If you are already proficient with light and medium armor, you instead gain proficiency in heavy armor and shields. You may take this talent multiple times."},"ARTIFICER":{"id":"ARTIFICER","name":"artificer","text":"You have experience disassembling and assembling complex or foreign artifacts and mechanisms, whether they be arcane or technological. While you are not automatically proficient with alien technology, you gain advantage on all Intelligence checks made to figure out its use. The alien technology never permanently breaks from failing to figure it out."},"CRAFTSMAN":{"id":"CRAFTSMAN","name":"craftsman","text":"You are skilled at crafting and repairing gear. You gain proficiency with one type of artisan’s tools. When crafting a mundane item using a tool you are proficient with, you may do so in half the usual time."},"DAGGER_BRAVO":{"id":"DAGGER_BRAVO","name":"dagger bravo","text":"Your dagger weapon attacks score a critical hit on a roll of 19 or 20\\. At 11th level, when you score a critical hit with a dagger, you roll an additional d4 when determining the extra damage for a critical hit."},"EINHANDLER":{"id":"EINHANDLER","name":"einhandler","text":"If an enemy misses with a melee attack against you while you are wielding a finesse melee weapon in one hand, and nothing else in any other hand, you may as a reaction make an opportunity attack."},"EXPERT_RELOADING":{"id":"EXPERT_RELOADING","name":"expert reloading","text":"When wielding a weapon with which you are proficient, you may ignore the loading property if it has it."},"GARROTE_GRAPPLER":{"id":"GARROTE_GRAPPLER","name":"garrote grappler","text":"When you successfully deal damage to a creature with an attack action using a garrote, you may attempt to grapple that creature as a bonus action. If you expend martial focus, you may instead do so as part of making an attack of opportunity. Any time a creature attempts to escape your grapple and fails, it takes damage as if you had attacked it with the garrote."},"HAND_CROSSBOW_MASTERY":{"id":"HAND_CROSSBOW_MASTERY","name":"hand crossbow mastery","text":"When you make an Attack action with a one-handed weapon (including a hand crossbow), you can use a bonus action to attack with a hand crossbow you are holding."},"IMPOSSIBLE_RELOAD":{"id":"IMPOSSIBLE_RELOAD","name":"impossible reload","text":"You know how to use trick grips and nimble fingers to load ammunition into a one-handed ranged weapon, even when your other hand is full."},"MYSTIC_FISTS":{"id":"MYSTIC_FISTS","name":"mystic fists","text":"When you have martial focus, your unarmed strikes are treated as though they were magic for the purpose of damage resistance. You may choose to deal slashing or piercing damage with your unarmed strike instead of bludgeoning damage. The choice of damage type is made when the attack is declared. If you possess Unarmed Training, your unarmed strike damage increases to d6, or d8 through the versatile property."},"POINT_BLANK_SHOOTING":{"id":"POINT_BLANK_SHOOTING","name":"point-blank shooting","text":"Being within 5 feet of a hostile creature doesn’t impose disadvantage on your ranged attack rolls."},"POLEARM_GUARD":{"id":"POLEARM_GUARD","name":"polearm guard","text":"While you are wielding a glaive, halberd, pike, quarterstaff, or spear, other creatures provoke an opportunity attack from you when they enter your reach."},"POISON_BLOWGUN_SPECIALIST":{"id":"POISON_BLOWGUN_SPECIALIST","name":"poison blowgun specialist","text":"While you are using a blowgun, you may increase the saving throw DC of any poison coating its ammunition by your proficiency bonus. If the DC of the poison is already calculated using a proficiency bonus (such as poisons created with the Alchemy sphere), you may expend martial focus to add your proficiency bonus on top of the already existing proficiency bonus to determine its saving throw DC."},"SLING_COMBATANT":{"id":"SLING_COMBATANT","name":"sling combatant","text":"You may treat a loaded sling as if it were a club with the finesse weapon quality when making melee attacks with it. Any magical bonus to attack or damage also applies to your melee attack or damage roll.\n\nYou may also launch items such as alchemist’s fire, acid, holy water, or formulae or poison from the Alchemy sphere as if they were ammunition, using the sling’s range instead of the normal throwing range of the item. Any magical bonuses to attack rolls the sling grants apply to attack rolls made in this way.\n\nFinally, you may throw items from your sling lightly enough that the target can catch the item, with no attack roll required."},"SPEAR_DANCER":{"id":"SPEAR_DANCER","name":"spear dancer","text":"You may treat any glaive, quarterstaff, halberd, spear, pike, or trident (or similar weapon with GM approval) you wield as though it had the finesse weapon property. You may treat the glaive, halberd, or pike’s two-handed property as if it were the versatile property. Using these weapons in one hand reduces the damage die by one step (1d12 becomes 1d10, 1d10 becomes 1d8, 1d8 becomes 1d6)."},"SPLITSHOT":{"id":"SPLITSHOT","name":"splitshot","text":"Whenever you make an attack action with a bow, you can load two arrows and fire them as part of the first attack. When making an attack action in this fashion, your attack suffers disadvantage but can target two creatures within 10 feet of each other who are at least 20 feet away from you."},"THROW_SHIELD":{"id":"THROW_SHIELD","name":"throw shield","text":"You are proficient with the use of shields as an improvised weapon, and you may treat shields you wield as having the thrown (20/60 ft.) property.\n\nIf you have the Cover Ally talent of the shield sphere, you may treat any ally within your shield’s normal range as being within your shield’s reach by throwing it as part of the active defense. You may apply a (deflect) talent to this active defense as normal, performing any additional actions by ricocheting the shield off of the attack. If you have the Throwing Mastery talent, the shield returns after using Cover Ally as if you made an attack with it."},"THROWING_MASTERY":{"id":"THROWING_MASTERY","name":"throwing mastery","text":"When using a weapon with the thrown property to make a ranged attack, you may apply extra spin to the throw, causing the weapon to bounce back towards you after the attack resolves. As long as you have at least one hand free, you may automatically catch a weapon after it rebounds in this manner; otherwise, the weapon lands at your feet."},"UNARMORED_TRAINING":{"id":"UNARMORED_TRAINING","name":"unarmored training","text":"Your deft movements, physical conditioning, and expert use of your chosen weapons allow you to create a protective barrier around yourself as effective as any true suit of armor. While you are wearing no armor and are not wielding a shield, your AC equals 10 + Dexterity modifier + your key ability modifier."},"VERSATILE_SHIELD":{"id":"VERSATILE_SHIELD","name":"versatile shield","text":"You may use a shield as if it were a second hand when wielding a glaive, halberd, spear, pike, trident (or similar weapon with GM approval), or a two-handed crossbow or firearm by bracing the weapon against the shield.\n\nIf you are wielding a shield but not using it as listed above, you can use a bonus action after taking the Attack action to try to shove a creature within 5 feet of you with your shield."},"WHIP_FIEND":{"id":"WHIP_FIEND","name":"whip fiend","text":"You increase the base damage of whips you wield to 1d6\\. When you successfully deal damage with a whip, you may attempt to grapple the damaged creature as a bonus action. If successful, you may move up to half your speed to bring them adjacent to you as part of this bonus action.\n\nYou may also use your whip to grab objects within its reach as an Action."},"FUTURISTIC_VOYAGER_DISCIPLINE":{"id":"FUTURISTIC_VOYAGER_DISCIPLINE","name":"futuristic voyager (discipline)","text":"You gain proficiency with Futuristic era items and technology. Examples of Futuristic era weapons include antimatter rifles, laser pistols, and laser rifles."},"MODERN_VOYAGER_DISCIPLINE":{"id":"MODERN_VOYAGER_DISCIPLINE","name":"modern voyager (discipline)","text":"You gain proficiency with Modern era items and technology. Examples of Modern era weapons include automatic pistols, automatic rifles, dynamite, fragmentation grenades, grenade launchers, hunting rifles, revolvers, shotguns, and smoke grenades."},"RENAISSANCE_VOYAGER_DISCIPLINE":{"id":"RENAISSANCE_VOYAGER_DISCIPLINE","name":"renaissance voyager (discipline)","text":"You gain proficiency with Renaissance-era items and technology. Examples of Renaissance-era weapons include bombs, muskets, and pistols."}}