{"BOUND_CONSECRATION":{"id":"BOUND_CONSECRATION","name":"bound consecration","text":"**Augment 0 sp:** When using a consecration, you can choose to have the aura remain in place rather than move with you. Alternatively, you can apply a consecration to an object with a touch. The aura is centered on the object and moves with it (as normal, choose one corner of the object’s space to be the center of the consecration). You must make this choice when you first use the consecration."},"ATONEMENT_WORD":{"id":"ATONEMENT_WORD","name":"atonement (word)","text":"**Prerequisites:** Fate sphere.\n\nInvoking cosmic forces, you act as an intermediary on behalf of your alignment. If you are connected to a deity or another source of power due to your casting tradition, you can also intercede on its behalf. You make an Insight check using your key ability score instead of Wisdom against a DC 20\\. On a successful check, you restore the target to its original alignment."},"CONSECRATED_GROUND":{"id":"CONSECRATED_GROUND","name":"consecrated ground","text":"**Prerequisites:** Fate sphere (Bound Consecration), character level 5th.\n\n**Augment 2 sp:** When using an augmented consecration that remains in place rather than move with you, the duration is increased to 8 hours.\n\n**Augment 3 sp:** When using an augmented consecration that remains in place rather than move with you, the duration is increased to permanent until dispelled."},"DEATH_MOTIF":{"id":"DEATH_MOTIF","name":"death (motif)","text":"**Prerequisites:** Fate sphere (one (motif) talent), character level 5th.\n\nYou can grant a motif that allows a target to preserve and ultimately change the other motifs they bear. While this motif is active, whenever the target dismisses a motif that is augmented other than Death, there is a 50% chance that it does not end. Dismissing the motif while augmented allows the target to cast any (motif) talent they know as part of the same action."},"EXECRATION":{"id":"EXECRATION","name":"execration","text":"**Prerequisites:** Fate sphere (at least one \\[curse\\] (word) talent), character level 11th.\n\n**Augment 3 sp:** Any \\[curse\\] (word) talent effect that normally lasts until the start of the next turn instead becomes permanent until dispelled."},"THE_HIGH_PRIESTESS_MOTIF":{"id":"THE_HIGH_PRIESTESS_MOTIF","name":"the high priestess (motif)","text":"**Prerequisites:** Fate sphere (one (motif) talent), character level 5th.\n\nYou can grant a motif that extends the benefits of other motifs affecting the target to their allies. When you cast this motif, choose another motif currently affecting the target to link this motif to. The target’s allies gain the effect of the motif effect as long as they are within 30 feet of the target. Dismissing this motif while augmented allows the target to as part of the same action dismiss the linked (motif) talent bestowing the dismissed effect to all allies within 30 feet of the target."}}