{"ILLUSIONARY_OBSTRUCTION":{"id":"ILLUSIONARY_OBSTRUCTION","name":"illusionary obstruction","text":"You can create a figment called an obstruction that, instead of creating the impression of an object, instead obstructs everything within its area. Unlike normal figments, an obstruction cannot be disbelieved, and cannot be moved from the location where it was created.\n\n**Augment 1 sp:** Your obstruction makes everything within the figment’s area blurry, becoming lightly obscured. Attacks made against any target within this area suffers disadvantage, whether or not the attacker is also within the area themselves.\n\n**Augment 1 sp:** Your obstruction silences the area. Any creature or object entirely inside the figment is immune to thunder damage, and creatures are deafened while entirely inside it. Casting a spell that includes a verbal component is impossible there.\n\n**Augment 1 sp:** If you possess Greater Illusions, your obstruction removes touch and friction from the area. Each creature standing in its area when you first create the obstruction must succeed on a Dexterity saving throw or fall prone. A creature that enters the area or ends its turn there must also succeed on a Dexterity saving throw or fall prone. If a creature is struck by a hidden target while within the area, they might need to pass a Wisdom (Perception) check against your Sphere DC to even know they’ve been damaged.\n\n**Augment 1 sp:** If you possess Greater Illusions, your obstruction removes taste and smell within the area. No creature within the area can smell, nor gives off any scent. Wisdom (Perception) checks that rely on scent cannot be made while within the obstruction. This suppresses effects dependent on smell or taste, such as a troglodyte’s stench.\n\n**Augment 1 sp:** If you possess Veiled Illusions, your obstruction hides the auras of all creatures within the obstruction, making them undetectable to magic of any kind unless the caster succeeds on a spellcasting ability check against your sphere DC.\n\n**Augment 1 sp:** If you possess Intelligent Illusions, your obstruction suppresses the thoughts of all creatures within the obstruction. Creatures entirely inside the obstruction are immune to psychic damage, and effects that read or communicate with the mind such as telepathy, detect thoughts, magical lie-detection, etc. cannot be used by or on creatures entirely inside this obstruction."},"COMPLEX_ILLUSIONS":{"id":"COMPLEX_ILLUSIONS","name":"complex illusions","text":"**Augment 1 sp:**\n\nYou can create up to three figments, but each one can only be half the size of your usual figments. The number of figments you can create increases at 5th level (four figments), 11th level (five figments), and 17th level (six figments)."},"CONTROL_FIGMENT":{"id":"CONTROL_FIGMENT","name":"control figment","text":"**Casting Time:** 1 action  \n**Range:** as illusion  \n**Duration:** as the targeted effect  \n**Target:** one figment  \n**Cost:** 0 sp\n\nYou can make a spellcasting ability check against the spell save DC or sphere DC of the controller of an existing figment. If successful, you gain control of the figment and may command it as if it was your effect. Treat the figment in all ways as if it was cast by you, except this does not change any of the original variables related to level, Illusion sphere talents, class abilities, or spell points. You however must remain within your illusion range of the figment to maintain this effect as normal. If the figment was being maintained by concentration, you must assume concentration over the effect as if you had cast it."},"ILLUSIONARY_TERRAIN":{"id":"ILLUSIONARY_TERRAIN","name":"illusionary terrain","text":"**Augment 0 sp:** You can create figments that alter the appearance of the terrain itself or other features of the area around you. For example, while you could previously cover a wall with a bigger wall or use an illusionary carpet to hide a pit, now you can use a figment that makes a wall of fire appear as a harmless wall of mist, or change the appearance of terrain from grassland to forest. Extreme changes (such as changing a warm grassland into a wintery tundra) may require additional (sensory) talents to be convincing."},"INSISTENT_ILLUSIONS":{"id":"INSISTENT_ILLUSIONS","name":"insistent illusions","text":"**Augment 1 sp:** Choose one creature you can perceive. You give that target disadvantage on their next Intelligence (Investigation) check made to examine or disbelieve this figment, made within the next minute."},"POTENT_ILLUSIONS":{"id":"POTENT_ILLUSIONS","name":"potent illusions","text":"Your figments can be so powerful that they can affect creatures in many ways, even if they disbelieve them. Depending on what (sensory) talents you possess, this could include blinding lights, thunderous noise, smells so strong they induce nausea, or even fire that can kill.\n\n**Augment 3 sp:** Creatures who begin their turn within the area of your figment must make an Intelligence saving throw or be blinded for the round.\n\n**Augment 1 sp:** Creatures who begin their turn within the area of your figment must make an Intelligence saving throw or be deafened for one minute.\n\n**Augment 1 sp:** If you possess Greater Illusions, creatures who begin their turn within the area of your figment must make an Intelligence saving throw or take 1d4 psychic damage. The amount of psychic damage that a creature takes when it fails its saving throw increases by 1d4 at 5th level (2d4), 11th level (3d4), and 17th level (4d4).\n\n**Augment 2 sp:** If you possess Greater Illusions, creatures who begin their turn within the area of your figment must make an Intelligence saving throw or be poisoned for the round.\n\n**Augment 2 sp:** If you possess Veiled Illusions, creatures who begin their turn within the area of your figment must make an Intelligence saving throw or be frightened for the round.\n\n**Augment 2 sp:** If you possess Intelligent Illusions, creatures who begin their turn within the area of your figment must make an Intelligence saving throw or be charmed for as long as they remain inside the figment. A creature who disbelieves the figment becomes immune to its charm effect, and the charm ends if it was being affected."},"PROGRAMMED_ILLUSION":{"id":"PROGRAMMED_ILLUSION","name":"programmed illusion","text":"**Augment 1 sp:** When creating a figment, you can cause it not to appear immediately, but instead to wait to activate when a specific condition occurs. The illusion is imperceptible until then. The trigger can be as general or detailed as you like, though it must be based on visual or audible conditions that occur within 30 feet of the figment’s location. For example, you could create an illusionary monster that appears when someone opens a door, or a message that appears written in the air when someone says the correct word or phrase.\n\nYour figment has a permanent duration until triggered or dispelled (though you must still concentrate, unless using the augment to allow it to endure without concentration), though once triggered it performs a predetermined set of actions (set by you when it is created) with a maximum duration of 5 minutes, after which the figment disappears and the effect ends. If this figment is also altered with Permanent Illusion, then it will reset after 5 minutes, activating again the next time it’s trigger happens."},"SELECTIVE_ILLUSIONS":{"id":"SELECTIVE_ILLUSIONS","name":"selective illusions","text":"You can designate creatures to automatically disbelieve your figments, or to be immune to (figment) or (glamer) talents you use.\n\n**Augment 0 sp:** You can choose to have a total number of creatures equal to your proficiency bonus automatically disbelieve or be immune to this illusion."},"INTELLIGENT_ILLUSIONS_SENSORY":{"id":"INTELLIGENT_ILLUSIONS_SENSORY","name":"intelligent illusions (sensory)","text":"**Prerequisites:** Illusion sphere\n\nWhen augmenting a figment to include both an image and sound, you can also grant it intelligence. This means your figment can fool spells and abilities such as detect thoughts or telepathy and allow them to do quick calculations as if using your Intelligence score. Your figments can appropriately act on their own as well, responding to stimuli even if you are not there to direct the illusion yourself. This means you no longer need to use your action to direct your figments, although you must still spend an action to give them orders (for example, once you spend your action to order the illusion of a bartender to talk to the patrons, it will continue to do so until you spend another action to give it new orders).\n\nAdditionally, if you give a target the Illusionary Disguise (glamer), they can now fool thought-detecting and memory-probing magic, displaying only the mind, memories, and thoughts you desire unless the creature attempting the probe succeeds on a an Intelligence (Investigation) check against your sphere DC to notice the thoughts and memories are not truly genuine."},"MIRAGE":{"id":"MIRAGE","name":"mirage","text":"**Prerequisites:** Illusion sphere, Illusionary Terrain, 11th level or higher\n\n**Augment 2 sp:** When using Illusionary Terrain, you can increase the figment size to a 1-mile cube."},"PERMANENT_ILLUSION":{"id":"PERMANENT_ILLUSION","name":"permanent illusion","text":"**Prerequisites:** Illusion sphere, Universal sphere (Extended (metasphere)), 11th level or higher\n\nYour illusions are long lasting.\n\n**Augment 4 sp:** Your figments and glamers last until dispelled, without requiring your concentration."},"SHADOW_INFUSION":{"id":"SHADOW_INFUSION","name":"shadow infusion","text":"**Prerequisites:** Illusion sphere, Greater Illusions, Potent Illusions, 5th level or higher.\n\nWhenever you use a figment to deal psychic damage, you can change the damage type to any other damage type.\n\n**Augment 1 sp:** Any or all creatures within your figment are grappled as you choose until they successfully disbelieve the figment. A creature grappled by your illusion can make a free Intelligence (Investigation) check each round to disbelieve your illusion.\n\n**Augment 3 sp:** Any or all creatures within your figment are restrained as you choose until they successfully disbelieve the figment. A creature restrained by your illusion can make a free Intelligence (Investigation) check each round to disbelieve your illusion."}}