{"FIGHTING_STYLE":{"id":"FIGHTING_STYLE","name":"fighting style","text":"At 2nd level, you gain a fighting style. Choose one of the following options.\n\n* **Archery:** You gain a +2 bonus to attack rolls you make with ranged weapons.\n* **Defense:** While you are wearing armor, you gain a +1 bonus to AC.\n* **Dueling:** When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.\n* **Great Weapon Fighting:** When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2\\. The weapon must have the two-handed or versatile property for you to gain this benefit.\n* **Magic Spheres Adept:** (_Prerequisites:_ You must have an Intelligence, Wisdom, or Charisma score of 13 or higher to select this style option.) You gain a casting tradition. You do not, however, gain any spell points. If you already possess the casting feature or gain it later, you may exchange this benefit to instead gain 1 bonus magic talent of your choice.\n* **Martial Spheres Apprentice:** (Spheres of Might only) You gain a bonus martial talent. If you don’t possess it already, you gain the ability to achieve martial focus.\n* **Natural Weapon Fighting:** When you attack using only natural weapons (bites, claws, slams, etc.), you score a critical hit on a roll of a 19 or 20.\n* **Protection:** When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield.\n* **Two-Weapon Fighting:** When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."},"MAGEKNIGHT_PATH":{"id":"MAGEKNIGHT_PATH","name":"mageknight path","text":"At 3rd level, you can choose a path that reflects how you mix magical and martial power. This path grants you Path talents and a path power at 3rd level, as well as additional powers at 6th, 10th, 14th, and 18th levels."},"STALWART":{"id":"STALWART","name":"stalwart","text":"At 11th level, you may expend your martial focus to change the die result of any saving throw (not just Strength, Dexterity, and Constitution saving throws) to a 10, and may do so after the saving throw was rolled."}}