{"SEQUENCE":{"id":"SEQUENCE","name":"sequence","text":"You know how to string together actions in combat, building momentum and unbalancing enemies before executing powerful finishing blows. A sequence requires the rush induced by real danger; you cannot begin a sequence before combat starts, and your sequence ends automatically 1 round after combat ends.\n\nSequences have two parts: Links and finishers. Whenever you perform an action that qualifies as a link, this either begins a new sequence (being its first link), or increases the number of links in your current sequence by 1\\. You cannot have more than one sequence active at a time, and the total number of links you can have in your sequence is listed on Table: Prodigy.\n\nYou can only add 1 link to your sequence a turn. If you haven’t taken an action that adds a link to your sequence for 1 full round, your sequence goes down by 1 instead at the beginning of your turn. If you become dead, paralyzed, petrified, stunned, or unconscious, your sequence immediately ends.\n\n#### Links\n\nThe following things, if done as a result of an Action on your part, begin a sequence. If your sequence is already active, these activities can add links to your sequence whether or not they are done as an Action, but no more than once per any creature’s turn:\n\n* **Attack:** Successfully striking a target with an attack or a magic sphere effect that requires an attack roll.\n* **Overcome:** Defeat a target in a contested Athletics or Acrobatics check, such as when shoving or being shoved, grappling or being grappled.\n* **Debilitate:** A hostile creature fails a saving throw against a magic or martial sphere effect you created.\n* **Maneuver:** Take the Disengage or Dash actions.\n* **Defeat:** Reducing a hostile creature to 0 hit points.\n* **Heal:** Restore hit points to an ally or remove a condition such as blinded, charmed, frightened, nauseated, poisoned, stunned, or petrified.\n\n#### Finishers\n\nYou can perform any of the following finishers. Performing a finisher ends your sequence and cannot be used to start a new one. Some finishers have some sort of requirement to use, usually including a minimum number of links in your sequence.\n\nIf a finisher lets you target multiple creatures, you can move between attempts just as when performing an Attack action against multiple targets.\n\nThe following are your basic finishers:\n\n* **Adroit Momentum: (2 links)** When making an ability check, you can end your sequence to gain a +1d4 bonus. This must be done before the roll is made.\n* **Arcane Apocalypse: (4 links)** Cast a magic sphere effect that can usually be done as an Action as a bonus action instead. (6 links) Spend your action and bonus action to cast 3 different magic sphere effects that cost an Action to use. You can use these finishers even if any of your magic sphere effects cast that turn have a spell point cost of 1 or higher.\n* **Certain Strike: (2 links)** Gain advantage on a single attack roll.\n* **Doombringer: (2 links)** Make a single attack as a bonus action. (4 links) Make an Attack action as a bonus action. (6 links) Spend your action and bonus action to make three Attack actions.\n* **Focus: (3 links)** Regain martial focus with no action required.\n* **Ironhide:** As a reaction when someone rolls damage against you, reduce that damage by the links in your sequence x 5.\n* **Resilience: (4 links)** As a reaction, reroll a failed saving throw. This cannot be done if the roll was already made with advantage.\n\n### Integrated Techniques\n\nIf you are using Spheres of Might, you gain the following additional links and finishers if you possess the prerequisite spheres:\n\n#### Alchemy\n\n**Alchemical Application (link):** Use or apply any _formula_ or _poison_.\n\n**Carpet Bombing (finisher):** As an action, throw one _formula_ or _poison_ per link in your sequence. A creature cannot be affected by more than one formula or _poison_ used for this ability.\n\n#### Athletics\n\n**Hard Target (link):** Use acrobatics to successfully tumble through a target's space, or provoke an attack of opportunity from an enemy and dodge the attack.\n\n#### Barrage\n\n**Flurry (finisher):** As an action, make one ranged attack per link in your sequence, but no creature can be targeted by more than one attack. You can move as normal between attacks, as when making an Attack action.\n\n#### Barroom\n\n**Liquid Preparation (link):** Imbibe an alcoholic drink, formulae, or potion.\n\n**Stumbling Flow (link):** Fall prone.\n\n#### Beastmastery\n\n**Pack Attack (finisher):** As an action, you can command a number of animal allies up to your sequence length to make an attack as a reaction. No one creature can be targeted by more than two of these attacks.\n\n#### Berserker\n\n**Whirlwind (finisher):** As an action, you can make one melee or thrown weapon attack per link in your sequence. No one creature can be targeted by more than one attack. You can move as normal between attacks, as when making an Attack action.\n\n#### Brute\n\n**Clear the Field (finisher):** As an action, you can shove a number of creatures equal to the length of your sequence, and apply (manhandles) to each one. No one creature can be targeted by more than one _shove_. You can move as normal between shoves, as when making an Attack action.\n\n#### Dual Wielding\n\n**Duel Defense (link):** Take the Dodge action.\n\n#### Fencing\n\n**Feinting Set-Up (link):** Feint a creature.\n\n#### Gladiator\n\n**Braggadocio (link):** Perform a _boast_.\n\n#### Guardian\n\n**Deliberate Challenge (link):** Challenge a creature.\n\n**Endurance (link):** Fill your delayed damage pool to its maximum capacity.\n\n**Lockdown (link):** Use _patrol_.\n\n#### Retribution\n\n**Ready for Action (link):** Ready a _counterstrike_. Activating the readied attack cannot grant additional links.\n\n#### Scoundrel\n\n**Kleptomaniac (finisher):** As an action, you can attempt to steal from or perform a dirty trick on a number of creatures equal to the number of links in your sequence. No one creature can be targeted more than twice. You can move as normal between steal/dirty trick attempts, as when making an Attack action.\n\n#### Scout\n\n**Battlefield Assessment (link):** Scout a creature.\n\n**Vanish (link):** Take the Hide action.\n\n#### Shield\n\n**Defender (link):** A creature misses an attack roll against a target benefiting from your active defense.\n\n#### Sniper\n\n**Deliberate Load (link):** Reload a weapon with an action or bonus action.\n\n#### Trap\n\n**Trapped (link):** A hostile creature fails a saving throw against or takes damage from one of your traps.\n\n#### Warleader\n\n**Battlefield Coordination (link):** Use a _shout_ or activate a _tactic_.\n\n**Continue Guidance (link):** Maintain a _tactic_ with a bonus action.\n\n#### Wrestling\n\n**Snag (link):** Start your turn grappling a target."},"INTEGRATED_TECHNIQUES":{"id":"INTEGRATED_TECHNIQUES","name":"integrated techniques","text":"If you are using Spheres of Might, you gain the following additional links and finishers if you possess the prerequisite spheres:\n\n#### Alchemy\n\n**Alchemical Application (link):** Use or apply any _formula_ or _poison_.\n\n**Carpet Bombing (finisher):** As an action, throw one _formula_ or _poison_ per link in your sequence. A creature cannot be affected by more than one formula or _poison_ used for this ability.\n\n#### Athletics\n\n**Hard Target (link):** Use acrobatics to successfully tumble through a target's space, or provoke an attack of opportunity from an enemy and dodge the attack.\n\n#### Barrage\n\n**Flurry (finisher):** As an action, make one ranged attack per link in your sequence, but no creature can be targeted by more than one attack. You can move as normal between attacks, as when making an Attack action.\n\n#### Barroom\n\n**Liquid Preparation (link):** Imbibe an alcoholic drink, formulae, or potion.\n\n**Stumbling Flow (link):** Fall prone.\n\n#### Beastmastery\n\n**Pack Attack (finisher):** As an action, you can command a number of animal allies up to your sequence length to make an attack as a reaction. No one creature can be targeted by more than two of these attacks.\n\n#### Berserker\n\n**Whirlwind (finisher):** As an action, you can make one melee or thrown weapon attack per link in your sequence. No one creature can be targeted by more than one attack. You can move as normal between attacks, as when making an Attack action.\n\n#### Brute\n\n**Clear the Field (finisher):** As an action, you can shove a number of creatures equal to the length of your sequence, and apply (manhandles) to each one. No one creature can be targeted by more than one _shove_. You can move as normal between shoves, as when making an Attack action.\n\n#### Dual Wielding\n\n**Duel Defense (link):** Take the Dodge action.\n\n#### Fencing\n\n**Feinting Set-Up (link):** Feint a creature.\n\n#### Gladiator\n\n**Braggadocio (link):** Perform a _boast_.\n\n#### Guardian\n\n**Deliberate Challenge (link):** Challenge a creature.\n\n**Endurance (link):** Fill your delayed damage pool to its maximum capacity.\n\n**Lockdown (link):** Use _patrol_.\n\n#### Retribution\n\n**Ready for Action (link):** Ready a _counterstrike_. Activating the readied attack cannot grant additional links.\n\n#### Scoundrel\n\n**Kleptomaniac (finisher):** As an action, you can attempt to steal from or perform a dirty trick on a number of creatures equal to the number of links in your sequence. No one creature can be targeted more than twice. You can move as normal between steal/dirty trick attempts, as when making an Attack action.\n\n#### Scout\n\n**Battlefield Assessment (link):** Scout a creature.\n\n**Vanish (link):** Take the Hide action.\n\n#### Shield\n\n**Defender (link):** A creature misses an attack roll against a target benefiting from your active defense.\n\n#### Sniper\n\n**Deliberate Load (link):** Reload a weapon with an action or bonus action.\n\n#### Trap\n\n**Trapped (link):** A hostile creature fails a saving throw against or takes damage from one of your traps.\n\n#### Warleader\n\n**Battlefield Coordination (link):** Use a _shout_ or activate a _tactic_.\n\n**Continue Guidance (link):** Maintain a _tactic_ with a bonus action.\n\n#### Wrestling\n\n**Snag (link):** Start your turn grappling a target."},"IMBUE_SEQUENCE":{"id":"IMBUE_SEQUENCE","name":"imbue sequence","text":"At 3rd level, as part of starting a sequence, you can infuse yourself with mystic energy tied to one magic sphere you possess. Only a single imbue ability can be applied at a time, though the imbuement can be changed as a bonus action, and its effects end immediately when the sequence does. Imbuement effects do not cost spell points or require concentration unless noted. Beginning an imbuement or activating a finisher are sphere effects.\n\n#### Alteration\n\n**Minor Shapeshift:** You gain one trait that you can apply to a shapeshift. This is in addition to any traits otherwise granted by shapeshift.\n\n#### Conjuration\n\n**Double Team:** You have advantage on the first attack roll you make each turn against a target within your Conjuration companion’s reach.\n\n#### Creation\n\n**Debris Field:** The ground within 30 feet of you is considered difficult terrain for everyone except you.\n\n#### Dark\n\n**Shadow:** You become the center of a darkness, but you are unaffected by that darkness. You can apply a single (darkness) talent to this darkness as normal, paying any spell points required.\n\n#### Death\n\n**Vampiric Blade:** When making an attack action, you can deal additional necrotic damage equal to half your prodigy level once. When this damage is dealt, you gain a number of temporary hit points equal to the necrotic damage inflicted. These temporary hit points expire after 1 minute.\n\n#### Destruction\n\n**Destructive Edge:** When making an attack action, you can add your class level to one damage roll. The type of this damage matches a blast type of your choice you possess.\n\n#### Divination\n\n**Clear Sighted:** You gain the benefit of one sense you possess, paying any spell points required.\n\n#### Enhancement\n\n**Enhanced Combatant:** You, a weapon you wield, or a piece of armor or shield that you have equipped, gains the benefit of one (enhance) talent that you possess, paying any spell points required.\n\n#### Fate\n\n**Lucky:** You become the center of one non-instantaneous consecration you can create. You must pay any spell points required.\n\n#### Illusion\n\n**Blurred:** You can give one attack made against you each round disadvantage.\n\n#### Life\n\n**Regenerate:** Regain a number of hit points equal to the length of your sequence at the end of each of your turns.\n\n#### Light\n\n**Sunrise:** You shed bright light as if applying brighten to a glow. You can apply a single (glow) talent to this light as normal, paying any spell points required.\n\n#### Mind\n\n**Mind Breaker:** When you deal damage, shove, or grapple a target with an attack action, that creature subtracts 1d4 from the result of any Wisdom saving throws it rolls until the end of your next turn.\n\n#### Nature\n\n**Aura of Flame (requires Fire Geomancy):** All hostile creatures within 5 feet of you at the end of their turn take fire damage equal to the length of your sequence.\n\n**Fog of War (requires Water Geomancy):** You are shrouded in heavy mist to a 5-foot radius per link, which is considered heavily obscured.\n\n**Greenstep (requires Plant Geomancy):** You can ignore difficult terrain caused by plantlife (including magical plantlife) and can see unhindered through plantlife up to 30 feet.\n\n**Steel Skin (requires Metal Geomancy):** You ignore disadvantage to Dexterity (stealth) checks from any armor primarily composed of metal and gain advantage on any saving throws or opposed ability checks to resist effects targeting your armor and weapons that are primarily composed of metal.\n\n**Tunnel (requires Earth Geomancy):** You gain a 10 foot burrow speed. This means you can move through sand, earth, mud, or ice, but not stone.\n\n**Wind Barrier (requires Air Geomancy):** Ranged weapon attacks against you have disadvantage.\n\n#### Protection\n\n**Defended:** You gain the benefit of one aegis you possess, paying any spell points required.\n\n#### Telekinesis\n\n**Air Step:** You fall at a rate of 60 feet per round and become immune to falling damage. If you are capable of using levitate on yourself, whenever you add a link to your sequence you gain a 20 ft. fly speed until the end of your next turn.\n\n#### Time\n\n**Time Slip:** Your speed increases by +10 feet.\n\n#### Warp\n\n**Step Between:** You do not provoke attacks of opportunity from movement.\n\n#### Universal\n\n**Chaos Aura (requires any wild magic talent):** Hostile creatures within 20 feet of you increase their wild magic chance by 10% per link.\n\n**Weaken Dweomer (requires Dispel):** You gain advantage on one saving throw made against magic each round.\n\n#### Weather\n\n**Buffeting Air:** You gain advantage on any Strength (Athletics) or Dexterity (Acrobatics) check made in response to something starting a contested roll against you (such as a shove, tumble, or grapple)."},"PRODIGY_S_CALLING":{"id":"PRODIGY_S_CALLING","name":"prodigy's calling","text":"[Fold](javascript:;)[Unfold](javascript:;)\n\nTable of Contents\n\n[Quick Build](#toc0)\n\n[Class Features](#toc1)\n\n[Hit Points](#toc2)\n\n[Proficiencies](#toc3)\n\n[Equipment](#toc4)\n\n[Spherecasting](#toc5)\n\n[Spell Pool](#toc6)\n\n[Blended Training](#toc7)\n\n[Martial Focus](#toc8)\n\n[Sequence](#toc9)\n\n[Links](#toc10)\n\n[Finishers](#toc11)\n\n[Integrated Techniques](#toc12)\n\n[Prodigy’s Calling](#toc13)\n\n[Imbue Sequence](#toc14)\n\n[Ability Score Improvement](#toc15)\n\n[Extra Attack](#toc16)\n\n[Unbroken Sequence](#toc17)\n\n[Focused Sequence](#toc18)\n\n[Expertise](#toc19)\n\n[Steady Skill](#toc20)\n\n[Flawless Sequence](#toc21)\n\n[Prodigious Skill](#toc22)\n\n[Perfected Prodigy](#toc23)\n\n[Callings](#toc24)\n\n[Battleborn (Spheres of Might)](#toc25)\n\n[Natural Talents](#toc26)\n\n[Inspired Hit](#toc27)\n\n[Natural Inspiration](#toc28)\n\n[Greater Extra Attack](#toc29)\n\n[Masterful Inspiration](#toc30)\n\n[Genius Hit](#toc31)\n\n[Battleborn (Core)](#toc32)\n\n[Fighting Style](#toc33)\n\n[Inspired Hit](#toc34)\n\n[Additional Fighting Style](#toc35)\n\n[Greater Extra Attack](#toc36)\n\n[Magical Resilience](#toc37)\n\n[Genius Hit](#toc38)\n\n[Mimic’s Calling](#toc39)\n\n[Mimicry](#toc40)\n\n[Perfected Calling](#toc41)\n\n[Savant’s Calling](#toc42)\n\n[Meditative Talents](#toc43)\n\n[Reflect Spell](#toc44)\n\n[Quick Rumination](#toc45)\n\n[Greater Reflect Spell](#toc46)\n\n[Instant Rumination](#toc47)\n\n[Masterful Rumination](#toc48)\n\n_“I can do that.”_\n\nBrilliant warriors capable of combining martial and magic techniques into a seamless flow, bewildering allies and confounding foes with their unparalleled adaptability."},"UNBROKEN_SEQUENCE":{"id":"UNBROKEN_SEQUENCE","name":"unbroken sequence","text":"At 6th level, when your sequence would be ended by the paralyzed, stunned, petrified, or unconscious conditions, you can expend martial focus to prevent the sequence from ending for 1 round."},"STEADY_SKILL":{"id":"STEADY_SKILL","name":"steady skill","text":"Beginning at 11th level, whenever you make any ability check and roll a 7 or lower on the d20, you can treat the roll as if it had been an 8."},"FLAWLESS_SEQUENCE":{"id":"FLAWLESS_SEQUENCE","name":"flawless sequence","text":"At 13th level, you do not lose a link from your sequence if you failed to add a link since the beginning of your previous turn, and no longer need to expend martial focus to prevent your sequence ending from the paralyzed, stunned, petrified, or unconscious conditions."},"PRODIGIOUS_SKILL":{"id":"PRODIGIOUS_SKILL","name":"prodigious skill","text":"Beginning at 15th level, whenever you would make an ability check you can spend a spell point instead of rolling the d20 to treat the d20 as if it had rolled a 15."},"PERFECTED_PRODIGY":{"id":"PERFECTED_PRODIGY","name":"perfected prodigy","text":"At 20th level, when you start a sequence, it begins with three links instead of one."}}