{"AIDED_ACROBATICS":{"id":"AIDED_ACROBATICS","name":"aided acrobatics","text":"_(especially useful in the Athletics sphere)_\n\nIt is possible to perform some acrobatic actions with the aid of a tool that otherwise wouldn’t be possible. Some examples are given below.\n\n* **Aided Climb:** Use daggers, pickaxes, or some other one-handed piercing weapons to climb a wall that would otherwise be unclimbable.\n* **Aided Fall:** Use daggers, pickaxes, a tanglefoot bag, or some other piercing weapon as a Reaction to stick to a wall and stop your fall.\n* **Bomb Jump:** Throw an explosive behind you as an Action to treat your Strength or Dexterity as 10 higher when determining your jump’s distance or height.\n* **Combat Sledding:** Ride downhill on a sled or shield to let you take a Dash action as a bonus action.\n* **Gliding:** Use a cloak or similar tool as a Reaction during a running jump to glide 1 foot horizontally for every 2 feet fallen vertically.\n* **Pole Vault:** Use a 10-foot pole, polearm, quarterstaff, or spear to pole vault as an Action, letting you treat your Strength or Dexterity score as 10 higher when determining your jump’s distance or height.\n\nWhen performing any such action, you must usually pass a Hard Strength (Athletics) or Dexterity (Acrobatics) check (DC 20) to keep from failing and falling prone. If an ability check would already be called for, it is instead made with disadvantage."},"ATTACK":{"id":"ATTACK","name":"attack","text":"_(universally useful in all martial spheres)_\n\nThe most common action to take in combat is the Attack action, whether you are swinging a sword, firing an arrow from a bow, or brawling with your fists. With this action, you make one melee or ranged attack.\n\nCertain features, such as the conscript’s Extra Attack feature, allow you to make more than one attack with this action."},"CAST_A_SPELL":{"id":"CAST_A_SPELL","name":"cast a spell","text":"_(not especially useful in any martial spheres)_\n\nSpellcasters such as wizards and clerics, as well as many monsters, have access to spells and can use them to significant effect in combat. Each spell has a casting time, which specifies whether the caster must use an action, a reaction, minutes, or even hours to cast the spell. Casting a spell is, therefore, not necessarily an action. Most spells do have a casting time of 1 action, so a spellcaster often uses his or her action in combat to cast such a spell."},"CLIMB_ONTO_A_BIGGER_CREATURE":{"id":"CLIMB_ONTO_A_BIGGER_CREATURE","name":"climb onto a bigger creature","text":"_(especially useful in the Athletics, Beastmastery spheres)_\n\nWhen dealing with a creature two sizes larger than yourself, you may treat that creature as terrain for the purpose of jumping onto its back or clinging to a limb. After making any ability checks necessary to get into position and onto the larger creature, the smaller creature uses its action to make a Strength (Athletics) or Dexterity (Acrobatics) check contested by the target’s Dexterity (Acrobatics) check. If it wins the contest, the smaller creature successfully moves into the target creature’s space and clings to its body. While in the target’s space, the smaller creature moves with the target and has advantage on attack rolls against it.\n\nThe smaller creature can move around within the larger creature’s space, treating the space as difficult terrain. The larger creature’s ability to attack the smaller creature depends on the smaller creature’s location, and is left to your discretion.\n\nThe larger creature can dislodge the smaller creature as an action - knocking it off, scraping it against a wall, or grabbing and throwing it - by making a Strength (Athletics) check contested by the smaller creature’s Strength (Athletics) or Dexterity (Acrobatics) check. The smaller creature chooses which ability to use."},"CONTROL_A_MOUNT":{"id":"CONTROL_A_MOUNT","name":"control a mount","text":"_(especially useful in the Beastmastery sphere)_\n\nWhile you’re mounted, you have two options. You can either control the mount or allow it to act independently. Intelligent creatures, such as dragons, act independently.\n\nYou can control a mount only if it has been trained to accept a rider. Domesticated horses, donkeys, and similar creatures are assumed to have such training. The initiative of a controlled mount changes to match yours when you mount it. It moves as you direct it, and it has only three action options: Dash, Disengage, and Dodge. A controlled mount can move and act even on the turn that you mount it.\n\nAn independent mount retains its place in the initiative order. Bearing a rider puts no restrictions on the actions the mount can take, and it moves and acts as it wishes. It might flee from combat, rush to attack and devour a badly injured foe, or otherwise act against your wishes.\n\nIn either case, if the mount provokes an opportunity attack while you’re on it, the attacker can target you or the mount."},"DASH":{"id":"DASH","name":"dash","text":"_(especially useful in the Athletics sphere)_\n\nWhen you take the Dash action, you gain extra movement for the current turn. The increase equals your speed after applying any modifiers. For example, with a speed of 30 feet you can move up to 60 feet on your turn if you dash.\n\nAny increase or decrease to your speed changes this additional movement by the same amount. If your speed of 30 feet is reduced to 15 feet, for instance, you can move up to 30 feet this turn if you dash."},"DIRTY_TRICK":{"id":"DIRTY_TRICK","name":"dirty trick","text":"_(especially useful in the Scoundrel sphere)_\n\nAs an action, you may attempt to gouge a creature’s eyes, kick dirt in its face, box its ears, tangle its limbs together, tie their clothing in a knot, or any other, similarly underhanded maneuver. You must make a Dexterity ability (Sleight of Hand) check contested by that creature’s Strength (Athletics) or Dexterity (Acrobatics) check. The GM determines the exact dirty tricks available depending on what the target is wearing, what is nearby, or how you plan to inhibit it. Depending on the exact dirty trick performed, if you succeed you could make the creature deafened for 1 minute, knock the target prone, the target’s movement speed is reduced by half for 1 minute, the target is grappled for 1 round, or blind the target for 1 round, or something else similar. Usually, a target can spend an action to rub out their eyes, untie their clothing, or otherwise undo the dirty trick and end this effect early."},"DISARM":{"id":"DISARM","name":"disarm","text":"_(especially useful in the Brute, Fencing, Scoundrel, Shield spheres)_\n\nA creature can use a weapon attack to knock a weapon or another item from a target’s grasp. The attacker makes an attack roll contested by the target’s Strength (Athletics) check or Dexterity (Acrobatics) check. If the attacker wins the contest, the attack causes no damage or other ill effect, but the defender drops the item.\n\nThe attacker has disadvantage on its attack roll if the target is holding the item with two or more hands. The target has advantage on its ability check if it is larger than the attacking creature, or disadvantage if it is smaller."},"DISENGAGE":{"id":"DISENGAGE","name":"disengage","text":"_(especially useful in the Athletics sphere)_\n\nIf you take the Disengage action, your movement doesn’t provoke opportunity attacks for the rest of the turn."},"DODGE":{"id":"DODGE","name":"dodge","text":"_(especially useful in the Shield sphere)_\n\nWhen you take the Dodge action, you focus entirely on avoiding attacks. Until the start of your next turn, any attack roll made against you has disadvantage if you can see the attacker, and you make Dexterity saving throws with advantage.\n\nYou lose this benefit if you are incapacitated or if your speed drops to 0."},"FEINT":{"id":"FEINT","name":"feint","text":"_(especially useful in the Fencing, Leadership spheres)_\n\nWhen using the Help action, you can aid a friendly creature in attacking a creature within 5 feet of you. You feint, distract the target, or in some other way team up to make your ally’s Attack more effective. If your ally attacks the target before your next turn, the first Attack roll is made with advantage.\n\nIn Spheres of Might, any use of Help to give someone advantage on an attack roll, be they an ally or yourself, is called a ‘feint.’"},"GRAPPLE":{"id":"GRAPPLE","name":"grapple","text":"_(especially useful in the Gladiator, Wrestling spheres)_\n\nWhen you want to grab a creature or wrestle with it, you can use the Attack action to make a special melee attack, a grapple. If you can make multiple attacks with the Attack action, this attack replaces one of them.\n\nThe target of your grapple must be no more than one size larger than you and must be within your reach. Using at least one free hand, you try to seize the target by making a grapple check instead of an attack roll: a Strength (Athletics) check contested by the target’s Strength (Athletics) or Dexterity (Acrobatics) check (the target chooses the ability to use). You succeed automatically if the target is incapacitated. If you succeed, you subject the target to the grappled condition (see appendix B). The condition specifies the things that end it, and you can release the target whenever you like (no action required).\n\n**Escaping a Grapple:** A grappled creature can use its action to escape. To do so, it must succeed on a Strength (Athletics) or Dexterity (Acrobatics) check contested by your Strength (Athletics) check.\n\n**Moving a Grappled Creature:** You can drag or carry the grappled creature with you when you move, but your speed is halved unless the creature is two or more sizes smaller than you."},"HELP":{"id":"HELP","name":"help","text":"_(especially useful in the Fencing, Leadership spheres)_\n\nYou can lend your aid to another creature in the completion of a task. When you take the Help action, the creature you aid gains advantage on the next ability check it makes to perform the task you are helping with, provided that it makes the check before the start of your next turn."},"HIDE":{"id":"HIDE","name":"hide","text":"_(especially useful in the Scout sphere)_\n\nWhen you take the Hide action, you make a Dexterity (Stealth) check in an attempt to hide. Until you are discovered or stop hiding, that check’s total is contested by the Wisdom (Perception) check of any creature taking the Search action. As long as no creature successfully beats your check, you are hidden.\n\n#### Hiding\n\nThe GM decides when circumstances are appropriate for hiding.\n\nYou can’t hide from a creature that can see you clearly, and you give away your position if you make noise, such as shouting a warning or knocking over a vase.\n\nAn invisible creature can always try to hide. Signs of its passage might still be noticed, and it does have to stay quiet. In combat, most creatures stay alert for signs of danger all around, so if you come out of hiding and approach a creature, it usually sees you. In situations where you can remain hidden as you approach the creature, you gain advantage on an attack roll before you are seen.\n\n**Passive Perception:** When you hide, there’s a chance someone will notice you even if they aren’t searching. To determine whether such a creature notices you, the GM compares your Dexterity (Stealth) check with that creature’s passive Wisdom (Perception) score, which equals 10 + the creature’s Wisdom modifier, as well as any other bonuses or penalties. If the creature has advantage, add 5\\. For disadvantage, subtract 5."},"OPPORTUNITY_ATTACK":{"id":"OPPORTUNITY_ATTACK","name":"opportunity attack","text":"_(especially useful in the Guardian, Retribution spheres)_\n\nIn a fight, everyone is constantly watching for a chance to strike an enemy fleeing or passing by. Such a strike is called an opportunity attack.\n\nYou can make an opportunity attack when a hostile creature that you can see moves out of your reach. To make the opportunity attack, you use your reaction to make one melee attack against the provoking creature. The attack occurs right before the creature leaves your reach.\n\nYou can avoid provoking an opportunity attack by taking the Disengage action. You also don’t provoke an opportunity attack when you teleport or when someone or something moves you without using your movement, action, or reaction. For example, you don’t provoke an opportunity attack if an explosion hurls you out of a foe’s reach or if gravity causes you to fall past an enemy."},"OVERRUN":{"id":"OVERRUN","name":"overrun","text":"_(especially useful in the Beastmastery, Brute spheres)_\n\nWhen a creature tries to move through a hostile creature’s space, the mover can try to force its way through by overrunning the hostile creature. As an action or a bonus action, the mover makes a Strength (Athletics) check contested by the hostile creature’s Strength (Athletics) check. The creature attempting the overrun has advantage on this check if it is larger than the hostile creature, or disadvantage if it is smaller.\n\nIf the mover wins the contest, it can move through the hostile creature’s space once this turn."},"READY":{"id":"READY","name":"ready","text":"_(especially useful in the Retribution sphere)_\n\nSometimes you want to get the jump on a foe or wait for a particular circumstance before you act. To do so, you can take the Ready action on your turn, which lets you act using your reaction before the start of your next turn.\n\nFirst, you decide what perceivable circumstance will trigger your reaction. Then, you choose the action you will take in response to that trigger, or you choose to move up to your speed in response to it. Examples include “If the cultist steps on the trapdoor, I’ll pull the lever that opens it,” and “If the goblin steps next to me, I move away.”\n\nWhen the trigger occurs, you can either take your reaction right after the trigger finishes or ignore the trigger.\n\nWhen you ready a spell, you cast it as normal but hold its energy, which you release with your reaction when the trigger occurs. To be readied, a spell must have a casting time of 1 action, and holding onto the spell’s magic requires concentration.\n\nIf your concentration is broken, the spell dissipates without taking effect. For example, if you are concentrating on the web spell and ready magic missile, your web spell ends, and if you take damage before you release magic missile with your reaction, your concentration might be broken."},"ROPE_SWING":{"id":"ROPE_SWING","name":"rope swing","text":"_(especially useful in the Athletics sphere)_\n\nYou can use a secured chain or rope, a grappling hook, or a whip to swing around the battlefield. If you are using Spheres of Power, you can use a secured Tether magic talent (see the Destruction, Telekinesis, or Universal (manabond) spheres). There must be something present for the item to attach to (for example, you could lash a chandelier, but not a blank bit of wall). Attaching such an item requires an action and that the anchor spot is within the item’s reach. Treat a grappling hook as having a reach of 30 feet for this purpose. You can make an anchor spot on a creature at least 2 sizes bigger than you, but this requires an attack roll.\n\nOnce your rope or weapon is secured, as part of your normal movement you may attempt to move to any other legal square on the ground that is within the rope or weapon’s reach as determined from the anchor point. Your movement does not provoke attacks of opportunity. You must still have a clear path towards the destination. Dislodging your weapon or item requires another action."},"SCOOT_SHOT":{"id":"SCOOT_SHOT","name":"scoot shot","text":"_(especially useful in the Sniper sphere)_\n\nYou can make a ranged attack roll against an AC of 10 to scoot an unattended Tiny object 10 feet away from you."},"SEARCH":{"id":"SEARCH","name":"search","text":"_(especially useful in the Scout, Trap spheres)_\n\nWhen you take the Search action, you devote your attention to finding something. Depending on the nature of your search, the DM might have you make a Wisdom (Perception) check or an Intelligence (Investigation) check."},"SHOVE":{"id":"SHOVE","name":"shove","text":"_(especially useful in the Brute, Gladiator spheres)_\n\nUsing the Attack action, you can make a special melee attack to shove a creature, either to knock it prone or push it away from you. If you can make multiple attacks with the Attack action, this attack replaces one of them.\n\nThe target must be no more than one size larger than you and must be within your reach. Instead of making an attack roll, you make a Strength (Athletics) check contested by the target’s Strength (Athletics) or Dexterity (Acrobatics) check (the target chooses the ability to use). You succeed automatically if the target is incapacitated. If you succeed, you either knock the target prone or push it 5 feet away from you."},"SHOVE_ASIDE":{"id":"SHOVE_ASIDE","name":"shove aside","text":"_(especially useful in the Brute, Gladiator spheres)_\n\nA creature can use the Shove action to force a target to the side rather than away. The attacker has disadvantage on its Strength (Athletics) check when it does so. If that check is successful, the attacker moves the target 5 feet to a different space within its reach."},"SLEIGHT_OF_HAND":{"id":"SLEIGHT_OF_HAND","name":"sleight of hand","text":"_(especially useful in the Scoundrel sphere)_\n\nWhenever you attempt an act of legerdemain or manual trickery, such as planting something on someone else or concealing an object on your person, make a Dexterity (Sleight of Hand) check. The GM might also call for a Dexterity (Sleight of Hand) check to determine whether you can lift a coin purse off another person or slip something out of another person’s pocket."},"STEAL":{"id":"STEAL","name":"steal","text":"_(especially useful in the Scoundrel sphere)_\n\nYou may make a Dexterity (Sleight of Hand) check as an action to take something from a target. This is contested by their Wisdom (Perception) skill if they are not aware of you, or their Strength (Athletics) or Dexterity (Acrobatics) skill if they are aware of you. You have disadvantage on this check if the target object is securely fastened (such as a backpack they are wearing or a sword inside its scabbard at their belt). You may plant an item instead of taking an item with a similar check."},"TUMBLE":{"id":"TUMBLE","name":"tumble","text":"_(especially useful in the Athletics sphere)_\n\nA creature can try to tumble through a hostile creature’s space, ducking and weaving past the opponent. As an action or a bonus action, the tumbler makes a Dexterity (Acrobatics) check contested by the hostile creature’s Dexterity (Acrobatics) check. If the tumbler wins the contest, it can move through the hostile creature’s space once this turn."},"TWO_WEAPON_FIGHTING":{"id":"TWO_WEAPON_FIGHTING","name":"two-weapon fighting","text":"_(especially useful in the Dual Wielding sphere)_\n\nWhen you take the Attack action and attack with a light melee weapon that you’re holding in one hand, you can use a bonus action to attack with a different light melee weapon that you’re holding in the other hand. You don’t add your ability modifier to the bonus attack’s damage unless that modifier is negative.\n\nIf either weapon has the thrown property, you can throw the weapon instead of making a melee attack with it."},"USE_AN_OBJECT":{"id":"USE_AN_OBJECT","name":"use an object","text":"_(especially useful in the Alchemy, Barroom, Tinkerer spheres)_\n\nYou normally interact with an object while doing something else, such as when you draw a sword as part of an attack.\n\nWhen an object requires your action for its use, you take the Use an Object action. This action is also useful when you want to interact with more than one object on your turn."}}