{"ALTER":{"id":"ALTER","name":"alter","text":"**Casting Time:** 1 action  \n**Range:** Touch  \n**Duration:** Concentration, up to 1 minute (unless noted)  \n**Target:** One non-magical unattended object  \n**Cost:** 0 sp\n\nYou can alter an object with a touch. The object cannot be larger than Tiny size, although you can target a Tiny-sized portion of a larger object (such as a wall). This increases to Small size at 5th level, Medium size at 11th level, and Large size at 17th level.\n\nYou cannot alter an animate target (such as a golem or animated object) and the object must be non-magical and unattended (not held, worn, or part of a creature’s equipment).\n\n**Augment 2 sp:** The effect persists for the remaining duration without concentration. This augment may be applied after the effect is cast on your turn without an action.\n\n**Augment 1 sp:** The size of the object you can alter may be up to two sizes larger.\n\nWhen you gain the Creation sphere, you can alter objects in the following ways:"},"CREATE":{"id":"CREATE","name":"create","text":"**Casting Time:** 1 action  \n**Range:** touch  \n**Duration:** Concentration, up to 1 minute  \n**Target:** Empty space that you can see that is sufficient to contain the created object  \n**Cost:** 0 sp\n\nYou can create objects out of magic that appear in either your hand or adjacent to you. You may create a single non-magical, unattended object out of vegetable matter such as wood, hemp, or cotton that may be no larger than Tiny size, increasing to Small size at 5th level, Medium size at 11th level, and Large size at 17th level.\n\nIf you cannot carry, hold, or wield the created object with two hands due to bulk, weight, or size, it must begin in an adjacent square and no part of it can be more than 30 feet away.\n\nYou cannot create items that require mixing, carry special properties, or knowledge you don’t possess (alchemical items, rare herbs, the key to a lock you didn’t create, etc.). A DC 10 Intelligence check reveals the object as a magical fake. Fabricated objects have a lingering magical aura that can be detected as magic, although the objects themselves aren’t magical.\n\nWhile simple objects such as candles, folds of cloth, simple furniture, or basic weapons are easy to create, particularly complex objects (mechanics, crossbows, objects with moving parts) require an ability check be made as if crafting that object. Failure means the object comes into being broken and unusable. You cannot create an object directly onto a target (summoning manacles onto someone’s wrists, etc.).\n\n**Augment 1 sp:** The size of the object you can create may be up to two sizes larger.\n\n**Augment 2 sp:** The effect persists for the remaining duration without concentration. This augment may be applied after the effect is cast on your turn without an action."}}