{"DEGRADE":{"id":"DEGRADE","name":"degrade","text":"**Casting Time:** 1 action  \n**Range:** 30 feet  \n**Duration:** Concentration, up to 10 minutes  \n**Target:** 1 creature or object  \n**Cost:** 0 sp  \n**Saving Throw:** Wisdom\n\nYou can degrade a creature or object within range. The target is allowed a Wisdom saving throw to negate the effect on itself or objects in its possession. At the end of each of its turns, an affected creature can make a Wisdom saving throw. On a success, the effect ends for that creature or an object in its possession.\n\n**Augment 2 sp:** The effect persists for the remaining duration without concentration. This augment may be applied after the effect is cast on your turn without an action."},"ENHANCE":{"id":"ENHANCE","name":"enhance","text":"**Casting Time:** 1 action  \n**Range:** 30 feet  \n**Duration:** Concentration, up to 10 minutes  \n**Target:** 1 creature or object  \n**Cost:** 0 sp  \n**Saving Throw:** Wisdom\n\nYou can enhance a creature or object within range. If targeting a creature or intelligent item that doesn’t want to be enhanced (or an item in the possession of a creature that doesn’t want their item enhanced), the target is allowed a Wisdom saving throw to negate the effect. At the end of each of its turns, an affected creature can make a Wisdom saving throw. On a success, the effect ends for that creature or an object in its possession.\n\n**Augment 2 sp:** The effect persists for the remaining duration without concentration. This augment may be applied after the effect is cast on your turn without an action.\n\nIf an ability grants both degrade and enhance options, attempting to apply the degrade option to a target under the effects of the enhance, or vice versa, requires you to succeed on a spellcasting ability check against the sphere DC of the existing effect; if successful, you counter the previous effect rather than applying the new one.\n\nTalents marked as (degrade) or (enhance) grant you new options you can bestow. When using a degrade or enhance ability, you choose one option among those you possess to bestow.\n\nSome talents have a spell point cost different than the base degrade or enhance abilities; these replace the base cost of the ability when used."}}