{"FIGMENT":{"id":"FIGMENT","name":"figment","text":"**Casting Time:** 1 action  \n**Range:** 60 feet  \n**Duration:** Concentration up to 10 minutes  \n**Cost:** 0 sp\n\nYou can create the image of something that is not actually there, known as a ‘figment’. Your figment has a maximum size of a 10-foot cube, which improves by 5 feet at 5th level (15-foot cube), 11th level (20-foot cube), and 17th level (25-foot cube).\n\nAlternatively, you can create an illusionary sound such as a lion’s roar, a speaking voice, etc.. Whether creating figments or simply sounds, you cannot create illusions that can directly affect the world around you; your images cannot affect objects and you cannot create sounds loud enough to deafen or deal thunder damage, etc.\n\nAs long as you are within range of a visual figment, you can use your action to cause the image to move to any other spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking. If you are not using your action to control it, however, the image simply sits still and does not move.\n\nPhysical interaction with a visual figment reveals it to be an illusion, because things can pass through it. Likewise, creatures that rely primarily on a sense that your illusion does not affect may often ignore your illusions completely. For example, a target with a keen sense of smell (such as a wolf or dog) will automatically disbelieve a figment of a person if you do not have the Greater Illusions talent.\n\nA creature that uses its action to examine the image or sound can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and its other sensory qualities become faint to the creature.\n\n**Augment 1 sp:** Your illusion includes both sight and sound. If you possess (sensory) talents, any or all of those talents are also applied to the figment as you so choose.\n\n**Augment 1 sp:** Your figment increases in size to a 20-foot cube. This increases by 10 feet at 5th level (30-foot cube), 11th level (40-foot cube), and 17th level (50-foot cube).\n\n**Augment 2 sp:** The effect persists for the remaining duration without concentration. This augment may be applied after the effect is cast on your turn without an action."},"GLAMER":{"id":"GLAMER","name":"glamer","text":"**Casting Time:** 1 action  \n**Range:** 60 feet  \n**Duration:** Concentration up to 10 minutes  \n**Target:** one creature or object\n\nIf you possess a (glamer) talent, you may create an illusion that alters the appearance or perceived characteristics of a creature or object in some way. Unlike with a figment, you do not need to use your action to move the glamer; instead, the glamer moves with whatever target it is attached to as they do. Whenever you use this ability, grant a target the effects of one (glamer) talent you possess. Unlike figments, glamers (with some exceptions noted in the talent) cannot be disbelieved; for example, an invisible creature is simply invisible, whether or not a target ‘believes’ it to be true.\n\n**Augment 2 sp:** The effect persists for the remaining duration without concentration. This augment may be applied after the effect is cast on your turn without an action."}}