{"ANIMALISTIC_GENOTYPE":{"id":"ANIMALISTIC_GENOTYPE","type":"GENOTYPE","name":"animalistic (genotype)","text":"You grant the form of a land beast or monstrosity with your shapeshift.  \n**Limbs:** 1 head, 4 legs with all the benefits of being a quadruped.  \n**Speed:** 40-foot land speed. The land speed increases by 20 feet at 5th level (60 feet), 11th level (80 feet), and 17th level (100 feet).  \n**Natural weapons:** bite \\[natural weapon\\] (1d6 piercing)  \n**AC:** 13 + Dexterity modifier  \n**Senses:** Scent ability (see below).  \n**Special:** The target counts as being of either the beast or monstrosity type (your choice) in addition to its normal type.\n\n* **Animal Speed:** A land speed as that granted by the Animalistic (genotype) shape (grants 2 legs if the target lacked legs).\n* **Hooves:** \\[natural weapon\\] (requires legs) 1d4 bludgeoning. If you successfully overrun a target, it suffers damage from your hooves (1d4 + Str modifier).\n* **Scent:** The target gains advantage on Wisdom (Perception) checks that rely on smell.\n\n##### Overrun\n\nWhen a creature tries to move through a hostile creature's space, the mover can try to force its way through by overrunning the hostile creature. As an action or a bonus action, the mover makes a Strength (Athletics) check contested by the hostile creature's Strength (Athletics) check. The creature attempting the overrun has advantage on this check if it is larger than the hostile creature, or disadvantage if it is smaller. if the mover wins the contest, it can move through the hostile creature's space once this turn.","modifyId":"SHAPESHIFT"},"ANTHROPOMORPHIC_GENOTYPE":{"id":"ANTHROPOMORPHIC_GENOTYPE","type":"GENOTYPE","name":"anthropomorphic (genotype)","text":"You grant the form of a humanoid creature with your shapeshift.  \n**Limbs:** 1 head, 2 arms with hands that can manipulate objects as a human’s can, 2 legs  \n**Speed:** 30-foot land speed.  \n**Natural weapons:** none  \n**AC:** 10 + Dexterity modifier (may benefit from armor)  \n**Special:** The target can speak and gains knowledge of one language you also speak. If the target’s Intelligence is lower than 6, it is increased to 6\\. The target counts as being of the humanoid type in addition to its normal type. You can choose to have the target count as being of a single humanoid race of your choice in addition to its base race.\n\nIf you so choose, you can forgo applying additional traits to the target to instead allow the target to retain its natural weapons, special abilities, and movement modes that were dependent on its previous form, in essence making the target a hybrid between a humanoid and its previous form.\n\nAnthropomorphic (genotype) offers the following traits, which you can apply to any form:\n\n* **Hands:** The target’s arms end in hands that can perform Dexterity checks as skillfully as any humanoid.\n* **Eyes:** The target gains a nose, eyes, and ears, with normal humanoid senses, even in a form that would normally prevent this.\n* **Gift of Speech:** The target may speak and supply verbal spell components normally, even if in a form that would normally prevent this.","modifyId":"SHAPESHIFT"},"AQUAN_GENOTYPE":{"id":"AQUAN_GENOTYPE","type":"GENOTYPE","name":"aquan (genotype)","text":"You grant the form of a swimming beast or monstrosity with your shapeshift.  \n**Limbs:** 1 head, fins, tail  \n**Speed:** 5-foot land speed, 20 foot swim speed. The swim speed increases by 20 feet at 5th level (40 feet), 11th level (60 feet), and 17th level (80 feet)  \n**Natural weapons:** bite \\[natural weapon\\] (1d6 piercing)  \n**AC:** 13 + Dexterity modifier  \n**Special:** Gain the amphibious ability (see below). The target counts as being of either the beast or monstrosity type (your choice) in addition to its normal type.\n\nAquan (genotype) offers the following traits, which you can apply to any form:\n\n* **Amphibious:** The target gains the ability to breathe both air and water.\n* **Ink Spray:** \\[Recharge 5-6\\]. The target may shoot a jet of ink. In water, this creates a 10-foot radius sphere that provides total concealment and persists for 1 minute. On land, this is a ranged attack with a 10/50 foot range that forces a struck creature to make a Dexterity saving throw or be blinded until they spend an action or two bonus actions removing the ink from their eyes.\n* **Jet:** \\[Recharge 4-6\\]. While swimming, the target can move at double its swim speed when using the dash action. It must move in a straight line while jetting, and does not provoke opportunity attacks when it does so. (Requires a swim speed)\n* **Keen Scent:** The target can notice other creatures by scent in a 180-ft. radius underwater and can detect blood in the water at ranges of up to a mile.\n* **Shock:** \\[Recharge 5-6\\]. As an action, the target may deal 1d8 lightning damage with a melee attack. This damage increases by 1d8 at 5th (2d8), 11th (3d8), and 17th (4d8) levels. If a creature successfully grapples the target, the target may use this ability as a reaction. If the target is in water, this ability instead functions as a 10-foot radius sphere centered on the target; affected creatures are allowed a Constitution saving throw for half damage. The target may exclude itself from this damage. Creatures beyond 10 feet but within a 30-foot radius take half this damage, with a Constitution saving throw for half damage.\n* **Swim:** A swim speed as that granted by the Aquan (genotype).\n* **Watersight:** The target can see clearly in water, preventing them from taking any penalty to Perception due to being underwater.","modifyId":"SHAPESHIFT"},"AVIAN_GENOTYPE":{"id":"AVIAN_GENOTYPE","type":"GENOTYPE","name":"avian (genotype)","text":"You grant the form of a flying beast or monstrosity with your shapeshift.  \n**Limbs:** 1 head, 2 legs, 2 wings  \n**Speed:** 20-foot land speed, 30-foot glide speed (you can move 30 feet in any direction, except up, but fall 1 foot for every 5 feet traveled). Your glide speed improves to a 20-foot fly speed at 5th level, and your fly speed increases by an additional 20 feet at 11th level (40 feet) and 17th level (60 feet).  \n**Natural weapons:** talons \\[natural weapon\\] (1d4 slashing)  \n**AC:** 12 + Dexterity modifier  \n**Special:** The target counts as being of either the beast or monstrosity type (your choice) in addition to its normal type.\n\nAvian (genotype) offers the following traits, which you can apply to any form:\n\n* **Beak:** \\[natural weapon\\] (requires head, 1d4 piercing).\n* **Flight:** (requires wings) gains the glide speed and fly speed as granted by Avian (genotype).\n* **Hover:** While flying, the target does not fall if knocked prone, has its speed reduced to 0, or is otherwise deprived of the ability to move.\n* **Talons:** \\[natural weapon\\] (requires legs) 1d4 slashing.\n* **Wings:** You gain a pair of wings. Unless something knocks you prone, you fall at a rate of 60 feet per round and do not suffer falling damage.\n* **Wing buffet:** \\[natural weapon\\] (requires wings, 1d4 bludgeoning).","modifyId":"SHAPESHIFT"},"BLANK_FORM_GENOTYPE":{"id":"BLANK_FORM_GENOTYPE","type":"GENOTYPE","name":"blank form (genotype)","text":"Unlike other (genotype) talents, the Blank Form does not change the creature’s base makeup. They do not lose their abilities, equipment, natural weapons, or any other aspect of their unaltered form. Ultimately, the Blank Form talent allows a caster to add traits to a creature without fundamentally changing the target first.\n\n* **Appearance:** You may change the target’s appearance to appear as something different. While you cannot change the target’s form, you have great control over cosmetic features; you could change a male into a female, an elf into an orc, alter the appearance of its clothing, change a large dog into a small pony, etc. Applying this trait gives the target advantage on any Deception check made to appear as whatever it is disguised as, and you can even use this trait to apply a disguise to appear as a specific individual. Using this trait lets you make a Disguise Kit check without needing a disguise, using your Key ability modifier. You can merge the target’s equipment into its form and replace it with disguised clothing, as if applying a different transformation as well.\n* **Bite:** \\[natural weapon\\] (requires head) 1d6 piercing.\n* **Claws:** \\[natural weapon\\] (requires arms) 1d4 slashing. You gain up to one claw per arm, and your claws are considered light finesse weapons.\n* **Darkvision:** The target gains darkvision to 60 feet: The target can see in dim light within 60 feet of it as if it were bright light, and in darkness as if it were dim light. The target can’t discern color in darkness, only shades of gray. You can grant this trait multiple times, each time it increases the range of the Darkvision by an additional 60 feet.\n* **Expert Disguise:** Add your proficiency modifier to a Disguise Kit check made with the Appearance trait. If you are already proficient, you may instead double your proficiency modifier. This may not benefit from multiple features, such as Expertise, that doubles your proficiency bonus.\n* **Natural Armor:** The target gains tough, scaly skin. The target’s AC becomes a minimum of 13 + its Dexterity modifier. A shield’s benefits apply as normal to natural armor.\n* **Retain Trait:** As a trait when applying a form other than Blank Form, you can choose one ability dependent on your target’s base shape (darkvision, keen scent, racial breath weapon, etc.). The target retains this ability despite being under the effects of your shapeshift. You can apply this trait more than once, selecting a different ability each time.","modifyId":"SHAPESHIFT"},"DRAGON_GENOTYPE":{"id":"DRAGON_GENOTYPE","type":"GENOTYPE","name":"dragon (genotype)","text":"You can grant the form of a dragon with your shapeshift.  \n**Limbs:** 1 head, 2 wings, 4 legs  \n**Speed:** 30-foot land speed  \n**Natural weapons:** bite \\[natural weapon\\] (1d6 piercing)  \n**AC:** 13 + Dexterity modifier  \n**Senses:** Darkvision 60 feet  \n**Special:** Gain a breath weapon as the trait (see below). The target counts as being of dragon type in addition to its normal type. Dragon forms are capable of speech and supplying verbal components.\n\nDragon (genotype) offers the following traits, which you can apply to any form:\n\n* **Breath Weapon:** \\[Recharge 5-6\\] A 60-foot line or a 30-foot cone, dealing 2d6 damage, dealing either acid, cold, fire, or lightning damage as chosen at the time it is gained. Affected creatures may make a Dexterity saving throw to reduce damage by half. A target may only possess one breath weapon at a time. The damage of the breath weapon increases by 1d6 at 5th level (3d6), 11th level (4d6), and 17th level (5d6).\n* **Widen Breath:** Double the size of a breath weapon (120-foot line or 60-foot cone) (must possess a breath weapon to gain this trait).\n* **Frightful Presence: (Augment 1 sp)** As an action, the target can create a 30-foot aura that emanates from them. All creatures that enter the aura must succeed on a Wisdom saving throw or be frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature’s saving throw is successful or the effect ends for it, the creature is immune to the spherecaster’s use of this ability until the caster completes a long rest.","modifyId":"SHAPESHIFT"},"ELEMENTAL_GENOTYPE":{"id":"ELEMENTAL_GENOTYPE","type":"GENOTYPE","name":"elemental (genotype)","text":"You can grant the form of an elemental with your shapeshift.  \n**Limbs:** mutable (the target has no limbs, and cannot gain limbs or natural attacks through traits. Limb-like shapes may be part of the form, but they confer no particular abilities)  \n**Speed:** 30-foot land speed  \n**Natural weapons:** slam \\[natural weapon\\] (1d6 bludgeoning)  \n**AC:** 13 + Dexterity modifier  \n**Immune:** prone  \n**Senses:** Darkvision 60 feet  \n**Special:** The target counts as being of the elemental type in addition to its normal type. The target gains one of the following packages depending on which elemental is being mimicked.\n\nYou can also grant the following trait to your forms:\n\n* **Elemental Resistance:** The target gains resistance to either acid, cold, fire, or lightning damage. This trait may be granted multiple times, selecting a different resistance each time.\n\n##### Air Package\n\nThe target gains resistance to lightning damage, and gains the ability to create a whirlwind (see below). The target may pass through and occupy other creature’s spaces and gains the float movement mode (see below).\n\n**Float:** The target may float up to 10 feet above the ground, with a 30-foot horizontal movement speed. When floating this way, the target may hover. When falling the target may choose to descend at a slower rate to control its fall and to negate all falling damage it would take. Each round it descends 30 feet, and may move in another direction for 30 feet. It may choose to drift sideways, gliding forwards while descending, or down, safely increasing its rate of descent. It may even choose to drift ‘upwards’ to reduce its rate of descent, even allowing it to negate it entirely and hover midair. At level 5, this speed becomes a 30 foot fly speed. This fly speed increases by 20 feet at 11th level (50 feet) and 17th level (70 feet).\n\n**Whirlwind:** (Recharge 4–6). As an action, the target creates a whirlwind in a 5-foot diameter centered on itself that remains until the start of their next turn. Other than the target, each creature in the area must make a Strength saving throw. On a failure, affected creatures take slam damage and are flung up to 5 feet away from the elemental in the direction of the target’s choice and knocked prone. If a thrown creature strikes an object, such as a wall or floor, they take 3 (1d6) bludgeoning damage for every 10 feet it was thrown. If the creature is thrown at another creature, that creature must succeed on a Dexterity saving throw against your sphere DC or take the same damage and be knocked prone. If the saving throw is successful, the creature takes no damage and isn’t flung away or knocked prone. The diameter of the whirlwind and the distance of the thrown creatures increases by 5 feet at 5th level (10-foot diameter, 10 feet thrown), 11th level (15-foot diameter, 15 feet thrown), and 17th level (20-foot diameter, 20 feet thrown).\n\n##### Earth Package\n\nThe target gains a 30-foot burrow speed and may burrow through solid rock, as well as resistance to acid damage.\n\n##### Fire Package\n\nThe target sheds bright light for 30 feet and dim light for 30 feet beyond. Its slam attack deals fire damage instead of bludgeoning damage, and creatures and flammable objects struck by its slam attack ignite on fire. Until a creature takes an action to douse the fire, the target takes 2 (1d4) fire damage at the start of each of its turns. The damage of the ignite effect improves by one step at 5th level (1d6), 11th level (1d8), and 17th level (1d10). The target gains resistance to fire damage.\n\n##### Water Package\n\nThe target may breathe water and gains a 30-foot Swim speed, which increases by 20 feet at 5th level (50 feet), 11th level (70 feet), and 17th level (90 feet). The target may pass through and occupy other creature’s spaces. The target also gains resistance to cold, as well as the whelm ability.\n\n**Whelm:** (Recharge 4–6). As an action, the target creates a vortex in a 5-foot diameter centered on itself that remains until the start of their next turn. Other than the target, each creature in the vortex must make a Strength saving throw against your sphere DC. Creatures that are not entirely in the vortex gain advantage on the saving throw. On a failure, affected creatures suffer the target’s slam damage. If it is no more than one size larger than the target, it is also Grappled (escape DC is your sphere DC). Until this grapple ends, the affected creature is Restrained and unable to breathe unless it can breathe water. If the saving throw is successful, the affected creature is pushed out of the vortex’s space.\n\nAnother creature who is outside the vortex but still within reach of a grappled creature inside the vortex can pull the creature out of it by taking an action to make a Strength check against your sphere DC and succeeding. The diameter of the vortex increases by 5 feet at 5th level (10-foot diameter), 11th level (15-foot diameter), and 17th level (20-foot diameter).","modifyId":"SHAPESHIFT"},"OBJECT_GENOTYPE":{"id":"OBJECT_GENOTYPE","type":"GENOTYPE","name":"object (genotype)","text":"You can grant the form of an object with your shapeshift.  \n**Limbs:** None  \n**Speed:** 20-foot land speed  \n**Natural weapons:** slam \\[natural weapon\\] (1d6 bludgeoning or other suitable to the form as determined by the GM. If the object mimicked is a weapon, the object is capable of wielding itself and deals damage and gains weapon properties as the mimicked weapon)  \n**AC:** 13 + Dexterity modifier  \n**Special:** Gain advantage on Dexterity (Stealth) or Charisma (Deception) checks that involve appearing as an object matching its form. The target has resistance to poison and psychic damage and counts as being of the construct type in addition to its normal type.\n\nThe target gains the appearance of a single simple object composed of plant matter such as cotton, hemp, or wood. You can take this talent twice. Upon taking it a second time, you can gain the ability to emulate other materials per the below table and to grant the form of complex objects. Complex objects, such as those with moving parts, require an appropriate ability check at the object’s craft DC. Failure means the target is not usable as an object. A creature under the effect of this talent does not truly become an object, thus is not a valid target for the Enhancement sphere Animate Object talent or similar effects. A creature that takes the form of a ranged weapon must be supplied with ammunition as normal, but is capable of loading and firing itself. A creature under the effects of this talent that is used as ammunition is not destroyed when used as ammunition, but takes damage equal to the damage dealt by the attack it was used for.\n\n| Caster’s Level | Material                           |\n| -------------- | ---------------------------------- |\n| 1st            | Ice, stone                         |\n| 5th            | Basic metals (iron, steel, copper) |\n| 11th           | Precious metals (gold, silver)     |\n| 17th           | Gems, specialty metals (mithril)   |\n\n**Special:** If you possess the create ability of the Creation sphere, you can forgo the normal limitations on what materials you can mimic with this ability, and instead mimic any material you are capable of making with create. If you choose this option, you cannot take this talent a second time.","modifyId":"SHAPESHIFT"},"OOZE_GENOTYPE":{"id":"OOZE_GENOTYPE","type":"GENOTYPE","name":"ooze (genotype)","text":"You can grant the form of an ooze or slime creature with your shapeshift.  \n**Limbs:** mutable (the target has no limbs, and cannot gain limbs or natural attacks through traits. Limb-like shapes may be part of the form, but they confer no particular abilities)  \n**Speed:** 20-foot land speed  \n**Natural weapons:** slam \\[natural weapon\\] (1d6 bludgeoning + 1d4 acid)  \n**AC:** AC 16 (not affected by Dexterity modifier)  \n**Immune:** prone.  \n**Senses:** blindsight 60 feet (blind beyond this radius).  \n**Special:** Fluid body (as the trait below). The target is blind (except for blindsight) and is immune to gaze attacks, visual effects, visual illusions, and other attack forms that rely on sight unless gaining eyes from another source. The target counts as being of the ooze type in addition to its normal type.\n\nThe target also gains one of the following packages depending on which ooze or slime is being mimicked:\n\n* **Amoeba, Giant:** The target gains a 20-foot swim speed, and the ability to breathe underwater.\n* **Gelatinous Cube:** The target is mostly transparent, granting advantage on Dexterity (Stealth) checks. It also gains resistance to lightning.\n* **Jelly:** The target gains a 20-foot climb speed and can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.\n* **Pudding:** A creature that touches the target or hits it with a melee attack while within 5 feet of it takes 4 (1d8) acid damage. Any nonmagical weapon made of metal or wood that hits the target corrodes. After dealing damage, the weapon takes a permanent and cumulative −1 penalty to damage rolls. If its penalty drops to −5, the weapon is destroyed. Nonmagical ammunition made of metal or wood that hits the target is destroyed after dealing damage.  \n   * **Augment 1 sp:** The target can eat through 2-inch thick, nonmagical wood or metal in 1 round.\n\nYou can add the following traits to your forms:\n\n* **Engulf:** As an action, the target moves up to its speed. While doing so, it can enter the spaces of creatures smaller than it is. Whenever entering a creature’s space, the creature must make a Dexterity saving throw. On a successful save, the creature can choose to be pushed 5 feet back or to the side of the target. A creature that chooses not to be pushed suffers the consequences of a failed saving throw. On a failed save, the target enters the creature’s space, and the creature takes slam damage and is engulfed. The engulfed creature can’t breathe, is restrained, and takes slam damage at the start of each of the target’s turns. When the target moves, the engulfed creature moves with it. An engulfed creature can try to escape by taking an action to make a Strength (Athletics) or Dexterity (Acrobatics) check contested by the target’s Strength (Athletics). On a success, the creature escapes and enters a space of its choice within 5 feet of the target. (Requires the form of an ooze or slime)\n* **Fluid Body:** The target can move through an area as small as one-quarter its space without squeezing or one-eighth its space when squeezing.","modifyId":"SHAPESHIFT"},"ORB_GENOTYPE":{"id":"ORB_GENOTYPE","type":"GENOTYPE","name":"orb (genotype)","text":"You can grant the form of a floating sphere, helmet, or similar shape with your shapeshift.  \n**Limbs:** 1 head  \n**Speed:** 5-foot land speed, 30-foot float as the Float trait.  \n**Natural weapons:** slam \\[natural weapon\\] (1d4 bludgeoning)  \n**AC:** 14 + Dexterity modifier  \n**Immune:** prone or beheading (unless limbs are added, such as through traits)  \n**Special:** The target counts as being of either the aberration, elemental, or plant type (your choice, others may be permitted by the GM) in addition to its normal type. A creature in the form of an orb counts as one size smaller for the purposes of squeezing into small places.\n\nOrb (genotype) offers the following trait, which you can apply to any form:\n\n* **Float:** The target may float up to 10 feet above the ground, with a 30-foot horizontal movement speed. When floating this way, the target may hover. When falling the target may choose to descend at a slower rate to control its fall and to negate all falling damage it would take. Each round it descends 30 feet, and may move in another direction for 30 feet. It may choose to drift sideways, gliding forwards while descending, or down, safely increasing its rate of descent. It may even choose to drift ‘upwards’ to reduce its rate of descent, even allowing it to negate it entirely and hover midair. At level 5, this speed becomes a 30 foot fly speed. This levitation and flight are magical abilities. This fly speed increases by 20 feet at 11th level (50 feet) and 17th level (70 feet).","modifyId":"SHAPESHIFT"},"PLANT_GENOTYPE":{"id":"PLANT_GENOTYPE","type":"GENOTYPE","name":"plant (genotype)","text":"You can grant the form of a plant creature with your shapeshift.  \n**Limbs:** 2 arms  \n**Speed:** 20-foot land speed  \n**Natural weapons:** slam \\[natural weapon\\] (1d6 bludgeoning)  \n**AC:** 15 + Dexterity modifier (+2 max)  \n**Senses:** Blindsight 30 ft.  \n**Special:** The target gains advantage on all Stealth checks made in dense foliage. The target counts as being of plant type in addition to its normal type.\n\nPlant (genotype) offers the following trait, which you can apply to any form:\n\n* **Bark:** You can grant the target the AC granted by Plant (genotype)","modifyId":"SHAPESHIFT"},"SERPENTINE_GENOTYPE":{"id":"SERPENTINE_GENOTYPE","type":"GENOTYPE","name":"serpentine (genotype)","text":"You can grant the form of a serpent with your shapeshift.  \n**Limbs:** 1 head  \n**Speed:** 40-foot land speed, 20-foot climb  \n**Natural weapons:** bite \\[natural weapon\\] (1d6 piercing)  \n**AC:** AC 13 + Dexterity  \n**Special:** The target counts as being of either the beast or monstrosity type (your choice) in addition to its normal type.\n\nIn addition, the target gains one of the following packages depending on which serpent is being mimicked:\n\n* **Constrictor:** The target gains the Constrict trait (see below) for its bite \\[natural weapon\\].\n* **Venomous:** When the target deals damage with a successful attack with its bite \\[natural weapon\\], it may attempt to poison the damaged creature. A damaged creature must succeed on a Constitution save or be poisoned for 1 minute, taking 3 (1d6) poison damage at the start of each of its turns for as long as it is poisoned. Creatures are permitted a new saving throw at the end of each of their turns to end the poisoned condition.\n\nSerpentine (genotype) offers the following traits, which you can apply to any form:\n\n* **Constrict:** Choose a \\[natural weapon\\] that the target possesses; the target may grapple using this \\[natural weapon\\] even without a free hand. When succeeding on an attack with that weapon, the target may attempt to grapple the attacked creature as a bonus action. Creatures grappled by the target are restrained until they escape the grapple. The target may only use this ability on a single creature at a time.\n* **Death Roll:** When the target has a creature grappled, it may attempt to shove the creature prone as a bonus action. It has advantage on this check.\n* **Strangle:** An opponent grappled by the target cannot speak or cast spells with verbal components.\n* **Swallow Whole:** The target may attempt a swallow attack against a creature it is grappling. If the attack hits, the creature is swallowed, and the grapple ends. The swallowed creature is blinded and restrained, it has total cover against attacks and other effects originating from outside the shapeshifted target, and it takes 1d6 acid damage at the start of each of the shapeshifted creature’s turns. The shapeshifted target may swallow targets up to one size smaller than themselves, and can have only one target swallowed at a time. The acid damage increases by 1d6 at 5th level (2d6), 11th level (3d6), and 17th level (4d6). The target may choose to harmlessly release a swallowed creature into the nearest available space as a bonus action. If a shapeshift ends while it still has a creature swallowed, the swallowed creature is released harmlessly. If the shapeshifted target dies, a swallowed creature is no longer restrained by it and can escape from the corpse using 5 feet of movement, exiting prone.","modifyId":"SHAPESHIFT"},"SUBTERRANEAN_GENOTYPE":{"id":"SUBTERRANEAN_GENOTYPE","type":"GENOTYPE","name":"subterranean (genotype)","text":"You can grant the form of a subterranean beast or monstrosity with your shapeshift.  \n**Limbs:** 1 head, 4 legs  \n**Speed:** 30-foot land speed, 15-foot burrow speed (the target can burrow through sand, dirt, or mud). The burrow speed increases by 15 feet at 5th level (30 feet), 11th level (45 feet), and 17th level (60 feet)  \n**Natural weapons:** bite \\[natural weapon\\] (1d6 piercing)  \n**AC:** AC 13 + Dexterity  \n**Special:** Darkvision 60 feet, Tremorsense 20 feet. The target counts as being of either the beast or monstrosity type (your choice) in addition to its normal type.\n\nSubterranean (genotype) offers the following traits, which you can apply to any form:\n\n* **Burrow:** A burrow speed as granted by the Subterranean form.\n* **Tremorsense:** Tremorsense in a 20-foot radius.","modifyId":"SHAPESHIFT"},"VERMIN_GENOTYPE":{"id":"VERMIN_GENOTYPE","type":"GENOTYPE","name":"vermin (genotype)","text":"You can grant the form of a spider, insect, or other such creature with your shapeshift.  \n**Limbs:** 1 head, 6 or 8 legs  \n**Speed:** 30-foot land speed, 30-foot climb speed. The target may climb on difficult surfaces, even upside down, without an ability check.  \n**Natural weapons:** bite \\[natural weapon\\] (1d6 piercing)  \n**AC:** 13 + Dexterity modifier  \n**Special:** Darkvision 60 feet. The target counts as being of either the beast or monstrosity type (your choice) in addition to its normal type. The target also gains either the poison or climb traits.\n\nVermin (genotype) offers the following traits, which you can apply to any form:.\n\n* **Climb:** A Climb speed, as that granted by the vermin form.\n* **Poison:** Choose one natural weapon. When the target deals damage with a successful attack with that natural weapon, it may attempt to poison the damaged creature. A damaged creature must succeed on a Constitution save or be poisoned for 1 minute, taking 3 (1d6) poison damage at the start of each of its turns for as long as it is poisoned. Creatures are permitted a new saving throw at the end of each of their turns to end the poisoned condition.\n* **Web:** \\[Recharge 6\\] As an action, the target may throw a web as a net with range 30/60, which is effective against targets up to 1 size larger than the target. The target is proficient in throwing its web. Creatures struck with the web are Restrained by webbing. As an action, the Restrained creature can make a Strength check against your Sphere DC, bursting the webbing on a success. The webbing can also be attacked and destroyed (AC 10; hp 5; vulnerability to fire damage; immunity to bludgeoning, poison, and psychic damage). A web can support up to twice the weight of the creating creature. The target ignores movement restrictions caused by webbing, and while in contact with a web, the target knows the exact location of any other creature in contact with the same web.","modifyId":"SHAPESHIFT"},"ABERRANT_BODY_TRAIT":{"id":"ABERRANT_BODY_TRAIT","type":"TRAIT","name":"aberrant body (trait)","text":"Aberrant Body offers the following traits, which you can apply to any form.\n\n* **Acid Spit:** \\[natural weapon\\] ranged weapon 20/60, 1d6 acid damage. A creature that is struck by this attack takes an additional 1d6 acid damage at the end of its next turn.\n* **Gibbering:** All creatures within 30 feet of the target have disadvantage on saving throws made to maintain concentration. This ability may be suppressed or resumed as a bonus action.\n* **Many Eyes:** The target gains advantage on vision-based Wisdom (Perception) checks. If using the optional flanking rules, the target cannot be flanked.\n* **Mucus:** \\[Recharge 5-6\\] As an action, the target gains the ability to release a mucus cloud with a radius of 5 feet, increasing by 5 feet at 5th (10 feet), 11th (15 feet), and 17th level (20 feet) that persists for 1 minute unless dispersed by a strong wind. Any creature that comes in contact with the cloud must make a Constitution saving throw or for 1 minute become unable to breathe air, but able to breathe underwater. Affected creatures may spend an action removing the mucus to end the effect on themselves early. A creature unable to breathe air that remains out of water begins to suffocate.\n* **Tendril:** \\[natural weapon\\] The target gains a tendril. This trait may be granted multiple times, granting one tendril per trait, and the target can attack with each tendril as part of the same attack, so long as each tendril targets a different creature. Each tendril can be attacked (AC 20; 10 hit points; immunity to poison and psychic damage). Destroying a tendril deals no damage to the target, which can extrude a replacement tendril on its next turn. A tendril can also be broken if a creature takes an action and succeeds on a Strength check against your sphere DC.  \n   * **Tendril:** Melee Weapon Attack, reach 50 ft., _Hit:_ The target is Grappled (escape DC equals your Sphere DC). Until the grapple ends, the target is Restrained and has disadvantage on Strength Checks and Strength Saving Throws, and the target can’t use the same tendril on another target. Creatures 2 or more sizes larger than the target are immune to the tendril. As a bonus action, the target can reel creatures caught in its tendrils 25 feet towards it.\n* **Tentacles:** \\[natural weapon\\] 1d4 bludgeoning damage and the reach weapon property.\n\nAdditionally, you can choose to have the target count as an aberration in addition to its normal type. This choice negates any additional types granted by (genotype) talents.","modifyId":"SHAPESHIFT"},"ADDITIONAL_LIMBS_TRAIT":{"id":"ADDITIONAL_LIMBS_TRAIT","type":"TRAIT","name":"additional limbs (trait)","text":"Additional Limbs offers the following traits, which you can apply to any form. You can grant each trait multiple times:\n\n* **Arms:** An extra arm, which can do all things a normal arm can for your form.\n* **Head:** A head. Creatures with two or more heads have advantage on saving throws against being blinded, deafened, stunned, and knocked unconscious.\n* **Legs:** A pair of legs. This grants a 20 foot land speed if the target didn’t possess one. If this is not the form’s first pair of legs, the target gains a +10 bonus to its land speed per additional pair of legs.\n* **Prehensile Tail:** A prehensile tail, which may be used to hold objects as if it were a hand, and retrieve objects from a belt or pouch once per round with no action.\n* **Stinging Tail:** \\[natural weapon\\] 1d4 piercing. If the target is grappling a creature, the target may attack it with this stinger as a bonus action.\n* **Powerful Tail:** \\[natural weapon\\] 1d4 bludgeoning. If the target attacks a creature with a weapon or unarmed strike other than this tail slap, it may attack a different creature within reach with this tail slap as a bonus action.","modifyId":"SHAPESHIFT"},"AGILE_BODY_TRAIT":{"id":"AGILE_BODY_TRAIT","type":"TRAIT","name":"agile body (trait)","text":"You can add the following additional traits to your forms:\n\n* **Evasive:** The target gains incredible reflexes. When the target is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw. If this trait is granted a second time, the target only takes half damage if it fails.\n* **Incredible Dodge:** Attackers that the target is not aware of or cannot see do not gain advantage on attack rolls made against the target.\n* **Initiative:** The target gains quickened reactions, granting advantage on Dexterity checks for initiative.\n\nAdditionally, you can apply the following augment to your shapeshift:\n\n**Augment 0 sp:** All of your natural weapons gain the finesse property.","modifyId":"SHAPESHIFT"},"BESTIAL_MIND_TRAIT":{"id":"BESTIAL_MIND_TRAIT","type":"TRAIT","name":"bestial mind (trait)","text":"Bestial Mind offers the following trait, which you can apply to any form:\n\n* **Bestial Mind:** In addition to the Constitution saving throw to resist the shapeshift, the target must succeed a Wisdom saving throw or have their mind become bestial. Their Intelligence is reduced to 2, and they are treated as a beast for skills such as Wisdom (Animal Handling) and spells such as speak with animals. They cannot use any spells and other abilities that require sentience, although they retain other aspects of their class levels such as proficiency bonuses and other abilities. The GM is the final arbiter on what abilities a creature under the effect of this trait may or may not use. This trait has no effect on creatures who already have an Intelligence score of 2 or less.\n\nAdditionally, you can choose to have the target count as a beast in addition to its normal type. This choice negates any additional types granted by (genotype) talents.","modifyId":"SHAPESHIFT"},"BESTIAL_REFLEXES_TRAIT":{"id":"BESTIAL_REFLEXES_TRAIT","type":"TRAIT","name":"bestial reflexes (trait)","text":"Bestial Reflexes offers the following traits, which you can apply to any form:\n\n* **Lunge:** As a bonus action, the target may double its natural reach for one melee attack made before the end of its turn.\n* **Multi-attack:** (Requires 5th level) When the target makes an Attack action, they may make one attack with each natural weapon they possess. This does not stack with Extra Attack.\n* **Pounce:** When the target uses its action to Dash, it can use a bonus action to make one melee weapon attack or to shove a creature.\n* **Trample:** As an action, the target may move overtop of all creatures smaller than itself this turn, dealing 1d6+Str modifier bludgeoning damage to any creatures it moves over. Creatures in the path of a trample can make attacks of opportunity against the target, but suffer disadvantage on the attacks and cannot dodge. If they instead choose to dodge, they may attempt a Dexterity saving throw for half damage. A trampling creature can only deal trampling damage to each creature once per round, no matter how many times it moves over that creature.","modifyId":"SHAPESHIFT"},"BESTIAL_SPIRIT_TRAIT":{"id":"BESTIAL_SPIRIT_TRAIT","type":"TRAIT","name":"bestial spirit (trait)","text":"Bestial Spirit offers the following traits, which you can apply to any form:\n\n* **Beast-tongue:** The target can speak with beasts.\n* **Ferocity:** The target gains advantage on death saves.\n* **Pack Tactics:** The target gains advantage on attack rolls against a creature if at least one of its allies is within 5 feet of the creature and isn’t incapacitated.\n* **Relentless:** If the target takes damage equal to or less than half its maximum hit points that would reduce it to 0 hit points, it is reduced to 1 hit point instead. Once a creature has used relentless, it may not use it again until it finishes a Short or Long Rest even if granted again by another shapeshift.\n* **Shove:** Choose one \\[natural weapon\\] the target possesses; once per round when dealing damage with that natural weapon as part of an action, the target may attempt to shove the damaged creature as a bonus action.","modifyId":"SHAPESHIFT"},"CONSTRUCT_TRAITS_TRAIT":{"id":"CONSTRUCT_TRAITS_TRAIT","type":"TRAIT","name":"construct traits (trait)","text":"You can add the following additional traits to your forms:\n\n* **Construct Plating: (Augment 2 sp)** The target gains resistance to bludgeoning, piercing, and slashing damage from non-magic weapons that are not made from adamantine.\n* **Metallic Blows:** The target’s natural weapons are treated as silver for the purpose of bypassing resistance. At 10th level, they also count as adamantine.\n* **Natural Armor:** The target gains a base AC of 16 (not affected by Dexterity modifier). The target gains no benefit from wearing armor, but if using a shield, it can apply the shield’s bonus as normal. This counts as wearing armor for gaining the benefits of the defense fighting style.\n* **Spell Resistance: (Augment 2 sp)** The target gains advantage on saving throws against magic.\n\nAdditionally, you can choose to have the target count as a construct in addition to its normal type. This choice negates any additional types granted by (genotype) talents.","modifyId":"SHAPESHIFT"},"EXTREME_ADAPTATION_TRAIT":{"id":"EXTREME_ADAPTATION_TRAIT","type":"TRAIT","name":"extreme adaptation (trait)","text":"You can add the following additional traits to your forms:\n\n* **Altitude Immunity:** The target is acclimated to living at high altitudes and is immune to negative effects of high altitude.\n* **Breathless: (Augment 1 sp)** The target may survive without air. The target becomes immune to effects that require breathing (such as inhaled poison), can survive underwater, or even in a vacuum (though does not provide protection from extreme cold or other conditions that may be encountered in such an environment). This does not give immunity to cloud or gas attacks that do not require breathing.\n* **Endure Weather:** The target suffers no harm from being in a hot or cold environment and can exist comfortably in conditions between -50 and 140 degrees Fahrenheit (-45 and 60 degrees Celsius) without having to make Constitution saving throws. The creature’s equipment is likewise protected. This trait doesn’t provide any protection from fire or cold damage, nor does it protect against other environmental hazards such as smoke, lack of air, and so forth.\n* **Pressure Immunity:** The target is immune to the pressures of the ocean and takes no damage nor suffers adverse effect from water pressure.","modifyId":"SHAPESHIFT"},"FEY_TRAITS_TRAIT":{"id":"FEY_TRAITS_TRAIT","type":"TRAIT","name":"fey traits (trait)","text":"You can also grant the following traits to your forms:\n\n* **Fey Skin: (Augment 2 sp)** The target gains resistance to bludgeoning, piercing and slashing damage from non-magic weapons that are not made from iron or cold iron.\n* **Wild Empathy:** The target may improve the initial attitude of a creature of the beast type within 30 feet using Charisma (Persuasion). The target has proficiency on this check. Typically domestic animals start as indifferent and wild animals start as unfriendly and the check takes 1 minute. This ability may be used to influence a monstrosity with an Intelligence score of 1 or 2, but the check suffers disadvantage.  \n   * **Augment 1 sp:** This check may be performed as an action and does not take disadvantage when influencing monstrosities.\n* **Woodland Stride:** The target may move through any sort of undergrowth (such as natural thorns, briars, overgrown areas, and similar terrain) at its normal speed without taking damage or suffering impairment. This has no effect on magically manipulated terrain.\n\nAdditionally, you can choose to have the target count as a fey in addition to its normal type. This choice negates any additional types granted by (genotype) talents.","modifyId":"SHAPESHIFT"},"GIANT_TRAITS_TRAIT":{"id":"GIANT_TRAITS_TRAIT","type":"TRAIT","name":"giant traits (trait)","text":"You can add the following additional traits to your forms:\n\n* **Rock Catching:** If a rock or similar object is hurled at the target, the target can, with a successful DC 10 Dexterity saving throw, catch the missile and take no bludgeoning damage from it.\n* **Rock Throwing:** The target may pick up and throw large rocks as a ranged attack (30/90, 2d6 bludgeoning). Additionally, you can choose to have the target count as a giant in addition to its normal type. This choice negates any additional types granted by (genotype) talents.","modifyId":"SHAPESHIFT"},"MORPHIC_WEAPON_TRAIT":{"id":"MORPHIC_WEAPON_TRAIT","type":"TRAIT","name":"morphic weapon (trait)","text":"You can add the following trait to your forms:\n\n* **Graft Weapon:** You fuse a weapon the target is wielding into one of the hands wielding it. Alternatively, you can transform one of the target’s arms into a weapon it is proficient with. Ranged weapons do not come with ammunition. A grafted weapon cannot be disarmed and is considered both a natural weapon and a manufactured weapon. The target loses other uses of this limb and might take disadvantage on some ability checks as a result.","modifyId":"SHAPESHIFT"},"ODIFEROUS_TRAIT":{"id":"ODIFEROUS_TRAIT","type":"TRAIT","name":"odiferous (trait)","text":"You can add the following additional traits to your forms:\n\n* **Inured:** The target gains advantage on saving throws against effects that inflict poison damage or the poisoned condition.\n* **Nauseating Spray:** \\[Recharge 6\\] As an action, the target may spray noxious chemicals in a 15-foot cone. Any creature in this cone must make a Constitution saving throw or be poisoned for 1 minute. Affected creatures may make a new save at the end of each of their turns to end the poisoned condition. The size of the cone increases by 5 feet at 5th (20 feet), 11th (25 feet) and 17th level (30 feet). A creature that succeeds on this saving throw is immune to any instance of it from the same caster for 24 hours.\n* **Stench:** The target secretes a stinking chemical offensive to most living things. Any creature adjacent to the target must make a Constitution saving throw or be poisoned until they are no longer adjacent. A creature that succeeds on this saving throw is immune to any instance of it from the same caster for 24 hours.","modifyId":"SHAPESHIFT"},"OUTSIDER_TRAITS_TRAIT":{"id":"OUTSIDER_TRAITS_TRAIT","type":"TRAIT","name":"outsider traits (trait)","text":"* **Celestial Resistance:** The target gains resistance to radiant damage and gains the celestial type in addition to its normal type. This negates any additional types granted by (genotype) talents.\n* **Demonic Resistance:** The target gains resistance to poison damage and gains the fiend type and demon tag in addition to its normal type. This negates any additional types granted by (genotype) talents.\n* **Devilish Resistance:** The target gains resistance to fire damage and gains the fiend type and devil tag in addition to its normal type. This negates any additional types granted by (genotype) talents.","modifyId":"SHAPESHIFT"},"PROTEAN_MASTERY_TRAIT":{"id":"PROTEAN_MASTERY_TRAIT","type":"TRAIT","name":"protean mastery (trait)","text":"You can add the following traits to your forms:\n\n* **Belated Shift: (Augment 1 sp)** If you leave one trait option unassigned, you can assign any valid trait you have access to to this slot at any time as a bonus action. The cost of this augment is incurred when this bonus action is taken. Once assigned, the trait persists for 1 minute and cannot be changed again until 1 minute after expiring. Only 1 trait may be assigned per bonus action with this ability, even if multiple traits are left unassigned. Each time a trait is assigned, the augment cost counts separately against the limit of how many spell points you can spend on the effect.  \n   * **Augment 1 sp:** The Belated Shift trait may be assigned as a reaction.\n* **Camouflage:** Your target may shift its coloration to mimic its environment, granting advantage on Dexterity (Stealth) checks.\n* **Lycanthropic Hide: (Augment 2 sp)** The target gains resistance to bludgeoning, piercing, and slashing damage that is from a nonmagical weapon that isn’t silver.\n\nAdditionally, you can choose to give the target the shapeshifter tag.","modifyId":"SHAPESHIFT"},"PRICKLY_TRAIT":{"id":"PRICKLY_TRAIT","type":"TRAIT","name":"prickly (trait)","text":"You can add the following traits to your forms:\n\n* **Spiky:** Your unarmed strikes and natural attacks deal an additional +1d4 piercing damage.\n* **Spines:** \\[natural weapon\\] 1d4 piercing. Creatures that attempt to grapple the target take 1d4 piercing damage.\n* **Spine Launch:** Your spines deal 1d6 damage instead of 1d4, and can be launched as a thrown weapon with a range of 20/60 feet. The spines regrow as they are thrown, granting you a virtually indefinite supply. (Requires spines)","modifyId":"SHAPESHIFT"},"SIZE_CHANGE_TRAIT":{"id":"SIZE_CHANGE_TRAIT","type":"TRAIT","name":"size change (trait)","text":"**Size Change: (Augment 1 sp)** As a trait, you can change a creature’s size. You can enlarge or reduce a creature’s size by one category, plus an additional size category at 5th (2 categories), 11th level (3 categories) and 17th level (4 categories).\n\nYou cannot enlarge beyond Huge size, nor reduce a creature beyond Tiny size. A target’s size and the size of its equipment doubles/is halved each category it moves up/down, and its weight is multiplied/divided by 8.\n\nWhen a creature is enlarged, it deals an additional 1d4 damage with weapon attacks and unarmed strikes and when it is reduced it deals 1d4 less damage with weapon attacks and unarmed strikes; this die size increases by one for every additional category, to 1d6 for two sizes, 1d8 for three sizes, and 1d10 for 4 sizes. You cannot reduce damage below 1\\. Reach is also adjusted according to the chart below:\n\n##### Table: Size and Reach\n\n| Size Category | Space      | Reach   |\n| ------------- | ---------- | ------- |\n| Tiny          | 2 1/2 feet | 0 feet  |\n| Small         | 5 feet     | 5 feet  |\n| Medium        | 5 feet     | 5 feet  |\n| Large         | 10 feet    | 10 feet |\n| Huge          | 15 feet    | 15 feet |","modifyId":"SHAPESHIFT"},"SWARM_BODY_TRAIT":{"id":"SWARM_BODY_TRAIT","type":"TRAIT","name":"swarm body (trait)","text":"You can add the following traits to your forms:\n\n* **Divided Self:** The target gains advantage on saving throws against effects that target individual creatures. (requires swarm form trait)\n* **Swarm Form:** The target takes the form of a swarm of creatures of its kind. The swarm is composed only of Tiny creatures; this size cannot be altered by the Size Change trait, enlarge person, or other effects. The target can move through holes and openings that are large enough for the individual creatures. The swarm fills a 10-foot square (or cube if flying) and has a reach of 0 and can occupy another creature’s space and vice versa. The target gains resistance to bludgeoning, piercing, and slashing damage and vulnerability to damaging effects that target an area.\n* **Swarming:** The target gains advantage on attacks against creatures that are entirely within its space. (requires swarm form trait)","modifyId":"SHAPESHIFT"},"TWISTED_BODY_TRAIT":{"id":"TWISTED_BODY_TRAIT","type":"TRAIT","name":"twisted body (trait)","text":"You can add the following traits to your forms:\n\n* **Flesh Pocket:** You rearrange internal organs and muscles to create a pocket inside the target’s body, usually in the abdomen. The opening to the pocket resembles a large scar. The pocket can hold creatures and objects up to two sizes smaller than the target. The target gains advantage on checks to conceal items in their flesh pocket.\n* **Seal Eyes:** The target must pass an additional Constitution saving throw or have its eyes sealed, blinding it.\n* **Twist Legs:** The target must pass an additional Constitution saving throw or have one movement speed reduced to 5 feet.\n* **Vocal Theft:** The target becomes unable to speak and may not supply vocal spell components or make ability checks that require singing or speaking.\n* **Wrench Stomach:** The target must pass an additional Constitution saving throw or take disadvantage on all attack rolls.\n\nAdditionally, you can apply the following augment to your shapeshift:\n\n**Augment 0 sp:** Your shapeshift may deal 1d8 slashing damage to all targets that fail their initial saving throw against the shapeshift. This damage increases by 1d8 at 5th level (2d8), 11th level (3d8) and 17th level (4d8).","modifyId":"SHAPESHIFT"},"UNDEAD_TRAITS_TRAIT":{"id":"UNDEAD_TRAITS_TRAIT","type":"TRAIT","name":"undead traits (trait)","text":"You can grant the following traits to your forms:\n\n* **Blood Drinker:** The target gains temporary hit points equal to the damage dealt with one natural weapon of your choice. (requires 10th level.)\n* **Incorporeal: (Augment 1 sp)** The target becomes incorporeal (requires 15th level). While incorporeal, it can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object.\n* **Undead Resistance:** The target gains advantage on saving throws against charmed, disease, poison, sleep, and stunning.\n\nAdditionally, you can choose to have the target count as an undead in addition to its normal type. This choice negates any additional types granted by (genotype) talents.","modifyId":"SHAPESHIFT"},"VITALITY_TRAIT":{"id":"VITALITY_TRAIT","type":"TRAIT","name":"vitality (trait)","text":"You can add the following traits to your forms:\n\n* **Glow of Health:** The target gains advantage on saves versus death effects, necrotic damage, poison, and disease.\n* **Sleepless:** The target gains immunity to magical sleep effects.\n\nAdditionally, you can apply the following augment to your shapeshift:\n\n**Augment 0 sp:** At the time the effect is cast, the recipient of your shapeshift may spend a single hit die to heal as if having taken a short rest.","modifyId":"SHAPESHIFT"}}