{"CHANGE_MATERIAL_ALTER":{"id":"CHANGE_MATERIAL_ALTER","type":"ALTER","name":"change material (alter)","text":"You can alter an object, changing its composition from one material to another. Both the material you are affecting and the material you are changing it into must be materials you can create (i.e., you must use the Expanded Materials talent to work with objects other than vegetable matter). When the duration expires, the object returns to its normal material, although any damage sustained while altered remains after it returns to its original material. You cannot change a liquid into a solid or a solid into a liquid, and you cannot create or affect gases.\n\n**Augment 1 sp:** The effect persists for the remaining duration without concentration. This augment may be applied after the effect is cast on your turn without an action.","modifyId":"ALTER"},"FORGE_ALTER":{"id":"FORGE_ALTER","type":"ALTER","name":"forge (alter)","text":"**Duration:** Instantaneous\n\n**Augment 1 sp:** You can shape material with a touch. This is an instantaneous effect, as you are literally changing the shape of the material in question. You can only affect materials you can create (i.e., you must use the Expanded Materials talent to work with materials other than vegetable matter), and you can only make crude changes such as forming walls, trenches, doors, coffers and other basic shapes. Detailed work (such as forging armor) is not possible, and there is a 30% chance that anything with moving parts simply doesn’t work. You can affect targets up to your normal creation size, but when working with a mineral (stone, metals, gems, etc.) the size you can affect is reduced by half.","modifyId":"ALTER"},"TRANSPARENCY_ALTER":{"id":"TRANSPARENCY_ALTER","type":"ALTER","name":"transparency (alter)","text":"You can convert any material into a more transparent version of itself.\n\nThis does not affect the object’s composition, damage threshold, or have any effect other than offer a clear view through the object.\n\nThe caster may choose to affect the object’s opacity in a way that allows peering through an object while remaining unobserved from the other side. When used in this way, Wisdom (Perception) checks through the object suffer disadvantage, but it requires a Wisdom (Perception) check against your sphere DC to notice that the object can now be seen through from the other side. If you possess Exquisite Detail, it no longer imposes disadvantage and the Wisdom (Perception) DC to notice that the object is transparent gains disadvantage.","modifyId":"ALTER"}}