{"FORM_BREAKING_BLAST_TYPE":{"id":"FORM_BREAKING_BLAST_TYPE","name":"form-breaking (blast type)","type":"BLAST_TYPE","text":"Your blast causes affected targets to have their body bend and twist in unhealthy ways, dislocating bones, pinching nerves, and tearing tendons.\n\nYour destructive blast deals bludgeoning damage. Any (blast shape) talent that allows a Dexterity saving throw instead allows a Strength saving throw. Any creature damaged by the blast has disadvantage on Strength (Athletics) and Dexterity (Acrobatics) checks until the start of your next turn.\n\n**Augment 1 sp:** Damaged creatures have disadvantage for 1 minute. Affected creatures are allowed a new saving throw to end the effect on themselves at the end of each of their turns.","modifyId":"DESTRUCTIVE_BLAST"},"POISON_BLAST_TYPE":{"id":"POISON_BLAST_TYPE","name":"poison (blast type)","type":"BLAST_TYPE","text":"A venom spews forth from your form, poisoning those it comes into contact with.\n\nYour destructive blast deals poison damage. Any (blast shape) talent that allows a Dexterity saving throw instead allows a Constitution saving throw. Any creature damaged by the blast is poisoned until the start of your next turn.\n\n**Augment 1 sp:** Damaged creatures are instead poisoned for 1 minute. Affected creatures are allowed a new saving throw to end the effect on themselves at the end of each of their turns.","modifyId":"DESTRUCTIVE_BLAST"},"RESTRAINING_BLAST_TYPE":{"id":"RESTRAINING_BLAST_TYPE","name":"restraining (blast type)","type":"BLAST_TYPE","text":"Limbs and tentacles reach through a hole in space, bludgeoning and grasping your target.\n\nYour destructive blast deals bludgeoning damage. Any blast shape talent that allows a Dexterity saving throw instead allows a Strength saving throw. Any creature damaged by the blast is grappled until the end of your next turn.","modifyId":"DESTRUCTIVE_BLAST"},"SPECTRAL_BLAST_TYPE":{"id":"SPECTRAL_BLAST_TYPE","name":"spectral (blast type)","type":"BLAST_TYPE","text":"Otherworldly summons solidify briefly to make a flanking attack before fading away into the aether.\n\nYour destructive blast deals slashing damage. Any creature damaged by the blast is treated as if there were always an non-incapacitated enemy within 5 feet of it until the start of your next turn.","modifyId":"DESTRUCTIVE_BLAST"},"CORROSIVE_BLAST_TYPE_ALTER_POWER":{"id":"CORROSIVE_BLAST_TYPE_ALTER_POWER","name":"corrosive (blast type) [alter power]","type":"BLAST_TYPE","text":"Deconstructive energies break apart and disintegrate slowly everything it touches.\n\nYour destructive blast deals acid damage. Any creature damaged by the blast takes additional acid damage equal to the number of damage dice rolled at the beginning of its next turn; This additional acid damage does not count as part of the destructive blast’s initial damage for the purpose of interacting with other feats or abilities that would increase its damage.\n\n**Augment 1 sp:** Acidic slime adheres to the ground underneath the target or the area of effect for 1 minute. Any creature that enters these squares takes acid damage equal to the number of damage dice rolled. A target can only be affected once per round.","modifyId":"DESTRUCTIVE_BLAST"},"PHYSICAL_BLAST_TYPE_CREATE_POWER":{"id":"PHYSICAL_BLAST_TYPE_CREATE_POWER","name":"physical (blast type) [create power]","type":"BLAST_TYPE","text":"You summon an object that flies at the target and strikes them before disappearing.\n\nEach time you apply this (blast type) talent, choose bludgeoning, piercing, or slashing. Your destructive blast deals damage of the chosen type. Your destructive blast doesn’t count as magic for effects that grant resistance, immunity, or other benefits against magic.\n\n**Augment 1 sp:** The object or objects break apart and remain for 1 minute, making the square or squares where the destructive blast affected difficult terrain for 1 minute.","modifyId":"DESTRUCTIVE_BLAST"},"BESHADOWED_BLAST_TYPE":{"id":"BESHADOWED_BLAST_TYPE","name":"beshadowed (blast type)","type":"BLAST_TYPE","text":"Shadows numb the nerves and dull the senses of enemy creatures.\n\nYour destructive blast deals cold damage. Any creature damaged by the blast treats all creatures as having half cover (+2 AC and Dexterity saving throws) and takes disadvantage on all Perception checks that rely on vision until the start of your next turn. Creatures with darkvision or the ability to see through magical darkness ignore this effect.\n\n**Augment 1 sp:** Creatures without darkvision are instead blinded for a number of rounds equal to your proficiency bonus. Creatures with darkvision treat all creatures as having half cover (+2 AC and Dexterity saving throws) for a number of rounds equal to your proficiency bonus. Creatures able to see through magical darkness suffer no penalty. A successful Wisdom saving throw reduces these durations to 1 round.","modifyId":"DESTRUCTIVE_BLAST"},"INK_BLAST_TYPE":{"id":"INK_BLAST_TYPE","name":"ink (blast type)","type":"BLAST_TYPE","text":"Dark energy lingers on those it touches.\n\nYour destructive blast deals necrotic damage. Any creature damaged by the blast has disadvantage on saves against effects of the Dark sphere until the end of your next turn. Any blast shape talent that allows a Dexterity saving throw instead allows a Wisdom saving throw.\n\n**Augment 1 sp:** The duration of the disadvantage increases to 1 minute.","modifyId":"DESTRUCTIVE_BLAST"},"DRAINING_BLAST_TYPE":{"id":"DRAINING_BLAST_TYPE","name":"draining (blast type)","type":"BLAST_TYPE","text":"Life drains away from the creature leaving the target an empty husk.\n\nYour destructive blast deals necrotic damage. Any creature damaged by the blast must succeed on a Constitution saving throw or have its exhaustion level increased by 1 for a number of rounds equal to your proficiency bonus. This does not stack with itself. Any (blast shape) talent that allows a Dexterity saving throw instead allows a Constitution saving throw.\n\n**Augment 2 sp:** Any creature damaged by the blast is no longer allowed a saving throw to avoid having its exhaustion level increased.","modifyId":"DESTRUCTIVE_BLAST"},"NECROTIC_BLAST_TYPE":{"id":"NECROTIC_BLAST_TYPE","name":"necrotic (blast type)","type":"BLAST_TYPE","text":"Negative energy saturates the target making them susceptible to death magic.\n\nYour destructive blast deals necrotic damage. Any creature damaged by the blast has disadvantage on saves against effects of the Necromancy school and Death sphere until the end of your next turn. Any blast shape talent that allows a Dexterity saving throw instead allows a Constitution saving throw.\n\n**Augment 1 sp:** The duration of the disadvantage increases to 1 minute.","modifyId":"DESTRUCTIVE_BLAST"},"PSIONIC_BLAST_TYPE":{"id":"PSIONIC_BLAST_TYPE","name":"psionic (blast type)","type":"BLAST_TYPE","text":"Surface thoughts are ripped from the target, and momentarily flashed into your mind, granting insight into their future attacks.\n\nYour destructive blast deals psychic damage. Any creature damaged by the blast has disadvantage on attack rolls made against you until the end of your next turn. Any blast shape talent that allows a Dexterity saving throw instead allows an Intelligence saving throw.\n\n**Augment 1 sp:** You also have advantage on saving throws made against creatures damaged by the blast.","modifyId":"DESTRUCTIVE_BLAST"},"PSYCHIC_DELUGE_BLAST_TYPE":{"id":"PSYCHIC_DELUGE_BLAST_TYPE","name":"psychic deluge (blast type)","type":"BLAST_TYPE","text":"Sensory information overloads the target’s mind, resulting in inaction.\n\nYour destructive blast deals psychic damage. Any creature damaged by the blast must make an Intelligence saving throw or else for 1 round on its turn it can use either an action or a bonus action, not both. Any blast shape talent that allows a Dexterity saving throw instead allows an Intelligence saving throw.\n\n**Augment 1 sp:** The duration that a damaged creature must choose to use an action or bonus action increases to 1 minute. Affected creatures are allowed a new saving throw to end the effect on themselves at the end of their turn.","modifyId":"DESTRUCTIVE_BLAST"},"DEGRADING_BLAST_TYPE":{"id":"DEGRADING_BLAST_TYPE","name":"degrading (blast type)","type":"BLAST_TYPE","text":"The fortitude of the creature weakens, making it more susceptible to your ally’s attacks.\n\nYour destructive blast deals force damage. Any creature damaged by the blast has all attacks made against it treated as magical until the start of your next turn.\n\n**Augment 1 sp:** Damaged creatures must succeed on a Constitution saving throw or not benefit from regeneration until the start of your next turn.","modifyId":"DESTRUCTIVE_BLAST"},"HINDERING_BLAST_TYPE":{"id":"HINDERING_BLAST_TYPE","name":"hindering (blast type)","type":"BLAST_TYPE","text":"The limbs and muscles of the creature atrophy, making movement difficult.\n\nYour destructive blast deals necrotic damage. Any creature damaged by the blast has its move speed reduced by 10 feet (to a minimum of 5 feet) for 1 minute. Multiple applications of this penalty stack.\n\n**Augment 1 sp:** Choose one ability score; damaged creatures must succeed on a Constitution saving throw or take disadvantage on ability checks of the chosen type for 1 minute.","modifyId":"DESTRUCTIVE_BLAST"},"CURSED_BLAST_TYPE_CURSE":{"id":"CURSED_BLAST_TYPE_CURSE","name":"cursed (blast type) [curse]","type":"BLAST_TYPE","text":"Cosmic energy tug at the destiny and fate of those it touches.\n\nYour destructive blast deals necrotic damage. Any creature damaged by the blast has disadvantage on its next ability check or saving throw made before the end of your next turn.\n\n**Augment 1 sp:** The disadvantage applies to all attack rolls, ability checks, and saving throws made before the end of your next turn.","modifyId":"DESTRUCTIVE_BLAST"},"TRIBUNAL_BLAST_TYPE_CURSE":{"id":"TRIBUNAL_BLAST_TYPE_CURSE","name":"tribunal (blast type) [curse]","type":"BLAST_TYPE","text":"Judgement is pronounced upon those targeted by your blast.\n\nYour destructive blast deals radiant damage. Any creature damaged by the blast has disadvantage on saves against effects of the Fate sphere until the end of your next turn. Any blast shape talent that allows a Dexterity saving throw instead allows a Charisma saving throw.\n\n**Augment 1 sp:** The duration of the disadvantage increases to 1 minute.","modifyId":"DESTRUCTIVE_BLAST"},"BEWILDERING_BLAST_TYPE":{"id":"BEWILDERING_BLAST_TYPE","name":"bewildering (blast type)","type":"BLAST_TYPE","text":"Illusionary destructive elements lash out causing psychosomatic burns, bruises, and cuts.\n\nYour destructive blast deals psychic damage. Any creature damaged by the blast has disadvantage on saves against effects of the Illusion school and Illusion sphere until the end of your next turn. Any blast shape talent that allows a Dexterity saving throw instead allows a Intelligence saving throw.\n\n**Augment 1 sp:** The duration of the disadvantage increases to 1 minute.","modifyId":"DESTRUCTIVE_BLAST"},"SHADOW_BLAST_TYPE":{"id":"SHADOW_BLAST_TYPE","name":"shadow (blast type)","type":"BLAST_TYPE","text":"Shadowstuff is blended into your blast, giving your illusion substance. Each time you apply this (blast type) talent, choose a damage type. Your destructive blast deals damage of the chosen type, but it deals half damage. Any blast shape talent that allows a Dexterity saving throw instead allows a Intelligence saving throw.\n\n**Augment 1 sp:** Your destructive blast deals normal damage instead of half damage.","modifyId":"DESTRUCTIVE_BLAST"},"INVIGORATING_BLAST_TYPE":{"id":"INVIGORATING_BLAST_TYPE","name":"invigorating (blast type)","type":"BLAST_TYPE","text":"Healing energy is drawn inward toward you as radiant energy burns your foes.\n\nYour destructive blast deals radiant damage. Whenever you damage creatures with your blast, you gain temporary hit points equal to the number of damage dice rolled that last until the beginning of your next turn.\n\n**Augment 1 sp:** The temporary hit points last for 1 minute.\n\n**Augment 1 sp:** Instead of gaining temporary hit points, you regain hit points.","modifyId":"DESTRUCTIVE_BLAST"},"VIVACITY_BLAST_TYPE":{"id":"VIVACITY_BLAST_TYPE","name":"vivacity (blast type)","type":"BLAST_TYPE","text":"Positive energy pulses out, burning the flesh of those it touches. Your destructive blast deals radiant damage. You have advantage on any attack rolls made as part of the destructive blast if the target is undead. Undead have disadvantage on any saving throws made against your destructive blast. Any blast shape talent that allows a Dexterity saving throw instead allows a Wisdom saving throw.\n\n**Augment 1 sp:** Undead creatures that take damage must succeed a Wisdom saving throw or be turned until the start of your next turn. A turned creature must spend its turns trying to move as far away from you as it can, and it can’t willingly move to a space within 30 feet of you. It also can’t take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there’s nowhere to move, the creature can use the Dodge action.","modifyId":"DESTRUCTIVE_BLAST"},"ILLUMINATING_BLAST_TYPE":{"id":"ILLUMINATING_BLAST_TYPE","name":"illuminating (blast type)","type":"BLAST_TYPE","text":"Luminescent energy clings to those it touches, revealing their movement.\n\nYour destructive blast deals radiant damage. Any creature damaged by the blast gains disadvantage on all Stealth checks and is made visible in dim light or only lightly obscured in darkness. These effects last until the start of your next turn.\n\n**Augment 1 sp:** Creatures that take damage are made visible in areas of darkness, instead of just lightly obscured.","modifyId":"DESTRUCTIVE_BLAST"},"RADIANT_BLAST_TYPE":{"id":"RADIANT_BLAST_TYPE","name":"radiant (blast type)","type":"BLAST_TYPE","text":"Blinding light makes your enemies’ attacks less effective.\n\nYour destructive blast deals radiant damage. Choose one creature damaged by your destructive blast. That creature has disadvantage on all attack rolls made before the end of your next turn.\n\n**Augment 1 sp:** The creature is instead blinded until the end of your next turn.","modifyId":"DESTRUCTIVE_BLAST"},"CHARMING_BLAST_TYPE":{"id":"CHARMING_BLAST_TYPE","name":"charming (blast type)","type":"BLAST_TYPE","text":"Invasive psychic energy fills the creature’s mind and heart with the power of friendship.\n\nYour destructive blast deals psychic damage. Any creature damaged by the blast must make a Charisma saving throw or be charmed until the start of your next turn. A creature charmed by this blast receives a new saving throw to end the condition any time they take damage. Any blast shape talent that allows a Dexterity saving throw instead allows a Charisma saving throw.\n\n**Augment 1 sp:** Creatures that fail their saving throw are instead charmed for 1 minute. Affected creatures are allowed a new saving throw to end the effect on themselves at the end of their turn.","modifyId":"DESTRUCTIVE_BLAST"},"FRIGHTFUL_BLAST_TYPE":{"id":"FRIGHTFUL_BLAST_TYPE","name":"frightful (blast type)","type":"BLAST_TYPE","text":"Doubt and insecurity consume the creature, leaving them in a state of dread.\n\nYour destructive blast deals psychic damage. Any creature damaged by the blast must make a Wisdom saving throw or be frightened until the start of your next turn. Any blast shape talent that allows a Dexterity saving throw instead allows a Wisdom saving throw.\n\n**Augment 1 sp:** Creatures that fail their saving throw are instead frightened for 1 minute. Affected creatures are allowed a new saving throw to end the effect on themselves at the end of their turn.","modifyId":"DESTRUCTIVE_BLAST"},"BLUDGEONING_BLAST_TYPE_EARTH_GEOMANCING":{"id":"BLUDGEONING_BLAST_TYPE_EARTH_GEOMANCING","name":"bludgeoning (blast type) [earth geomancing]","type":"BLAST_TYPE","text":"Earth bludgeons and bombards the creature, pushing them away from the blast.\n\nYour destructive blast deals bludgeoning damage. Any creature damaged by the blast is pushed 5 feet from the point of origin of the effect (usually yourself). This movement does not provoke opportunity attacks. Any blast shape talent that allows a Dexterity saving throw instead allows a Strength saving throw. If the target is knocked into another creature or a solid object, the target and creature or solid object suffer 1d6 bludgeoning damage, + 1d6 for every 10 feet the target would have continued past the barrier.\n\n_Note:_ If using a talent such as the Explosive Orb (blast shape), the point of origin would be the center of the blast. if using the Wall (blast shape), each square of the wall is considered the center of effect for those who enter that section. If using Guided Strike, you can choose from which direction you want to push the target, even pushing them up or down if you should desire. Pushing a target into the ground knocks them prone.\n\n**Draw on nature (Augment 0 sp):** If there is a 5-foot cube (or equivalent volume) of dirt, sand, or stone within your destructive blast range, you can choose to have your destructive blast not count as magic for the purpose of affecting creatures with a bonus against, or resistance or immunity to, magic. You can use the augment granted by the Create Nature talent of the Nature sphere as part of casting to apply this augment.\n\n**Augment 1 sp:** The distance creatures are pushed increases by up to 20 feet.","modifyId":"DESTRUCTIVE_BLAST"},"BRAMBLE_BLAST_TYPE_PLANT_GEOMANCING":{"id":"BRAMBLE_BLAST_TYPE_PLANT_GEOMANCING","name":"bramble (blast type) [plant geomancing]","type":"BLAST_TYPE","text":"Thorny vines writhe and entangling anything it touches, holding them in place.\n\nYour destructive blast deals piercing damage. Any creature damaged by the blast must succeed on a Dexterity saving throw or be grappled. This condition lasts until the creature succeeds on a new Dexterity saving throw made as an action or until the bramble is destroyed. Each 5-foot square of bramble has 3 hit points per level of the caster and an AC of 10\\. The bramble disappears when destroyed or after the creature escapes.\n\nAn affected creature whose space has been at least half cleared of the bramble has advantage on their saving throws to escape and may attempt them as a bonus action.\n\n**Draw on nature (Augment 0 sp):** If there is a 10-foot radius of plantlife within your destructive blast range, you can choose to have your destructive blast not count as magic for the purpose of affecting creatures with a bonus against, or resistance or immunity to magic. You can use the augment granted by the Create Nature talent of the Nature sphere as part of casting to apply this augment.\n\n**Augment 1 sp:** Creatures that fail their saving throw are instead restrained.","modifyId":"DESTRUCTIVE_BLAST"},"DROWNING_BLAST_TYPE_WATER_GEOMANCING":{"id":"DROWNING_BLAST_TYPE_WATER_GEOMANCING","name":"drowning (blast type) [water geomancing]","type":"BLAST_TYPE","text":"Bone chilling ice water soaks the target of your blast.\n\nYour destructive blast deals cold damage. Any creature damaged by the blast has disadvantage on saves against effects of the water package of the Nature sphere and is considered wet until the end of your next turn. In addition, any area or space that your blast touches is considered doused for the purpose of extinguishing open flames. Any blast shape talent that allows a Dexterity saving throw instead allows a Constitution saving throw.\n\n**Draw on nature (Augment 0 sp):** If there is a 5-foot cube of water (or equivalent volume) within your destructive blast range, you can choose to have your destructive blast not count as magic for the purpose of affecting creatures with a bonus against, or resistance or immunity to magic. You can use the augment granted by the Create Nature talent of the Nature sphere as part of casting to apply this augment.\n\n**Augment 1 sp:** The duration of the disadvantage increases to 1 minute.","modifyId":"DESTRUCTIVE_BLAST"},"FIRE_BLAST_TYPE_FIRE_GEOMANCING":{"id":"FIRE_BLAST_TYPE_FIRE_GEOMANCING","name":"fire (blast type) [fire geomancing]","type":"BLAST_TYPE","text":"Flames linger as they suffer from the smoldering embers of your blast.\n\nYour destructive blast deals fire damage. Any creature damaged by the blast must succeed on a Dexterity saving throw or catch fire, taking 1d8 fire damage per round at the end of its turn until the flames are extinguished. The fire damage from being on fire increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8). Being on fire does not count as part of the destructive blast’s initial damage for the purpose of interacting with other feats or abilities that would increase its damage. Creatures may attempt a Dexterity saving throw to extinguish the flames at the end of each of their turns before the damage is incurred. Using an action to roll on the ground or to use a blanket to smother the flames automatically extinguishes the flame.\n\n**Draw on nature (Augment 0 sp):** If there is a fire of at least medium size within your destructive blast range, you can choose to have your destructive blast not count as magic for the purpose of affecting creatures with a bonus against, or resistance or immunity to magic. You can use the augment granted by the Create Nature talent of the Nature sphere as part of casting to apply this augment.\n\n**Augment 1 sp:** Creatures that are on fire are frightened until the flames are extinguished.","modifyId":"DESTRUCTIVE_BLAST"},"RAZOR_WIND_BLAST_TYPE_AIR_GEOMANCING":{"id":"RAZOR_WIND_BLAST_TYPE_AIR_GEOMANCING","name":"razor wind (blast type) [air geomancing]","type":"BLAST_TYPE","text":"Sharp winds cut away at the defenses of anything in its path. Your destructive blast deals slashing damage. Any creature damaged by the blast is imposed with a -1 penalty to AC until the end of your next round. Multiple applications of this penalty stack. Any blast shape talent that allows a Dexterity saving throw instead allows a Constitution saving throw.\n\n**Draw on nature (Augment 0 sp):** If there is a 5-foot cube of air (or equivalent volume) within your destructive blast range, you can choose to have your destructive blast not count as magic for the purpose of affecting creatures with a bonus against, or resistance or immunity to magic. You can use the augment granted by the Create Nature talent of the Nature sphere as part of casting to apply this augment.\n\n**Augment 1 sp:** The penalty to AC lasts for 1 minute.","modifyId":"DESTRUCTIVE_BLAST"},"SHRAPNEL_BLAST_TYPE_METAL_GEOMANCING":{"id":"SHRAPNEL_BLAST_TYPE_METAL_GEOMANCING","name":"shrapnel (blast type) [metal geomancing]","type":"BLAST_TYPE","text":"Armor piercing shrapnel litter the area, leaving behind caltrops in the wake of your blast.\n\nYour destructive blast deals piercing damage. All affected squares (or squares directly below the affected area) become covered in caltrops until the end of your next turn. These caltrops use your Destruction sphere DC and deal damage equal to the number of damage dice of your destructive blast.\n\n**Draw on nature (Augment 0 sp):** If there is a 5-foot cube (or equivalent volume) of metal within your destructive blast range, you can choose to have your destructive blast not count as magic for the purpose of affecting creatures with a bonus against, or resistance or immunity to magic. You can use the augment granted by the Create Nature talent of the Nature sphere as part of casting to apply this augment.\n\n**Augment 1 sp:** The caltrops remain for 1 minute. Creatures moving through the affected area are subject to the Dexterity saving throw regardless of speed.\n\n**_Caltrops:_** As an action, you can spread a bag of caltrops to cover a square area that is 5 feet on a side. Any creature that enters the area must succeed on a DC 15 Dexterity saving throw or stop moving this turn and take 1 piercing damage. Taking this damage reduces the creature's walking speed by 10 feet until the creature regains at least 1 hit point. A creature moving through the area at half speed doesn't need to make the save.","modifyId":"DESTRUCTIVE_BLAST"},"CONFINING_BLAST_TYPE":{"id":"CONFINING_BLAST_TYPE","name":"confining (blast type)","type":"BLAST_TYPE","text":"A weak barrier forms around those hit, impeding any movement towards you.\n\nYour destructive blast deals force damage. Any creature damaged by the blast must succeed on a Strength saving throw or be unable to move any closer to you until the start of your next turn.\n\n**Augment 1 sp:** Affected creatures also take additional force damage equal to the number of damage dice rolled if they willingly move from their current space before the start of your next turn.","modifyId":"DESTRUCTIVE_BLAST"},"WARDING_BLAST_TYPE":{"id":"WARDING_BLAST_TYPE","name":"warding (blast type)","type":"BLAST_TYPE","text":"A weak barrier forms around those hit, impeding their next attack against you.\n\nYour destructive blast deals bludgeoning damage. Choose a creature you damaged with your blast. You gain resistance to the first damaging attack or effect that creature makes that affects you before the start of your next turn.\n\n**Augment 1 sp:** You may choose up to a number of damaged creatures equal to your proficiency bonus.","modifyId":"DESTRUCTIVE_BLAST"},"GRAVITY_BLAST_TYPE":{"id":"GRAVITY_BLAST_TYPE","name":"gravity (blast type)","type":"BLAST_TYPE","text":"A mass of dense energy surrounds those it touches, shifting gravity to pull in attacks toward it.\n\nYour destructive blast deals force damage. Choose a creature you damaged with your blast. Other creatures have advantage on attack rolls made against that creature until the start of your next round.\n\n**Augment 1 sp:** Any creature damaged by the blast has disadvantage on saves against effects of the Telekinesis sphere until the end of your next round.","modifyId":"DESTRUCTIVE_BLAST"},"KINETIC_BLAST_TYPE":{"id":"KINETIC_BLAST_TYPE","name":"kinetic (blast type)","type":"BLAST_TYPE","text":"Telekinetic force knocks your foes off balance.\n\nYour destructive blast deals force damage. Any creature damaged by the blast must succeed on a Strength saving throw or become prone.\n\n**Augment 1 sp:** For 1 minute, any creature made prone by the blast cannot stand up without first succeeding on a Strength saving throw made as an action or bonus action. A successful saving throw ends this effect.","modifyId":"DESTRUCTIVE_BLAST"},"ENTROPIC_BLAST_TYPE":{"id":"ENTROPIC_BLAST_TYPE","name":"entropic (blast type)","type":"BLAST_TYPE","text":"Creatures suffer the pains and disadvantages of age. Your destructive blast deals necrotic damage. Any creature damaged by the blast must make a Constitution saving throw or suffer disadvantage on physical saving throws (Strength, Dexterity, Constitution) for 1 round. Any blast shape talent that allows a Dexterity saving throw instead allows a Constitution saving throw. Creatures who explicitly do not suffer ill effects from aging are immune to this effect.\n\n**Augment 1 sp:** Creatures that fail their saving throw, suffer disadvantage on all saving throws, not just physical.","modifyId":"DESTRUCTIVE_BLAST"},"SLOWING_BLAST_TYPE":{"id":"SLOWING_BLAST_TYPE","name":"slowing (blast type)","type":"BLAST_TYPE","text":"Temporal energy envelopes the creature, slowing down its actions. Your destructive blast deals force damage. Any creature damaged by the blast must make a Wisdom saving throw or else for 1 round on its turn it can use either an action or a bonus action, not both. Any blast shape talent that allows a Dexterity saving throw instead allows a Wisdom saving throw.\n\n**Augment 1 sp:** Creatures that fail their saving throw are instead stunned for 1 round.","modifyId":"DESTRUCTIVE_BLAST"},"CHROMATIC_BLAST_TYPE_WILD_MAGIC":{"id":"CHROMATIC_BLAST_TYPE_WILD_MAGIC","name":"chromatic (blast type) [wild magic]","type":"BLAST_TYPE","text":"You conjure prismatic energy that is continuously in flux, producing a random effect every time the blast is used.\n\nRoll a d6\\. Your destructive blast deals a type of damage corresponding to the die roll: 1 - acid, 2 - cold, 3 - fire, 4 - lightning, 5 - poison, 6 - thunder. You can choose to roll on the Cantrips: Wild Magic table and apply the result’s effects in addition to the blast.\n\n**Augment 1 sp:** The corresponding die roll is now as follows: 1 - force, 2 - necrotic, 3 - psychic, 4 - radiant, 5 or 6 - your choice of acid, bludgeoning, cold, fire, lightning, piercing, poison, slashing, or thunder.\n\n**Augment 1 sp:** You can choose to roll on the General: Wild Magic table, instead of the Cantrips: Wild Magic table.","modifyId":"DESTRUCTIVE_BLAST"},"DISRUPTING_BLAST_TYPE_DISPEL":{"id":"DISRUPTING_BLAST_TYPE_DISPEL","name":"disrupting (blast type) [dispel]","type":"BLAST_TYPE","text":"Disruptive energy surrounds and distracts those that use magic.\n\nYour destructive blast deals force damage. Creatures damaged by your blast suffer disadvantage on all concentration checks until the start of your next turn.\n\n**Augment 1 sp:** Until the start of your next turn, creatures damaged by your blast must make a concentration check to use any spell or magical effect.","modifyId":"DESTRUCTIVE_BLAST"},"SIPHONING_BLAST_TYPE_MANA":{"id":"SIPHONING_BLAST_TYPE_MANA","name":"siphoning (blast type) [mana]","type":"BLAST_TYPE","text":"Magical energy is siphoned from a creature and into yourself. Your destructive blast deals psychic damage. If your destructive blast successfully deals damage to one or more spellcasters, spherecasters, or creatures with innate spellcasting or psionics, you gain a temporary spell point. If the final spell point cost of your destructive blast is 1 or more spell points, you gain a temporary spell point whenever you damage one or more creatures with your destructive blast. You cannot gain more than 1 spell point from any destructive blast, and if you strike targets with multiple Siphoning destructive blasts in the same round, you cannot gain more temporary spell points this way in a single round than half your proficiency bonus. All temporary spell points gained through this blast type disappear at the start of your next turn.","modifyId":"DESTRUCTIVE_BLAST"},"DISMISSING_BLAST_TYPE":{"id":"DISMISSING_BLAST_TYPE","name":"dismissing (blast type)","type":"BLAST_TYPE","text":"Anti-planar energy punishes those not native to the current plane.\n\nYour destructive blast deals force damage. You have advantage on any attack rolls made as part of the destructive blast if the target is conjured or summoned (such as with the Conjuration sphere or a spell from the Conjuration school). Conjured or summoned creatures have disadvantage on any saving throws made against your destructive blast. Any blast shape talent that allows a Dexterity saving throw instead allows a Charisma saving throw.\n\n**Augment 1 sp:** Dismissing works on any target that is not on their native plane, not just summoned or conjured creatures.\n\n**Augment 4 sp:** Damaged conjured or summoned creatures (or any target that is not on their native plane if augmented with 1 sp), must succeed a Charisma saving throw or be banished, returning to their home plane.","modifyId":"DESTRUCTIVE_BLAST"},"TELEPORTING_BLAST_TYPE":{"id":"TELEPORTING_BLAST_TYPE","name":"teleporting (blast type)","type":"BLAST_TYPE","text":"Space warps around those that come into contact with your blast, brutally teleporting them to a nearby location.\n\nYour destructive blast deals force damage. Any creature damaged by the blast must pass a Wisdom saving throw or be teleported 5 feet in the direction of your choosing, but must end their movement on a surface capable of supporting them and may not be moved into solid objects or intrinsically dangerous spaces.\n\n**Augment 1 sp:** The teleportation distance increases to up to 20 feet.","modifyId":"DESTRUCTIVE_BLAST"},"GALE_BLAST_TYPE":{"id":"GALE_BLAST_TYPE","name":"gale (blast type)","type":"BLAST_TYPE","text":"Powerful winds howl at your target, leaving them vulnerable to other wind effects.\n\nYour destructive blast deals thunder damage. Any creature damaged by the blast has disadvantage on saves against effects of the air package of the Nature sphere and (wind) talents of the Weather sphere until the end of your next turn. Any blast shape talent that allows a Dexterity saving throw instead allows a Constitution saving throw.\n\n**Draw on nature (Augment 0 sp):** If you are within an area of wind severity of 1 or higher, or if there is a 5-foot cube of air (or equivalent volume) within your destructive blast range, you can choose to have your destructive blast not count as magic for the purpose of affecting creatures with a bonus against, or resistance or immunity to magic. You can use the augment granted by the Create Nature talent of the Nature sphere as part of casting to apply this augment.\n\n**Augment 1 sp:** The duration of the disadvantage increases to 1 minute.","modifyId":"DESTRUCTIVE_BLAST"},"ICE_BLAST_TYPE":{"id":"ICE_BLAST_TYPE","name":"ice (blast type)","type":"BLAST_TYPE","text":"Ice freezes over the limbs of your target hampering their movements. Your destructive blast deals cold damage. Any creature damaged by the blast has its move speed reduced by 10 feet (to a minimum of 5 feet) for 1 minute. Any blast shape talent that allows a Dexterity saving throw instead allows a Constitution saving throw.\n\n**Draw on nature (Augment 0 sp):** If you are within an area of precipitation and cold severity each of 1 or higher, or if there is a 5-foot cube of water (or equivalent volume) within your destructive blast range, you can choose to have your destructive blast not count as magic for the purpose of affecting creatures with a bonus against, or resistance or immunity to magic. You can use the augment granted by the Create Nature talent of the Nature sphere as part of casting to apply this augment.\n\n**Augment 1 sp:** Damaged creatures are encased in ice instead of simply slowed, leaving them restrained for a number of rounds equal to your proficiency bonus. Restrained creatures may make a Strength saving throw as an action to end the restraint. Dealing 3 damage per level to the ice frees the creature. The ice has an AC of 10.","modifyId":"DESTRUCTIVE_BLAST"},"LIGHTNING_BLAST_TYPE":{"id":"LIGHTNING_BLAST_TYPE","name":"lightning (blast type)","type":"BLAST_TYPE","text":"Electrical energy courses through the nerves of the target, causing muscles to tense up.\n\nYour destructive blast deals lightning damage.You have advantage on any attack rolls made as part of the destructive blast if the target is wearing armor made of metal. Targets wearing armor made of metal also have disadvantage on any saving throws made against your destructive blast. Any creature that takes damage can’t take reactions until the start of its next turn.\n\n**Draw on nature (Augment 0 sp):** If you are within an area of precipitation and wind severity each of 1 or higher, you can choose to have your destructive blast not count as magic for the purpose of affecting creatures with a bonus against, or resistance or immunity to magic.\n\n**Augment 1 sp:** Affected creatures must succeed on a Constitution saving throw or be stunned until the start of your next turn.","modifyId":"DESTRUCTIVE_BLAST"},"SCORCHING_BLAST_TYPE":{"id":"SCORCHING_BLAST_TYPE","name":"scorching (blast type)","type":"BLAST_TYPE","text":"Extreme heat causes nerve damage and exhausts the creature. Your destructive blast deals fire damage. Any creature damaged by the blast takes an additional amount of damage equal to your proficiency bonus; this additional damage is not subject to damage resistance, immunity, or vulnerability. Any blast shape talent that allows a Dexterity saving throw instead allows a Constitution saving throw.\n\n**Draw on nature (Augment 0 sp):** If you are within an area of aridity and heat severity each of 1 or higher, or if there is a fire of at least medium size within your destructive blast range, you can choose to have your destructive blast not count as magic for the purpose of affecting creatures with a bonus against, or resistance or immunity to magic. You can use the augment granted by the Create Nature talent of the Nature sphere as part of casting to apply this augment.\n\n**Augment 1 sp:** Creatures damaged by the blast must succeed on a Constitution saving throw or gain 1 level of exhaustion until they take a long or short rest; this exhaustion does not stack with other magical sources of exhaustion.","modifyId":"DESTRUCTIVE_BLAST"},"THUNDER_BLAST_TYPE":{"id":"THUNDER_BLAST_TYPE","name":"thunder (blast type)","type":"BLAST_TYPE","text":"A concussive clap of thunder echoes in the ears of your target, deafening them.\n\nYour destructive blast deals thunder damage. Any creature damaged by the blast must succeed on a Constitution saving throw or be deafened for 1 minute. Any (blast shape) talent that allows a Dexterity saving throw instead allows a Constitution saving throw.\n\n**Draw on nature (Augment 0 sp):** If you are within an area of wind and either aridity or precipitation, each of 1 or higher, you can choose to have your destructive blast not count as magic for the purpose of affecting creatures with a bonus against, or resistance or immunity to magic.\n\n**Augment 1 sp:** Creatures that fail their saving throw are instead stunned until the start of your next turn.","modifyId":"DESTRUCTIVE_BLAST"},"AURA_BLAST_SHAPE":{"id":"AURA_BLAST_SHAPE","type":"BLAST_SHAPE","name":"aura (blast shape)","text":"**Duration:** 1 round.\n\nYour destructive blast becomes an aura that you can surround yourself with that extends 10 feet from you. While this aura is active, you can spend a bonus action to affect all creatures within the aura with your destructive blast. Affected targets may avoid this damage with a successful Dexterity saving throw, but if the final spell point cost of your destructive blast is 1 or more spell points, a successful save instead reduces the damage by half and negates any rider effects the (blast type) would otherwise inflict upon its target. As this is a single, ongoing blast, the blast type and other parameters are set at the time of casting.\n\n**Augment 1 sp:** The duration increases to Concentration, up to 1 minute.\n\n**Augment 2 sp:** The effect persists for the remaining duration without concentration. This augment may be applied after the effect is cast on your turn without an action.","modifyId":"DESTRUCTIVE_BLAST"},"BLADE_BLAST_SHAPE":{"id":"BLADE_BLAST_SHAPE","type":"BLAST_SHAPE","name":"blade (blast shape)","text":"**Casting Time:** 1 action or bonus action, chosen at the time of casting.  \n**Duration:** Concentration, up to 1 minute\n\nYour destructive blast targets and imbues weapons and ammunition. Choose one melee weapon, natural weapon, unarmed strike, or up to 20 pieces of ammunition within range. The damage type dealt by the weapon or ammunition changes to that of the chosen blast type. Attacks made in this way do not inflict any additional damage or effects of the blast type, except as described below:\n\nAfter damaging a creature with an imbued weapon or ammunition, the wielder may spend a bonus action to apply the blast type’s rider effect to the damaged creature as if they were damaged by the destructive blast. Critical hits made with imbued weapons or ammunition deal an additional 1d6 damage of the chosen blast type, increasing by 1d6 at 5th level (2d6), 11th level (3d6), and 17th level (4d6). This additional damage is not rolled twice, but rather added to the total damage dealt.\n\n**Augment 1 sp:** You can affect a number of additional melee weapons, natural weapons, unarmed strikes, or sets of 20 pieces of ammunition equal to your proficiency bonus.\n\n**Augment 2 sp:** The effect persists for the remaining duration without concentration. This augment may be applied after the effect is cast on your turn without an action.","modifyId":"DESTRUCTIVE_BLAST"},"CHAIN_BLAST_BLAST_SHAPE":{"id":"CHAIN_BLAST_BLAST_SHAPE","type":"BLAST_SHAPE","name":"chain blast (blast shape)","text":"Your destructive blast arcs toward a target of your choice that you can see within range. A target may avoid this damage with a successful Dexterity saving throw, but if the final spell point cost of your destructive blast is 1 or more spell points, a successful save instead reduces the damage by half and negates any rider effects the (blast type) would otherwise inflict upon its target.\n\n**Augment 1 sp:** When a target fails their saving throw against your destructive blast, as a bonus action you can cause the destructive blast to leap to one or more additional targets. You can have the destructive blast leap to a total number of targets in a round equal to your proficiency bonus. Each target must be within 30 feet of the previous target and within your destructive blast range. No target may be struck by the blast more than once. This augment is chosen when the first target fails their saving throw.","modifyId":"DESTRUCTIVE_BLAST"},"EXPLOSIVE_ORB_BLAST_SHAPE":{"id":"EXPLOSIVE_ORB_BLAST_SHAPE","type":"BLAST_SHAPE","name":"explosive orb (blast shape)","text":"Your destructive blast targets a 5-foot cube. Affected targets may avoid this damage with a successful Dexterity saving throw, but if the final spell point cost of your destructive blast is 1 or more spell points, a successful save instead reduces the damage by half and negates any rider effects the (blast type) would otherwise inflict upon its target.\n\n**Augment 0 sp: \\[Globe\\]** The explosive orb materializes in your hand as a tiny globe about the size of a sling stone. At any time, you or a creature you give the globe to can throw the globe (to a normal range of 20 feet, long range of 60 feet) or hurl it with a sling (to the sling’s normal range). It shatters on impact, with the same effect as the normal casting of the destructive blast. Even if thrown through a weapon, it deals only the destructive blast damage, and the attack cannot be used with the Striking (metasphere) talent. You can also set the globe down without shattering it. After 1 minute, if the globe hasn’t already shattered, it explodes. A creature may shatter a globe within its reach as an action or bonus action or by spending 5 feet of movement while moving through the globe’s space. Creatures unaware of the globe that move through its space have a 50% chance of shattering it. You cannot have more globes made at a time than your proficiency bonus, and you can treat a globe as if it were an Alchemy sphere formula that may be thrown for the purpose of interacting with the Trap sphere.\n\n**Augment 1 sp:** When using the globe augment, the globe persists for 8 hours. If you are within destructive blast range of the globe, you can cause it to explode as a reaction. At the end of this time, it explodes or dissipates. This choice is made at the time of casting.\n\n**Augment 1 sp:** The affected area is instead a sphere with a radius of up to 20 feet.","modifyId":"DESTRUCTIVE_BLAST"},"LEAP_BLAST_SHAPE":{"id":"LEAP_BLAST_SHAPE","type":"BLAST_SHAPE","name":"leap (blast shape)","text":"Your destructive blast becomes a 5 foot wide by 10 foot long line. When you use this blast shape, you appear in the last square of the line after the effect is resolved (or the nearest available space). Affected targets may avoid this damage with a successful Dexterity saving throw, but if the final spell point cost of your destructive blast is 1 or more spell points, a successful save instead reduces the damage by half and negates any rider effects the (blast type) would otherwise inflict upon its target. You do not count as having passed through any intermediate space and do not provoke opportunity attacks for moving.\n\n**Augment 1 sp:** Increase the length of the line by any amount you wish, up to your destructive blast range.\n\n**Augment 1 sp:** You can arrive at any point along the line after the effect is resolved, provided it is an unoccupied space.","modifyId":"DESTRUCTIVE_BLAST"},"RAY_BLAST_SHAPE":{"id":"RAY_BLAST_SHAPE","type":"BLAST_SHAPE","name":"ray (blast shape)","text":"You can shoot your destructive blast as a ray, making a ranged spell attack. You can make a melee spell attack instead, if the target is within your natural reach.\n\n**Augment 1 sp:** You can shoot 2 rays. The number of rays you can shoot increases by 1 at 5th level (3 rays), 11th level (4 rays), and 17th level (5 rays), but no creature or object can be targeted by more than a single ray.","modifyId":"DESTRUCTIVE_BLAST"},"RETRIBUTION_BLAST_SHAPE":{"id":"RETRIBUTION_BLAST_SHAPE","type":"BLAST_SHAPE","name":"retribution (blast shape)","text":"**Augment 1 sp:** You may use this destructive blast as a reaction, which you take in response to being damaged by a creature within range that you can see. Your destructive blast surrounds and affects the creature that damaged you. The affected target can make a Dexterity saving throw to reduce the damage by half and negates any rider effects the (blast type) would otherwise inflict upon its target.","modifyId":"DESTRUCTIVE_BLAST"},"SCULPT_BLAST_SHAPE":{"id":"SCULPT_BLAST_SHAPE","type":"BLAST_SHAPE","name":"sculpt (blast shape)","text":"**Range:** self  \n**Area:** varies; see augment\n\n**Augment 0 sp:** Your destructive blast affects a 5-foot radius area, centered within range. You can exclude yourself from this area. Affected targets may avoid this damage with a successful Dexterity saving throw, but if the final spell point cost of your destructive blast is 1 or more spell points, a successful save instead reduces the damage by half and negates any rider effects the (blast type) would otherwise inflict upon its target.\n\n**Augment 1 sp:** Your destructive blast becomes either a 30-foot cone or a 120-foot by 5-foot line, each emanating from a point within range. Affected targets may avoid this damage with a successful Dexterity saving throw, but if the final spell point cost of your destructive blast is 1 or more spell points, a successful save instead reduces the damage by half and negates any rider effects the (blast type) would otherwise inflict upon its target.","modifyId":"DESTRUCTIVE_BLAST"},"SPHERE_BLAST_SHAPE":{"id":"SPHERE_BLAST_SHAPE","type":"BLAST_SHAPE","name":"sphere (blast shape)","text":"**Duration:** 1 round\n\nYour destructive blast takes the form of a 5-foot-diameter sphere, appearing in an unoccupied space of your choice within range. Any creature that enters the sphere’s space is affected by your destructive blast. Affected targets may avoid this damage with a successful Dexterity saving throw, but if the final spell point cost of your destructive blast is 1 or more spell points, a successful save instead reduces the damage by half and negates any rider effects the (blast type) would otherwise inflict upon its target.\n\nAs a bonus action, you can move the sphere up to 30 feet. If you ram the sphere into a creature, that creature may attempt a Dexterity saving throw to negate the sphere’s damage and the sphere stops moving this turn, ending its movement in the space immediately prior to the creature. The sphere flies and is never at risk of falling.\n\n**Augment 1 sp:** The duration increases to Concentration, up to 1 minute.\n\n**Augment 2 sp:** The effect persists for the remaining duration without concentration. This augment may be applied after the effect is cast on your turn without an action.","modifyId":"DESTRUCTIVE_BLAST"},"TETHER_BLAST_SHAPE":{"id":"TETHER_BLAST_SHAPE","type":"BLAST_SHAPE","name":"tether (blast shape)","text":"**Duration:** Concentration, up to 1 minute\n\nYour destructive blast tethers the target to you. Make a melee (if the target is within your natural reach) or ranged spell attack against a creature or object within 30 feet to deal your destructive blast damage and tether the target to you. The target cannot move away from you unless you allow it. For as long as the tether persists, neither you nor the target can move more than 30 feet away from each other. Either may attempt to drag the other, requiring a contested Strength check; if the moving creature wins the check, it may move up to half its speed, dragging the other. Creatures two or more sizes larger can’t be dragged and may move freely at full speed, dragging the smaller creature. For as long as the tether remains, you can deal destructive blast damage to the tethered target as a bonus action. Tethered targets may avoid this damage with a successful Dexterity saving throw, but if the final spell point cost of your destructive blast is 1 or more spell points, a successful save instead reduces the damage by half and negates any rider effects the (blast type) would otherwise inflict upon its target. As this is a single, ongoing blast, the blast type and other parameters are set at the time of casting.\n\nThe tether has AC equal to 10 + your proficiency bonus and 3 hit points per level, which refresh at the beginning or your turn. The tether has immunity to psychic damage and the damage type matching that of the destructive blast.\n\n**Augment 2 sp:** The effect persists for the remaining duration without concentration. This augment may be applied after the effect is cast on your turn without an action.","modifyId":"DESTRUCTIVE_BLAST"},"WALL_BLAST_SHAPE":{"id":"WALL_BLAST_SHAPE","type":"BLAST_SHAPE","name":"wall (blast shape)","text":"**Duration:** concentration, up to 1 minute\n\nYour destructive blast becomes a 5-foot-by-5-foot panel wall that lasts for the duration. Panels of the wall must be placed on a flat surface. Creatures passing through your wall suffer your destructive blast’s damage and effects. Creatures standing in the wall’s space when it is created are allowed a Dexterity saving throw to avoid this damage, but if the final spell point cost of your destructive blast is 1 or more spell points, a successful save instead reduces the damage by half and negates any rider effects the (blast type) would otherwise inflict upon its target. Upon a successful save, the creature may choose which side of the wall to be on, otherwise you choose (the creature must be able to fit in the available space on the chosen side).\n\nThe wall does not block line of effect, sight, projectiles, or thrown objects. An individual creature cannot be damaged by a destructive blast with this blast shape more than once per turn, regardless of how many times they enter or pass through a panel. The maximum number of panels you can create doubles at 5th level (2 panels), 11th level (4 panels), and 17th level (8 panels). Each panel must be contiguous with another panel.\n\n**Augment 0 sp:** You can instead create a sphere or hemispherical dome with a maximum radius no greater than the width or height of your panel.\n\n**Augment 1 sp:** The maximum width and height of each panel increases by 5 feet (10-foot-by-10-foot), increasing again at 5th level (15-foot-by-15-foot), 11th level (20-foot-by-20-foot), and 17th level (25-foot-by-25-foot).\n\n**Augment 1 sp:** You can create twice as many panels; 1st level (2 panels), 5th level (4 panels), 11th level (8 panels), and 17th level (16 panels).\n\n**Augment 1 sp:** the wall blocks sight and moving through the wall requires 5 feet of movement. If you are of 11th level or higher, non-magical projectiles that pass through the wall are destroyed.\n\n**Augment 2 sp:** The effect persists for the remaining duration without concentration. This augment may be applied after the effect is cast on your turn without an action.","modifyId":"DESTRUCTIVE_BLAST"}}