{"ANIMATE_OBJECT_DEGRADE":{"id":"ANIMATE_OBJECT_DEGRADE","name":"animate object","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade a creature of the construct type, causing it to be restrained if it fails its saving throw.","modifyId":"DEGRADE"},"ANIMATE_OBJECT_ENHANCE":{"id":"ANIMATE_OBJECT_ENHANCE","name":"animate object","type":"ENHANCE_DEGRADE","text":"  \n**Cost:** 2 sp\n\nYou can enhance a Tiny object, bestowing movement and a semblance of life. The object obeys your command and understands your language, but as it is not intelligent, it can only obey simple commands such as ‘move’, ‘fight’, ‘guard’, ‘stop’, etc.\n\nIf you animate an enemy’s weapon, the weapon cannot move and attack while it is being held, but the wielder must pass a Dexterity saving throw equal to your Enhancement sphere DC each round they hold the item or lose their action fighting their weapon for control. If you animate a creature’s armor or clothing, the creature becomes grappled and must pass a Dexterity saving throw each round or also be restrained.\n\nAs a bonus action, you can mentally command any creature you made with this effect if the creature is within 500 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only uses the Disengage, Dodge, or Hide actions to defend itself the best it can against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.\n\nAn animated object is a construct with AC, hit points, attacks, Strength, and Dexterity determined by its size. Its Constitution is 10 and its Intelligence and Wisdom are 3, and its Charisma is 1\\. Its speed is 30 feet; if the object lacks legs or other appendages it can use for locomotion, it instead has a flying speed of 30 feet and can hover. If the object is securely attached to a surface or a larger object, such as a chain bolted to a wall, its speed is 0\\. It has blindsight with a radius of 30 feet and is blind beyond that distance. When the animated object drops to 0 hit points, it reverts to its original object form, and any remaining damage carries over to its original object form.\n\nIf you command an object to attack, it can make a single melee attack against a creature within 5 feet of it. It makes a slam attack with an attack bonus and bludgeoning damage determined by its size. The GM might rule that a specific object inflicts slashing or piercing damage based on its form, or other types of damage as appropriate (such as fire damage for an animated torch).\n\nThe maximum size of the object you can target increases by one size category at 5th level (Small), 11th (Medium), and 17th level (Large).\n\n**Augment 1 sp:** You can target an object one size larger than normal.\n\n**Augment 2 sp:** You can target an object two sizes larger than normal.","modifyId":"ENHANCE"},"BESTOW_INTELLIGENCE_DEGRADE":{"id":"BESTOW_INTELLIGENCE_DEGRADE","name":"bestow intelligence","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade a creature of the construct type, reducing its intelligence score to 2 (unless it would be lower) and removing its ability to speak or understand any languages.\n\n**Augment 1 sp:** The affected construct is also stunned for 1d4 rounds.","modifyId":"DEGRADE"},"BESTOW_INTELLIGENCE_ENHANCE":{"id":"BESTOW_INTELLIGENCE_ENHANCE","name":"bestow intelligence","type":"ENHANCE_DEGRADE","text":"  \n**Cost:** 1 sp\n\nYou can enhance a tree, an object, or a creature with no Intelligence or an Intelligence of 3 or less, granting it temporary intelligence. The target gains an Intelligence of 10 and the ability to speak and understand one language you know. If you are targeting a magic object or tree, it also gains senses similar to a human’s and a Wisdom or Charisma of 10\\. This does not grant the target extra abilities nor the ability to move. If a target creature had immunity to psychic damage or the charmed or frightened conditions due to being mindless, it loses those immunities.\n\nThe creature or object is friendly towards you, but does not gain greater insight into its surroundings before it gained intelligence (thus, an intelligent rock could not tell you who passed by it before it gained sentience, nor an intelligent tree describe a creature who climbed it the day before), nor does it automatically obey your commands, although it will usually provide favors and aid that is not too dangerous.\n\nIf you possess the Animate Object talent, it gains the following augment:\n\n**Augment 1 sp:** Your animated object gains intelligence, as the Bestow Intelligence enhancement. The object still obeys you explicitly even though it is now intelligent.","modifyId":"ENHANCE"},"KEEN_WEAPON_DEGRADE":{"id":"KEEN_WEAPON_DEGRADE","name":"keen weapon","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade a weapon, natural weapon, or unarmed strike; attacks made with this weapon treat all damage dice rolled as having rolled a 1 and are incapable of making critical hits.","modifyId":"DEGRADE"},"KEEN_WEAPON_ENHANCE":{"id":"KEEN_WEAPON_ENHANCE","name":"keen weapon","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance a weapon, natural weapon, or unarmed strike; attacks made with this weapon score a critical hit on a roll of 19 or 20.","modifyId":"ENHANCE"},"PURSUANT_AMMUNITION_DEGRADE":{"id":"PURSUANT_AMMUNITION_DEGRADE","name":"pursuant ammunition","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade a ranged weapon or ranged natural weapon, granting ammunition fired out of it a rudimentary mind. Ranged attacks made with this weapon have disadvantage. If such an attack misses and there is a creature allied with the attacker within 30 feet of the target, the ammunition veers toward the ally. Roll a new attack, without disadvantage from this ability, against the AC of the nearest ally of the attacker and apply the result of the attack to that creature.","modifyId":"DEGRADE"},"PURSUANT_AMMUNITION_ENHANCE":{"id":"PURSUANT_AMMUNITION_ENHANCE","name":"pursuant ammunition","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance a ranged weapon or ranged natural weapon, granting ammunition fired out of it a rudimentary mind. Ranged attacks with that weapon treat the target’s cover level as one lower (full cover becomes three-quarters cover, three quarters cover becomes half cover, half cover is ignored). To target a creature with total cover, there must be a gap in the cover large enough to fit the ammunition through.","modifyId":"ENHANCE"},"VERSATILE_WEAPON_ENHANCE":{"id":"VERSATILE_WEAPON_ENHANCE","name":"versatile weapon","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance a weapon, natural weapon, or unarmed strike, causing it to be treated as a chosen type of material for the purposes of bypassing damage resistance.","modifyId":"ENHANCE"},"ENERGY_WEAPON_ENHANCE":{"id":"ENERGY_WEAPON_ENHANCE","name":"energy weapon","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance a weapon, allowing it to deal an additional 1d6 damage of either acid, cold, fire, lightning, necrotic, radiant, or thunder, chosen when the ability is cast. A weapon cannot benefit from more than one instance of this effect; if cast on a weapon already benefiting from this ability, the previous instance ends.","modifyId":"ENHANCE"},"ENHANCE_EQUIPMENT_ENHANCE":{"id":"ENHANCE_EQUIPMENT_ENHANCE","name":"enhance equipment","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance a weapon, natural weapon, suit of armor, or shield, making it count as magic and granting it a bonus to attack and damage rolls (if a weapon or natural weapon) or to AC (if armor) equal to half your proficiency bonus, rounded down. This does not stack with any magic bonus to attack and damage rolls or to AC already granted by the item. You can treat clothing or a creature’s body as armor for the purpose of applying AC. Objects that could be used as improvised weapons may benefit from this effect.","modifyId":"ENHANCE"},"ENHANCE_EQUIPMENT_DEGRADE":{"id":"ENHANCE_EQUIPMENT_DEGRADE","name":"enhance equipment","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade a weapon, natural weapon, suit of armor, or shield. Any magical bonuses to attack, damage, or AC from the target are suppressed for the duration.","modifyId":"DEGRADE"},"CORROSIVE_POISON_ENHANCE":{"id":"CORROSIVE_POISON_ENHANCE","name":"corrosive poison","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance a natural weapon or object that deals poison damage, rendering it corrosive, changing the poison damage to acid damage.","modifyId":"ENHANCE"},"ENHANCE_VIRULENCE_DEGRADE":{"id":"ENHANCE_VIRULENCE_DEGRADE","name":"enhance virulence","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade a dose of poison; any creature making a saving throw against the effects of the dose of poison has advantage on the saving throw. You can apply this degrade effect to a natural weapon that deals poison damage or inflicts the poisoned condition; the effects apply to all attacks made with it for the duration of the effect. You can degrade one source of poison damage or the poisoned condition affecting a creature; the creature gains advantage on saving throws against the targeted effect.","modifyId":"DEGRADE"},"ENHANCE_VIRULENCE_ENHANCE":{"id":"ENHANCE_VIRULENCE_ENHANCE","name":"enhance virulence","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance a dose of poison; any creature making a saving throw against the effects of the dose of poison have disadvantage on the saving throw. You can apply this enhance effect to a natural weapon that deals poison damage or inflicts the poisoned condition; the effects apply to the next successful attack made with it.","modifyId":"ENHANCE"},"ENHANCE_CAPACITY_DEGRADE":{"id":"ENHANCE_CAPACITY_DEGRADE","name":"enhance capacity","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade creatures, reducing their carrying capacity to 1/4th its usual amount.\n\n**Augment 1 sp:** The creature’s carrying capacity is instead reduced to 1/8th.","modifyId":"DEGRADE"},"ENHANCE_CAPACITY_ENHANCE":{"id":"ENHANCE_CAPACITY_ENHANCE","name":"enhance capacity","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance creatures, doubling their carrying capacity.\n\n**Augment 1 sp:** The creature’s carrying capacity is instead multiplied by 4.","modifyId":"ENHANCE"},"IMPROVED_FLEXIBILITY_DEGRADE":{"id":"IMPROVED_FLEXIBILITY_DEGRADE","name":"improved flexibility","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade a creature, forcing it to be treated as one size larger when squeezing through tight places.","modifyId":"DEGRADE"},"IMPROVED_FLEXIBILITY_ENHANCE":{"id":"IMPROVED_FLEXIBILITY_ENHANCE","name":"improved flexibility","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance a creature, allowing it to be treated as one size smaller when squeezing through tight places.","modifyId":"ENHANCE"},"IGNORE_EXHAUSTION_ENHANCE":{"id":"IGNORE_EXHAUSTION_ENHANCE","name":"ignore exhaustion","type":"ENHANCE_DEGRADE","text":"  \nYou can apply an enhancement to a creature, allowing it to temporarily treat its exhaustion level as a number of levels lower equal to your proficiency bonus. The target is still exhausted for the purpose of effects that increase exhaustion, but the target can only die of exhaustion if their reduced exhaustion value is 6 or greater. The creature also adds your level to their Constitution score for the purpose of how long it may hold its breath or run before making Constitution checks. As a side effect, applying this enhancement to a sleeping creature causes it to immediately wake up.","modifyId":"ENHANCE"},"RESIST_DEBILITATION_ENHANCE":{"id":"RESIST_DEBILITATION_ENHANCE","name":"resist debilitation","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance creatures, allowing them to ignore a reduction to one ability score, up to twice your proficiency bonus.","modifyId":"ENHANCE"},"MANIPULATE_HARDNESS_DEGRADE":{"id":"MANIPULATE_HARDNESS_DEGRADE","name":"manipulate hardness","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade an object, giving it vulnerability to bludgeoning, piercing, and slashing damage. If the target has resistance to one of these damage types, it loses that resistance instead of gaining vulnerability. If the target was immune to a damage type, it instead loses its immunity and gains resistance.\n\n**Augment 2 sp:** You can apply this effect to a creature.","modifyId":"DEGRADE"},"MANIPULATE_HARDNESS_ENHANCE":{"id":"MANIPULATE_HARDNESS_ENHANCE","name":"manipulate hardness","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance an object to give it resistance to bludgeoning, piercing, and slashing damage.\n\n**Augment 2 sp:** You can apply this effect to a creature.","modifyId":"ENHANCE"},"ENHANCE_FOCUS_DEGRADE":{"id":"ENHANCE_FOCUS_DEGRADE","name":"enhance focus","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade creatures. The target cannot add its proficiency bonus to any skill or tool ability check it makes.","modifyId":"DEGRADE"},"ENHANCE_FOCUS_ENHANCE":{"id":"ENHANCE_FOCUS_ENHANCE","name":"enhance focus","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance creatures. Choose one skill or tool proficiency; when making an ability check using that skill or tool, the affected creature may choose to treat the result as if they had rolled a 10 instead of rolling.","modifyId":"ENHANCE"},"ENHANCE_MIND_DEGRADE":{"id":"ENHANCE_MIND_DEGRADE","name":"enhance mind","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade creatures, imposing disadvantage on Intelligence, Wisdom, and Charisma ability checks.","modifyId":"DEGRADE"},"ENHANCE_MIND_ENHANCE":{"id":"ENHANCE_MIND_ENHANCE","name":"enhance mind","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance creatures, granting them advantage on Intelligence, Wisdom, and Charisma ability checks.","modifyId":"ENHANCE"},"MUFFLE_SOUND_DEGRADE":{"id":"MUFFLE_SOUND_DEGRADE","name":"muffle sound","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade a creature or object, amplifying any sound it creates. Wisdom (Perception) checks made to hear any sounds it makes gain advantage. Affected creatures and creatures in possession of affected objects take disadvantage on Stealth.","modifyId":"DEGRADE"},"MUFFLE_SOUND_ENHANCE":{"id":"MUFFLE_SOUND_ENHANCE","name":"muffle sound","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance a creature or object, muffling any sound it creates. Wisdom (Perception) checks made to hear any sounds it makes suffer disadvantage.","modifyId":"ENHANCE"},"ENHANCE_PHYSIQUE_DEGRADE":{"id":"ENHANCE_PHYSIQUE_DEGRADE","name":"enhance physique","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade creatures, imposing disadvantage on Strength, Dexterity, and Constitution ability checks.","modifyId":"DEGRADE"},"ENHANCE_PHYSIQUE_ENHANCE":{"id":"ENHANCE_PHYSIQUE_ENHANCE","name":"enhance physique","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance creatures, granting them advantage on either Strength, Dexterity, or Constitution ability checks.","modifyId":"ENHANCE"},"SUPERIOR_REFLEXES_DEGRADE":{"id":"SUPERIOR_REFLEXES_DEGRADE","name":"superior reflexes","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade creatures, giving them disadvantage on initiative checks and removing their ability to make opportunity attacks. If this effect is applied after initiative has been rolled, roll the affected creature’s initiative again, applying disadvantage. The creature acts on the new initiative if it is lower than the original, otherwise the original initiative is maintained.","modifyId":"DEGRADE"},"SUPERIOR_REFLEXES_ENHANCE":{"id":"SUPERIOR_REFLEXES_ENHANCE","name":"superior reflexes","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance creatures, giving them advantage on initiative checks and allowing them to make one opportunity attack each round without spending their reaction. If this effect is applied after initiative has been rolled, roll the affected creature’s initiative again, applying advantage. The creature acts on the new initiative if it is higher than the original, otherwise the original initiative is maintained.","modifyId":"ENHANCE"},"SPEED_CONTROL_DEGRADE":{"id":"SPEED_CONTROL_DEGRADE","name":"speed control","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade a creature, halving one movement speed.\n\n**Augment 1 sp:** the creature cannot take the Disengage action.\n\n**Augment 1 sp:** You completely remove one of a creature’s special movement speeds, such as flight or burrowing; if the creature in question has a natural flight speed, they glide safely to the ground.","modifyId":"DEGRADE"},"SPEED_CONTROL_ENHANCE":{"id":"SPEED_CONTROL_ENHANCE","name":"speed control","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance creatures, granting them a +10 foot bonus to any movement speed it possesses. This speed bonus increases by +5 feet at 5th (15 feet), 11th (20 feet), and 17th (25 feet) levels.","modifyId":"ENHANCE"},"STAUNCH_RESISTANCE_DEGRADE":{"id":"STAUNCH_RESISTANCE_DEGRADE","name":"staunch resistance","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade creatures, giving them disadvantage on all saving throws.","modifyId":"DEGRADE"},"STAUNCH_RESISTANCE_ENHANCE":{"id":"STAUNCH_RESISTANCE_ENHANCE","name":"staunch resistance","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance creatures, granting them proficiency with one saving throw.","modifyId":"ENHANCE"},"STEAL_SENSES_DEGRADE":{"id":"STEAL_SENSES_DEGRADE","name":"steal senses","type":"ENHANCE_DEGRADE","text":"  \n**Cost:** 1 sp\n\nYou can degrade creatures, causing them to become either blind or deaf (your choice), or to lose one special sense such as the scent ability, Tremorsense, Blindsense, Blindsight, etc.","modifyId":"DEGRADE"},"STILL_TONGUE_DEGRADE":{"id":"STILL_TONGUE_DEGRADE","name":"still tongue","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade creatures, rendering them incapable of speech and unable to supply verbal components. If it has telepathy or some other means of communicating without speech (including sign language or writing), you can render one such means of communication impossible instead.","modifyId":"DEGRADE"},"WEIGHT_CONTROL_DEGRADE":{"id":"WEIGHT_CONTROL_DEGRADE","name":"weight control","type":"ENHANCE_DEGRADE","text":"  \nYou can degrade an object or creature, doubling its weight and reducing all movement speeds by 10 feet, and making it unable to take the Dash action.","modifyId":"DEGRADE"},"WEIGHT_CONTROL_ENHANCE":{"id":"WEIGHT_CONTROL_ENHANCE","name":"weight control","type":"ENHANCE_DEGRADE","text":"  \nYou can enhance an object or creature, reducing its weight or even making it weightless. You can make Tiny creatures and objects weightless at 1st level, which improves to Small objects at 5th level, Medium objects at 11th level, and Large objects at 17th level.\n\nTargets one size too big are instead reduced to half-weight, while objects one size smaller than your maximum can instead be made to float.\n\nThe following effects happen to targets that are half-weight, weightless, or floating. These effects stack (thus, a weightless object would receive both the weightless and half-weight effects).\n\n* **Half-Weight:** A half-weight creature suffers disadvantage on checks made to resist being shoved.\n* **Weightless:** A weightless creature or object counts as being one size smaller than normal when determining who can lift it through effects determined by size, such as through telekinesis or the Rock Throw talent (see Spheres of Might). Larger weightless weapons do not give disadvantage when wielded by a creature one size too small for it.\n* **Floating:** You can choose to move the target up or down 20 feet per round. While you cannot make an object or creature move any direction other than up or down, this can easily be combined with telekinesis, wind power, or pushing off a wall (at half the target’s usual speed) to create flight-like effects. Unwilling creatures are allowed a new saving throw each round to negate this effect on themselves, but they may suffer falling damage if successful.\n\n**Augment 1 sp:** Increase the size object you can affect increases by 2 size categories.","modifyId":"ENHANCE"}}