{"CHAMPION_S_MANTLE_CONSECRATION":{"id":"CHAMPION_S_MANTLE_CONSECRATION","type":"CONSECRATION","name":"champion’s mantle (consecration)","text":"You imbue cosmic energy into the weapons of nearby creatures. While this consecration is in effect, every creature in the aura deals an extra 1d4 radiant damage when it hits with a weapon attack.\n\n**Augment 1 sp:** This consecration no longer affects every creature inside the aura, but now only affects your allies.","modifyId":"CONSECRATION"},"CONSEQUENCES_CONSECRATION":{"id":"CONSEQUENCES_CONSECRATION","type":"CONSECRATION","name":"consequences (consecration)","text":"While this consecration is in effect, any creature in the aura that attacks any other creature (whether in the area or not) takes psychic damage equal to your Proficiency Bonus. For the purposes of this effect, an attack includes any non-harmless spell, sphere effect, or ability targeting a hostile creature or whose area of effect includes a hostile creature. This consecration can only affect an individual creature once per round. The number of times per round that an individual creature can be affected by the consecration increases by 1 at 5th level (2 times), 11th level (3 times), and 17th level (4 times).","modifyId":"CONSECRATION"},"DIVINE_FORCE_CONSECRATION":{"id":"DIVINE_FORCE_CONSECRATION","type":"CONSECRATION","name":"divine force (consecration)","text":"Your consecration fills an area with the influence of an alignment type you are connected to (good, evil, lawful, or chaotic).\n\nYou must possess this alignment type. Creatures of that alignment’s opposite (good for evil, lawful for chaotic, etc.) who begin their turn within the consecrations’s aura must succeed a Charisma saving throw or suffer one of the following conditions for 1 round, chosen at random:  \n**1.** blind  \n**2.** deaf  \n**3.** charmed  \n**4.** poisoned  \n**5.** frightened  \n**6.** restrained\n\nAs this power is cosmic in origin, it ignores immunities that a creature can normally have against these conditions. If you are true neutral, you can choose neutrality with this consecration, in which case all creatures at the extremes of the alignment spectrum (chaotic evil, chaotic good, lawful evil, and lawful good) suffer the conditions.","modifyId":"CONSECRATION"},"HALLOW_CONSECRATION":{"id":"HALLOW_CONSECRATION","type":"CONSECRATION","name":"hallow (consecration)","text":"Your consecration fills an area with cosmic energies protecting against certain supernatural creatures: aberrations, celestials, elementals, fey, fiends, and undead. Such creatures have disadvantage on attack rolls made against allied creatures inside the aura.\n\n**Augment 1 sp:** Allied creatures inside the aura also can’t be charmed, frightened, or possessed by the supernatural creatures. If an allied creature in the aura is already charmed, frightened, or possessed by such a creature, the ally has advantage on any new saving throw against the relevant effect.","modifyId":"CONSECRATION"},"LOGOS_CONSECRATION":{"id":"LOGOS_CONSECRATION","type":"CONSECRATION","name":"logos (consecration)","text":"While inside the area of your consecration, you and your allies can understand all spoken words, regardless of language.\n\n**Augment 1 sp:** You and your allies can also be understood by any creature with a language. You and your allies do not learn the creature’s language, but instead every creature hears what is said in whatever language is most comfortable for it.","modifyId":"CONSECRATION"},"MISFORTUNE_CONSECRATION_CURSE":{"id":"MISFORTUNE_CONSECRATION_CURSE","type":"CONSECRATION","name":"misfortune (consecration) [curse]","text":"Your aura bestows bad luck upon your enemies. The first time each hostile creature enters your aura, it must succeed a Charisma saving throw or be cursed for the duration of the consecration. Whenever a cursed creature inside your aura makes an attack roll or saving throw, the creature must roll a d4 and subtract the number rolled to the attack or saving throw.","modifyId":"CONSECRATION"},"PURITY_CONSECRATION":{"id":"PURITY_CONSECRATION","type":"CONSECRATION","name":"purity (consecration)","text":"Your consecration blesses creatures with hope and vitality. While this consecration is in effect, you and each ally in your aura has advantage on Wisdom saving throws and death saving throws.\n\n**Augment 1 sp:** Your consecration also maximizes the number of hit points possible from any healing. For example, a potion of healing which normally heals 2d4+2 hit points would automatically heal 10 hit points if used within the area.","modifyId":"CONSECRATION"},"REVEAL_ALIGNMENT_CONSECRATION":{"id":"REVEAL_ALIGNMENT_CONSECRATION","type":"CONSECRATION","name":"reveal alignment (consecration)","text":"Your consecration reveals the alignment of all creatures inside it. While this consecration is in effect, the alignment of all creatures within the area is plain to any who observe them. How this manifests is unique to each observer—some might see a good creature with a halo and an evil creature with horns, while others might hear musical themes and chords evoking an alignment—but however it does the interpretation is unambiguous in the observer’s mind. An observer must still be able to sense a creature in order to discern its alignment.","modifyId":"CONSECRATION"},"SERENDIPITY_CONSECRATION":{"id":"SERENDIPITY_CONSECRATION","type":"CONSECRATION","name":"serendipity (consecration)","text":"Your aura bestows luck upon your allies. Whenever an allied creature inside your aura makes an attack roll or saving throw, the creature can roll a d4 and add the number rolled to the attack or saving throw. An individual creature can only benefit from this consecration once per round.","modifyId":"CONSECRATION"},"SILENCE_CONSECRATION":{"id":"SILENCE_CONSECRATION","type":"CONSECRATION","name":"silence (consecration)","text":"Your aura stiffles all sound within or passing through your consecration. Any creature or object entirely inside the sphere gains resistance to thunder damage, and creatures are deafened while entirely inside it. Using any magic that includes or requires a verbal component is impossible there.\n\n**Augment 2 sp:** Your aura grants immunity to thunder damage.","modifyId":"CONSECRATION"},"TUG_FATE_CONSECRATION_CURSE":{"id":"TUG_FATE_CONSECRATION_CURSE","type":"CONSECRATION","name":"tug fate (consecration) [curse]","text":"Your aura manipulates the luck and fate of others. For as long as this consecration is in effect, any creature within the aura who rolls a 10 on the d20 of an attack roll, ability check, or saving throw receives either a bonus or a penalty to their roll equal to your Proficiency Bonus (your choice).\n\n**Augment 1 sp:** Additionally, once per round any time a creature within the area rolls a natural 1 or natural 20, you can change the roll into the opposite. This does not require an action, but can only be used once per round. Converting a natural 20 to a natural 1 is a curse effect and can be negated with a successful Wisdom saving throw.","modifyId":"CONSECRATION"},"UNDO_HARM_CONSECRATION":{"id":"UNDO_HARM_CONSECRATION","type":"CONSECRATION","name":"undo harm (consecration)","text":"While this consecration is in effect, the first time each round any individual creature within the aura is damaged, they immediately gain 5 temporary hit points. These temporary hit points do not stack with themselves and disappear if the creature leaves the aura or the consecration ends. The number of temporary hit points increase by 10 at 5th level (15 temporary hit points), 11th level (25 temporary hit points), and 17th level (35 temporary hit points).\n\n**Augment 1 sp:** This consecration no longer affects every creature inside the aura, but now only affects your allies.","modifyId":"CONSECRATION"},"THE_CHARIOT_MOTIF":{"id":"THE_CHARIOT_MOTIF","type":"MOTIF","name":"the chariot (motif)","text":"You can grant a motif that ensures the target is always able to act. The target gains advantage on saving throws against effects that inflict the incapacitated, paralyzed, stunned, or unconscious conditions. If the target is dying, this also grants them advantage on death saving throws.\n\nDismissing this motif while augmented allows the target to ignore one such effect for 1 minute, and can dismiss the motif even when they would otherwise not be able to take actions, such as if they are incapacitated. If the target was dying, this instead just makes them stable as if they passed three death saving throws.","modifyId":"MOTIF"},"THE_DEVIL_MOTIF":{"id":"THE_DEVIL_MOTIF","type":"MOTIF","name":"the devil (motif)","text":"You can grant a motif that allows the target to assess other creatures. As a free action once per round they can assess an opponent they can see. The target learns the enemy’s approximate CR (see table Enemy CR). The target can assess an additional creature each round at 5th level (2 opponents), 11th level (3 opponents), and 17th level (4 opponents).\n\nDismissing this motif while augmented grants the target a +2 bonus to AC and attack rolls against any enemy they have assessed using this motif’s benefit for 1 minute.\n\n##### Table: Enemy CR\n\n| Enemy’s CR                         | Result       |\n| ---------------------------------- | ------------ |\n| 4+ lower than the target’s level   | Trivial      |\n| 1–3 lower than the target’s level  | Easy         |\n| Equal to the target’s level        | Fair fight   |\n| 1–3 higher than the target’s level | Difficult    |\n| 4+ higher than the target’s level  | Overwhelming |","modifyId":"MOTIF"},"THE_EMPEROR_MOTIF":{"id":"THE_EMPEROR_MOTIF","type":"MOTIF","name":"the emperor (motif)","text":"You can grant a motif that allows its bearer to better project their power. Whenever the target suffers from penalties to attack rolls, damage rolls, saving throws, or ability checks, they reduce their total penalty by 1, to a minimum of 0\\. The reduced penalty increases by 1 at 5th level (2 total), 11th level (3 total), and 17th level (4 total).\n\nDismissing this motif while augmented allows the target to choose one penalty they are suffering and instead add it to their roll for 1 minute. Some feats or abilities can allow you to apply a penalty to individual rolls or checks. This motif would allow you to affect only one such roll or check with the dismissal effect.\n\n##### Variant The Emperor (motif)\n\nYou can grant a motif that allows its bearer to better project their power. Whenever the target suffers from disadvantage to attack rolls, damage rolls, saving throws, or ability checks, they can ignore one source of disadvantage. They can ignore an additional source of disadvantage each round at 5th level (2 total), 11th level (3 total), and 17th level (4 total).\n\nDismissing this motif while augmented allows the target to treat a source of disadvantage as a source of advantage instead for 1 minute. Some feats or abilities can allow you to apply disadvantage to individual rolls or checks. This motif would allow you to affect only one such roll or check with the dismissal effect.","modifyId":"MOTIF"},"THE_EMPRESS_MOTIF":{"id":"THE_EMPRESS_MOTIF","type":"MOTIF","name":"the empress (motif)","text":"You can grant a motif that subtly improves the target’s ability to make their own fate. The target gains a single temporary inspiration token they can use throughout the duration of this motif. An individual creature cannot be the target of The Empress (motif) more times than their Proficiency Bonus per long rest. The target can spend a temporary inspiration point to gain advantage on an ability check, attack roll, or saving throw. Spending their temporary inspiration point does not cause the motif to end.\n\nDismissing this motif while augmented allows the target to add their Proficiency Bonus to any one attack roll, ability check, or saving throw. This does not stack with expertise and other similar abilities that allow adding your Proficiency Bonus a second time.","modifyId":"MOTIF"},"THE_FOOL_MOTIF":{"id":"THE_FOOL_MOTIF","type":"MOTIF","name":"the fool (motif)","text":"You can grant a motif that allows a target to surrender themselves to fate. The target has disadvantage on all saving throws, but gains a +5 bonus to them.\n\nDismissing this motif while augmented allows the target to reroll a saving throw they just failed. They do not have disadvantage on or a bonus to this saving throw. The target can also choose to dismiss this motif as a reaction with no further effect.","modifyId":"MOTIF"},"THE_HANGED_MAN_MOTIF":{"id":"THE_HANGED_MAN_MOTIF","type":"MOTIF","name":"the hanged man (motif)","text":"You can grant a motif that allows the target to benefit from their sacrifices. Each round as a bonus action the target can decide to add double their proficiency bonus on a saving throw of their choice, but lose their Proficiency Bonus on all other saving throws, or to keep their saving throws as is. This choice remains until they decide to change it.\n\nDismissing this motif while augmented allows the target to spend one of their Hit Dice, taking damage equal to the spent Hit Dice and gaining this amount (minimum 1) as a bonus to a single ability check, attack roll, or saving throw.","modifyId":"MOTIF"},"THE_HERMIT_MOTIF":{"id":"THE_HERMIT_MOTIF","type":"MOTIF","name":"the hermit (motif)","text":"You can grant a motif that improves a target’s ability to work alone. So long as the target is not within melee reach of another creature, they can use the Help action on themselves as a bonus action. In any round they do so, they also cannot benefit from another creature using the Help action on them.\n\nDismissing this motif while augmented allows the target to have advantage on attack rolls against all enemies as long as none of the target’s allies threaten the enemy for 1 minute. If the target has the Sneak Attack (or similar) feature, they can use it against enemies for 1 minute, even if a source of disadvantage cancels out the granted advantage.","modifyId":"MOTIF"},"THE_HIEROPHANT_MOTIF":{"id":"THE_HIEROPHANT_MOTIF","type":"MOTIF","name":"the hierophant (motif)","text":"You can grant a motif that allows the target to subsume themselves in the group. The target gains an aura with a radius of 30 feet that gives allies other than the target advantage on all saving throws vs the charmed condition as well as any spell belonging to the Enchantment school or Mind sphere.\n\nDismissing this motif while augmented allows the target to transfer up to half the damage that an ally within 30 feet takes to themselves. The target can discharge this effect even if the damage their ally would take would normally reduce them below 1 hit point, and even if it would kill them outright. Damage is transferred after the effects of resistance, immunity and similar effects. The damage transferred is empathic in nature and cannot be further reduced, divided, or transferred.","modifyId":"MOTIF"},"JUDGMENT_MOTIF":{"id":"JUDGMENT_MOTIF","type":"MOTIF","name":"judgment (motif)","text":"You can grant a motif that heightens the target’s discernment. The target can’t be surprised while conscious, and other creatures don’t gain advantage on attack rolls against them as a result of being unseen. Additionally, the target does not have disadvantage on attack rolls against invisible enemies they can’t see.\n\nDismissing this motif while augmented allows the target to cause all adjacent invisible enemies to become visible for 1 minute, and incapable of making Dexterity (Stealth) checks for that duration.","modifyId":"MOTIF"},"JUSTICE_MOTIF":{"id":"JUSTICE_MOTIF","type":"MOTIF","name":"justice (motif)","text":"You can grant a motif that enforces balance. The first time each round that a hostile creature successfully deals damage to the target, they become marked, taking an additional 1d6 damage from weapon attacks for one round.\n\nDismissing this motif while augmented allows the target to transfer up to half the damage that an enemy would deal to them to the enemy who dealt the damage. The target can discharge this effect even if the damage they take would normally reduce them below 1 hit point, and even if it would kill them outright. Damage is transferred after the effects of resistance, immunity, and similar effects. The damage transferred is empathic in nature and cannot be further reduced, divided, or transferred.","modifyId":"MOTIF"},"THE_LOVERS_MOTIF":{"id":"THE_LOVERS_MOTIF","type":"MOTIF","name":"the lovers (motif)","text":"You can grant a motif that empowers a target when near its allies. The target gains a bonus to all saving throws equal to the number of allies adjacent to them. This bonus cannot exceed your Proficiency Bonus.\n\nDismissing this motif while augmented allows the target to spend one of their Hit Dice and grant that many temporary hit points to an ally within 30 feet. These temporary hit points last for 1 minute.","modifyId":"MOTIF"},"THE_MAGICIAN_MOTIF":{"id":"THE_MAGICIAN_MOTIF","type":"MOTIF","name":"the magician (motif)","text":"You can grant a motif that helps the target make the most of their current circumstances. The target gains a bonus equal to half their proficiency bonus, rounded down, on ability checks their proficiency bonus does not apply to.\n\nDismissing this motif while augmented allows the target to gain an additional action on their turn. This action can only be used to take the Dash, Help or Use an Object action.","modifyId":"MOTIF"},"THE_MOON_MOTIF":{"id":"THE_MOON_MOTIF","type":"MOTIF","name":"the moon (motif)","text":"You can grant a motif that safeguards the target from illusions. The target gains advantage on saving throws vs any spell belonging to the Illusion school or the Illusion sphere.\n\nDismissing this motif while augmented allows a target who successfully disbelieved an illusion to cause all other allies within 30 feet to also disbelieve the same illusion.","modifyId":"MOTIF"},"THE_STAR_MOTIF":{"id":"THE_STAR_MOTIF","type":"MOTIF","name":"the star (motif)","text":"You can grant a motif that gives guidance in difficult circumstances. Any attack roll made against the target during their turn has disadvantage.\n\nDismissing this motif while augmented allows the target to avoid provoking opportunity attacks for 1 minute.","modifyId":"MOTIF"},"STRENGTH_MOTIF":{"id":"STRENGTH_MOTIF","type":"MOTIF","name":"strength (motif)","text":"You can grant a motif that enhances a target’s might and will. When making a Strength check, the target can substitute Strength with your key ability score if it is higher.\n\nDismissing this motif while augmented allows a target to become immune to the frightened condition for 1 minute.","modifyId":"MOTIF"},"THE_SUN_MOTIF":{"id":"THE_SUN_MOTIF","type":"MOTIF","name":"the sun (motif)","text":"You can grant a motif that ensures a glorious dawn after the darkest night. Whenever the target has less than half of their maximum hit points, they have advantage on all saving throws.\n\nDismissing this motif while augmented allows a target to spend Hit Dice to regain hit points as if they took a short rest.","modifyId":"MOTIF"},"TEMPERANCE_MOTIF":{"id":"TEMPERANCE_MOTIF","type":"MOTIF","name":"temperance (motif)","text":"You can grant a motif that protects against the whims of luck. When the target rolls a natural 1 on any attack roll, ability check, or saving throw, they can reroll it. If the new roll is also a natural 1, this effect does not allow them to reroll again.\n\nDismissing this motif while augmented allows the target to force any creature within 30 feet to reroll any attack roll, ability check, or saving throw. They must take the result of the reroll, even if it is worse than the original roll.","modifyId":"MOTIF"},"THE_TOWER_MOTIF":{"id":"THE_TOWER_MOTIF","type":"MOTIF","name":"the tower (motif)","text":"You can grant a motif that lets the target focus the vagaries of time on a creature or object. The target’s unarmed strikes, natural attacks, and manufactured weapons ignore resistance.\n\nDismissing this motif while augmented allows the target to modify a single attack of an ally so that it ignores any resistance a creature or object can have.","modifyId":"MOTIF"},"THE_WHEEL_MOTIF":{"id":"THE_WHEEL_MOTIF","type":"MOTIF","name":"the wheel (motif)","text":"You can grant a motif that empowers the target almost at random. Roll 1d6 when you grant the motif. The target gains a +1 bonus to rolls indicated on the table below. This bonus increases by 1 at 5th level (+2), 11th level (+3), and 17th level (+4).\n\nDismissing this motif while augmented allows the target to gain a bonus to a single attack roll, ability check, or saving throw equal to twice the granted bonus. They must choose to do so before rolling.\n\n##### Table: The Wheel\n\n| d6  | Bonus                   |\n| --- | ----------------------- |\n| 1-2 | Attack and damage rolls |\n| 3-4 | Saving throws           |\n| 5-6 | Ability checks          |","modifyId":"MOTIF"},"THE_WORLD_MOTIF":{"id":"THE_WORLD_MOTIF","type":"MOTIF","name":"the world (motif)","text":"You can grant a motif that enhances the target’s ability to succeed in all their endeavors whenever they commit their efforts. Whenever they would make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10.\n\nDismissing the motif while augmented allows the target to increase the value of any d20 roll made on an ability check made by any ally within 30 feet to 10.","modifyId":"MOTIF"},"BLESS_WORD":{"id":"BLESS_WORD","type":"WORD","name":"bless (word)","text":"You can bless the immediate actions of a target within range. The next d20 roll the target makes before the end of the next round gains advantage.","modifyId":"WORD"},"BONDAGE_WORD_CURSE":{"id":"BONDAGE_WORD_CURSE","type":"WORD","name":"bondage (word) [curse]","text":"You can invoke a curse of bondage upon a target within range. The target must make a Charisma saving throw or become restrained until the start of your next turn.","modifyId":"WORD"},"CURSE_WORD_CURSE":{"id":"CURSE_WORD_CURSE","type":"WORD","name":"curse (word) [curse]","text":"You can curse the immediate actions of a target within range. The next d20 roll the target makes before the end of the next round gains disadvantage.","modifyId":"WORD"},"EXORCISE_WORD":{"id":"EXORCISE_WORD","type":"WORD","name":"exorcise (word)","text":"You can call upon cosmic forces to end a dominate or possession effect on a creature or object. A creature under the effect of Body Thief (or similar ability) is considered under the effect of a possession. The dominated or possessed target is granted a new saving throw or check to resist the effect. If the dominated or possessed target succeeds on their saving throw or check, the domination or possession effect ends, and the target cannot be the target of a dominate or possession effect for by that source for 24 hours; A possessing source, if a creature, is ejected from the body and appears in the nearest unoccupied space.\n\n**Augment 1 sp:** The source of the dominate or possession effect must make a Charisma saving throw or suffer 2d6 necrotic, psychic, or radiant damage, chosen when you augment the effect. On a successful save, the source of the dominate or possession can transfer up to half the damage it takes to the target; transferred damage cannot be reduced by resistance or immunity. The amount of damage increases by 1d6 at 5th level (3d6), 11th level (4d6), and 17th level (5d6).","modifyId":"WORD"},"FREEDOM_WORD":{"id":"FREEDOM_WORD","type":"WORD","name":"freedom (word)","text":"You can invoke a blessing of freedom to a target within range. Until the start of the next turn, the target automatically succeeds on the next Dexterity (acrobatics) or Strength (athletics) check made to escape a grapple, break free from manacles, or untie themselves from rope. In addition, for the round, the target gains immunity to the grappled, incapacitated, paralyzed, restrained, and stunned conditions. If targeting a creature who is petrified, they temporarily lose the condition for the round.","modifyId":"WORD"},"HARM_WORD_CURSE":{"id":"HARM_WORD_CURSE","type":"WORD","name":"harm (word) [curse]","text":"You can curse a target with increased pain. All damage taken by the target is increased by your Proficiency Bonus for 1 round.","modifyId":"WORD"},"MARK_WORD_CURSE":{"id":"MARK_WORD_CURSE","type":"WORD","name":"mark (word) [curse]","text":"**Duration:** Concentration, up to 1 minute\n\nYou can curse a target, allowing you to deal an extra 1d6 necrotic damage to them whenever you hit it with an attack. Additionally, when you place the curse, you can choose one of the following:\n\n* Choose one ability score, the target also has disadvantage on ability checks made with the chosen ability. This functions as the hex spell for the purpose of features and abilities.\n* You also have advantage on any Wisdom (Perception) or Wisdom (Survival) checks you make to find the cursed target. This functions as the hunter’s mark spell for the purpose of features and abilities.\n\nIf the target drops to 0 hit points before the duration expires, you can use a bonus action on a subsequent turn of yours, to curse a new target.\n\n**Augment 1 sp:** You may apply both choices to the curse.\n\n**Augment 2 sp:** The effect persists for the remaining duration without concentration. This augment can be applied after the effect is cast on your turn without an action.","modifyId":"WORD"},"MERCY_WORD":{"id":"MERCY_WORD","type":"WORD","name":"mercy (word)","text":"You can invoke a blessing of mercy upon a target within range. For 1 hour, any time that the target would reduce a creature to 0 hit points with a melee attack, the attacker must choose to knock the creature out (or otherwise incapacitate it) instead of killing it. Additionally, the target must succeed a Charisma saving throw before attacking any creature that is unconscious (or otherwise incapacitated).","modifyId":"WORD"},"OPEN_CLOSE_WORD_CURSE":{"id":"OPEN_CLOSE_WORD_CURSE","type":"WORD","name":"open/close (word) [curse]","text":"You cause something to open or close. This word has different effects based upon the target and whether you are opening or closing.\n\n* **Creature: Open.** The target finds that its eyes or mouth are forced open (chosen at time of casting), and unable to be shut. Each round, at the beginning of the target’s turn they make a new Strength saving throw against the effect. On a successful saving throw, the target can open or close their eyes or mouth as normal.\n* **Creature: Close.** The target finds that its eyes or mouth are forced shut (chosen at time of casting), and unable to be opened. Each round, at the beginning of the target’s turn they make a new Strength saving throw against the effect. On a successful saving throw, the target can open or close their eyes or mouth as normal.\n* **Object: Open.** A target that is held shut by a mundane lock or that is stuck or barred becomes unlocked, unstuck, or unbarred. If the target has multiple locks, only one of them is unlocked. If the target is held shut magically, the effect is suppressed for 10 minutes, during which time the target can be opened and shut normally.\n* **Object: Close.** A target that has a mundane unlocked lock becomes locked. If the target has multiple unlocked locks, only one of them is locked. If the target lacks any locks of their own, the target instead becomes stuck, requiring a Strength check against the sphere effect to burst the object open.","modifyId":"WORD"},"SOOTHE_WORD":{"id":"SOOTHE_WORD","type":"WORD","name":"soothe (word)","text":"You can bless a target with increased healing. Any hit points restored to the target is increased by your Proficiency Bonus for 1 round.","modifyId":"WORD"},"SUBVERT_WORD_CURSE":{"id":"SUBVERT_WORD_CURSE","type":"WORD","name":"subvert (word) [curse]","text":"You can curse the immediate actions of a target within range. The next time that the target would deal damage to a creature or object, before the end of the next round, they must make a Charisma saving throw or deal damage to themselves instead.","modifyId":"WORD"},"VIOLENCE_WORD_CURSE":{"id":"VIOLENCE_WORD_CURSE","type":"WORD","name":"violence (word) [curse]","text":"You can invoke a curse of violence upon a target within range. The target must make a Charisma saving throw or attack the nearest creature (not including themselves) on its next turn.","modifyId":"WORD"}}