{"GREATER_ILLUSIONS_SENSORY":{"id":"GREATER_ILLUSIONS_SENSORY","type":"SENSORY","name":"greater illusions (sensory)","text":"You may create a smell instead of a sound or an image when creating a figment. When augmenting your figments to include both sight and sound, they now can affect the senses of smell, taste, and touch as well. Illusionary swords feel sharp, illusionary food smells delicious (or terrible, as you choose) and illusionary fire feels hot, although the effect is all in the target’s mind and they cannot be made to actually suffer damage. Simply interacting with your figments or a target under your Illusionary Disguise does not reveal the deception anymore, although your illusions still do not have substance or weight (thus, a target feeling your illusionary wall will not immediately notice the deception, but a target attempting to run through or climb on the wall will still fall through, and ranged attacks would still penetrate the wall).\n\nYour kinetic figments become harmless, bland, and incorporeal to creatures that successfully disbelieve your figments.","modifyId":"FIGMENT"},"VEILED_ILLUSIONS_SENSORY":{"id":"VEILED_ILLUSIONS_SENSORY","type":"SENSORY","name":"veiled illusions (sensory)","text":"You can grant your figments or creatures under your Illusionary Disguise an aura, or eliminate any aura they already have, such as altering how they detect through magic that detects magic, alignment, creature types, etc. Your Illusion sphere powers do not detect as being magical effects unless you choose to let them.\n\nA figment’s illusionary aura becomes obvious to a creature detecting its magic that disbelieves the illusion.","modifyId":"FIGMENT"},"DECOY_GLAMER":{"id":"DECOY_GLAMER","type":"GLAMER","name":"decoy (glamer)","text":"**Cost:** 0 sp\n\nYou surround a target with decoy copies, making it difficult to determine which is the real one. An illusory duplicate of the target appears in its space. Until the effect ends, the duplicate moves with the target and mimics its actions.\n\nEach time an enemy targets a creature under this effect with an attack, roll a d20 to determine whether the attack instead targets one of the duplicates. You must roll an 11 or higher to strike a duplicate instead of the target. A duplicate’s AC equals 10 + your Dexterity modifier. If an attack hits a duplicate, the duplicate is destroyed. A duplicate can be destroyed only by an attack that hits it. It ignores all other damage and effects. The effect ends when all duplicates are destroyed.\n\n**Augment 1 sp:** You can grant a number of additional duplicates equal to half your proficiency bonus. If there are four duplicates, you must roll a 4 or higher to change the attack’s target to a duplicate. If there are three duplicates, you must roll a 6 or higher to change the attack’s target to a duplicate. With two duplicates, you must roll an 8 or higher.","modifyId":"GLAMER"},"ILLUSIONARY_DISGUISE_GLAMER":{"id":"ILLUSIONARY_DISGUISE_GLAMER","type":"GLAMER","name":"illusionary disguise (glamer)","text":"**Cost:** 1 sp\n\nYou can create a glamer that changes a target’s appearance. This can change the appearance of an object, or alter a creature to seem 1 foot shorter or taller, make it appear thin, fat, or in between, or change its apparent species, gender, outfit, etc.. You can’t change the target’s body type, so you must adopt a form that has the same basic arrangement of limbs.\n\nOtherwise, the extent of the illusion is up to you. This glamer only disguises the target’s appearance and voice, but can extend to their smell and taste if you have Greater Illusions, their magic auras if you possess Veiled Illusions, or even their minds if you have Intelligent Illusions.\n\nJust as with a figment, the changes are not real; if a target attempts to interact with the illusion (for example, pick up an illusionary hat on top of your head), they pass right through it and feel your hair. Also, just as with a disguise kit, a creature can use its action to inspect your Appearance and attempt an Intelligence (Investigation) check to see through the disguise (against your spell save DC). While these actions can cause a target to disbelieve the disguise, unlike with figments, disbelieving does not automatically let them see through the disguise.\n\n**Augment 1 sp:** If you possess Greater Illusions, you can give your illusionary disguise a tactile component; interacting with the illusion does not reveal the deception, although your illusion still does not have substance (thus, feeling the hat on top of your head wouldn’t make the target disbelieve, but they still could not pick it up off your head).","modifyId":"GLAMER"},"OBSCURE_GLAMER":{"id":"OBSCURE_GLAMER","type":"GLAMER","name":"obscure (glamer)","text":"You gain the following glamers:\n\n**Cost:** 0 sp\n\nThe target becomes blurred, granting disadvantage to any attacks made against them and making them lightly obscured. This effect ends for a target that attacks or casts a spell or sphere ability.\n\n**Augment 1 sp:** The target becomes invisible instead of just blurred for the duration. Anything that the target is wearing or carrying is invisible as long as it remains on the target. The invisibility ends for a target that attacks or casts a spell or sphere ability.\n\n**Augment 1 sp:** The obscure effect does not end if the target attacks or casts a spell or sphere ability.\n\n**Augment 1 sp:** You can muffle the target, removing disadvantage on Dexterity (Stealth) checks from the target produced from heavy armor, and give disadvantage on any Wisdom (Perception) checks made to hear the target.\n\n**Augment 0 sp:** If you possess Greater Illusions, you can give disadvantage on any Wisdom (Perception) checks made to smell the target.\n\n**Augment 1 sp:** If you possess Veiled Illusions, you can suppress all auras from the target, such as magical auras from its equipment or its alignment or creature type aura.\n\n**Augment 1 sp:** If you possess Greater Illusions, the benefits of obscure apply even to targets with blindsight and tremorsense. If you possess Intelligent Illusions, the benefits of obscure apply even to targets with thoughtsense, and hide the target from talents and from divination school spells that read the mind such as detect thoughts or magical lie-detection.","modifyId":"GLAMER"}}