{"BATTLEFIELD_COORDINATION_TACTIC":{"id":"BATTLEFIELD_COORDINATION_TACTIC","type":"TACTIC","name":"battlefield coordination (tactic)","text":"One creature affected by this tactic may use a Reaction to allow another affected ally to ignore one source of disadvantage on any roll.","modifyId":"TACTICS"},"COURIER_S_DASH_TACTIC":{"id":"COURIER_S_DASH_TACTIC","type":"TACTIC","name":"courier's dash (tactic)","text":"Creatures affected by this tactic that start their turn within its radius gain a +10 foot bonus to their speeds for that round.","modifyId":"TACTICS"},"COORDINATED_AID_TACTIC":{"id":"COORDINATED_AID_TACTIC","type":"TACTIC","name":"coordinated aid (tactic)","text":"Creatures affected by this tactic can use the Help action to aid another affected ally within their reach on an ability check as a reaction.","modifyId":"TACTICS"},"COORDINATED_REFLEXES_TACTIC":{"id":"COORDINATED_REFLEXES_TACTIC","type":"TACTIC","name":"coordinated reflexes (tactic)","text":"Creatures affected by this tactic that are within range gain a +2 bonus on Dexterity saving throws to avoid damage from attacks and effects that target an area, such as a fireball spell, so long as they are adjacent to another creature benefitting from this tactic.\n\nWhen a creature affected by this tactic fails their Dexterity saving throw against such an effect, you may spend a reaction to allow them to reroll the saving throw.","modifyId":"TACTICS"},"DEADLY_HERDSMAN_TACTIC":{"id":"DEADLY_HERDSMAN_TACTIC","type":"TACTIC","name":"deadly herdsman (tactic)","text":"Whenever a creature benefiting from this tactic successfully deals damage to an enemy with an attack, they may shove the target as a bonus action. The forced movement can provoke an opportunity attack from allies other than the one initiating the movement.","modifyId":"TACTICS"},"FORTIFYING_PHALANX_TACTIC":{"id":"FORTIFYING_PHALANX_TACTIC","type":"TACTIC","name":"fortifying phalanx (tactic)","text":"Creatures affected by this tactic that are within range gain a +2 bonus on Constitution saving throws to avoid damage from attacks and effects that target an area, such as a stinking cloud spell, so long as they are adjacent to another creature benefitting from this tactic.\n\nWhen a creature affected by this tactic fails a Constitution saving throw, you may spend a reaction to allow them to reroll the save.","modifyId":"TACTICS"},"IRONCLAD_TACTIC":{"id":"IRONCLAD_TACTIC","type":"TACTIC","name":"ironclad (tactic)","text":"Creatures affected by this tactic that are within range reduce bludgeoning, piercing, and slashing damage from non-magical sources by an amount equal to your proficiency bonus.","modifyId":"TACTICS"},"MILITANT_WILL_TACTIC":{"id":"MILITANT_WILL_TACTIC","type":"TACTIC","name":"militant will (tactic)","text":"Creatures affected by this tactic that are within range gain a +2 bonus on saving throws against the charmed and frightened conditions.\n\nWhen a creature affected by this tactic fails their saving throw against such an effect, you may spend a reaction to allow them to reroll the save.","modifyId":"TACTICS"},"PREPARATION_TACTIC":{"id":"PREPARATION_TACTIC","type":"TACTIC","name":"preparation (tactic)","text":"Creatures affected by this tactic that are within range gain a bonus to their initiative checks equal to your proficiency bonus. A creature cannot benefit from this tactic for more than an hour in total. The ability to benefit from it is regained after completing a long rest.","modifyId":"TACTICS"},"REACTIVE_POSITION_TACTIC":{"id":"REACTIVE_POSITION_TACTIC","type":"TACTIC","name":"reactive position (tactic)","text":"A creature affected by this tactic may swap places with another affected adjacent ally as a reaction. This movement does not provoke opportunity attacks.","modifyId":"TACTICS"},"SHIELDBROTHERS_TACTIC":{"id":"SHIELDBROTHERS_TACTIC","type":"TACTIC","name":"shieldbrothers (tactic)","text":"As long as a creature affected by this tactic is adjacent to at least one other affected ally, they gain a +2 bonus to AC.","modifyId":"TACTICS"},"CALL_ATTENTION_SHOUT":{"id":"CALL_ATTENTION_SHOUT","type":"SHOUT","name":"call attention (shout)","text":"When you use this shout, your opponents’ attention is drawn to you for its duration, making it hard for them to focus on your allies. Allies within the shout’s affected area have advantage on Dexterity (Stealth) checks for 1 round, but you automatically fail any Dexterity (Stealth) checks for the shout’s duration.","modifyId":"SHOUTS"},"FOCUSING_CRY_SHOUT":{"id":"FOCUSING_CRY_SHOUT","type":"SHOUT","name":"focusing cry (shout)","text":"You may expend your martial focus to use this shout to restore the martial focus of a number of creatures equal to half your proficiency bonus other than yourself within the shout’s affected area.","modifyId":"SHOUTS"},"FRIGHTFUL_ROAR_SHOUT":{"id":"FRIGHTFUL_ROAR_SHOUT","type":"SHOUT","name":"frightful roar (shout)","text":"You may expend your martial focus to use this shout to demoralize enemies, forcing hostile creatures within its radius to succeed on a Wisdom saving throw or be frightened for 1 round. While frightened by this shout, a creature must take the Dash action and move away from you by the safest available route on each of its turns, unless there is nowhere to move. If the creature ends its turn in a location where it doesn’t have line of sight to you, the creature can make a Wisdom saving throw. On a successful save, the frightened condition ends for that creature. This talent may be taken up to twice; the second time this talent is taken, any creature affected by this shout who is already frightened is instead frightened for 1 minute.","modifyId":"SHOUTS"},"HARANGUE_SHOUT":{"id":"HARANGUE_SHOUT","type":"SHOUT","name":"harangue (shout)","text":"You may expend your martial focus to use this shout, allowing all allies within its area to make a new saving throw against any ongoing effect they are currently suffering from that normally grants a saving throw using the original DC, even if they have already failed the initial save and would not normally be granted another. Effects that can worsen on a failed saving throw do not count this saving throw as a failure when determining such effects if it is unsuccessful. A creature can only benefit from this shout once per short rest.","modifyId":"SHOUTS"},"RALLYING_SPEECH_SHOUT":{"id":"RALLYING_SPEECH_SHOUT","type":"SHOUT","name":"rallying speech (shout)","text":"You may expend your martial focus to rally your allies and empower their minds. Affected allies have advantage on all saving throws against effects that would make them charmed or frightened for 1 minute.","modifyId":"SHOUTS"},"ROUSING_CLAXON_SHOUT":{"id":"ROUSING_CLAXON_SHOUT","type":"SHOUT","name":"rousing claxon (shout)","text":"You may expend your martial focus to grant all affected allies a number of temporary hit points equal to your proficiency bonus and let them treat their exhaustion as 1 level lower for 1 hour. A target cannot regain this talent’s benefits until they finish a short or long rest.","modifyId":"SHOUTS"},"AGGRESSIVE_FLANKING_TACTIC":{"id":"AGGRESSIVE_FLANKING_TACTIC","type":"TACTIC","name":"aggressive flanking (tactic)","text":"When two allied creatures affected by this tactic both have the same hostile creature within their reach, they gain a +2 bonus to attack rolls against them.","modifyId":"TACTICS"},"FIERCE_SHOUT_SHOUT":{"id":"FIERCE_SHOUT_SHOUT","type":"SHOUT","name":"fierce shout (shout)","text":"When you use this shout, affected allies gain a bonus equal to your proficiency bonus on the damage roll of the first attack they make within 1 round.","modifyId":"SHOUTS"}}